mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s

stm32f103x8.axf:     file format elf32-littlearm


Disassembly of section .isr_vector:

08000000 <g_pfnVectors>:
 8000000:	20005000 	andcs	r5, r0, r0
 8000004:	08001029 	stmdaeq	r0, {r0, r3, r5, ip}
 8000008:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 800000c:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000010:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000014:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000018:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
	...
 800002c:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000030:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000034:	00000000 	andeq	r0, r0, r0
 8000038:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 800003c:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000040:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000044:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000048:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 800004c:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000050:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000054:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000058:	08000555 	stmdaeq	r0, {r0, r2, r4, r6, r8, sl}
 800005c:	08000579 	stmdaeq	r0, {r0, r3, r4, r5, r6, r8, sl}
 8000060:	0800059d 	stmdaeq	r0, {r0, r2, r3, r4, r7, r8, sl}
 8000064:	080005c1 	stmdaeq	r0, {r0, r6, r7, r8, sl}
 8000068:	080005e5 	stmdaeq	r0, {r0, r2, r5, r6, r7, r8, sl}
 800006c:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000070:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000074:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000078:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 800007c:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000080:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000084:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000088:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 800008c:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000090:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000094:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000098:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 800009c:	08000609 	stmdaeq	r0, {r0, r3, r9, sl}
 80000a0:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 80000a4:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 80000a8:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 80000ac:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 80000b0:	08000a3d 	stmdaeq	r0, {r0, r2, r3, r4, r5, r9, fp}
 80000b4:	08000aa1 	stmdaeq	r0, {r0, r5, r7, r9, fp}
 80000b8:	08000af9 	stmdaeq	r0, {r0, r3, r4, r5, r6, r7, r9, fp}
 80000bc:	08000b51 	stmdaeq	r0, {r0, r4, r6, r8, r9, fp}
 80000c0:	08000c49 	stmdaeq	r0, {r0, r3, r6, sl, fp}
 80000c4:	08000d3d 	stmdaeq	r0, {r0, r2, r3, r4, r5, r8, sl, fp}
 80000c8:	08000e39 	stmdaeq	r0, {r0, r3, r4, r5, r9, sl, fp}
 80000cc:	08000f31 	stmdaeq	r0, {r0, r4, r5, r8, r9, sl, fp}
 80000d0:	08000f45 	stmdaeq	r0, {r0, r2, r6, r8, r9, sl, fp}
 80000d4:	08000f59 	stmdaeq	r0, {r0, r3, r4, r6, r8, r9, sl, fp}
 80000d8:	08000f6d 	stmdaeq	r0, {r0, r2, r3, r5, r6, r8, r9, sl, fp}
 80000dc:	08000f81 	stmdaeq	r0, {r0, r7, r8, r9, sl, fp}
 80000e0:	080006b1 	stmdaeq	r0, {r0, r4, r5, r7, r9, sl}
 80000e4:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 80000e8:	00000000 	andeq	r0, r0, r0
 80000ec:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 80000f0:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 80000f4:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 80000f8:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 80000fc:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000100:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000104:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000108:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 800010c:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000110:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000114:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000118:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 800011c:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000120:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000124:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 8000128:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}
 800012c:	08001079 	stmdaeq	r0, {r0, r3, r4, r5, r6, ip}

Disassembly of section .text:

08000130 <__do_global_dtors_aux>:
 8000130:	b510      	push	{r4, lr}
 8000132:	4c05      	ldr	r4, [pc, #20]	; (8000148 <__do_global_dtors_aux+0x18>)
 8000134:	7823      	ldrb	r3, [r4, #0]
 8000136:	b933      	cbnz	r3, 8000146 <__do_global_dtors_aux+0x16>
 8000138:	4b04      	ldr	r3, [pc, #16]	; (800014c <__do_global_dtors_aux+0x1c>)
 800013a:	b113      	cbz	r3, 8000142 <__do_global_dtors_aux+0x12>
 800013c:	4804      	ldr	r0, [pc, #16]	; (8000150 <__do_global_dtors_aux+0x20>)
 800013e:	f3af 8000 	nop.w
 8000142:	2301      	movs	r3, #1
 8000144:	7023      	strb	r3, [r4, #0]
 8000146:	bd10      	pop	{r4, pc}
 8000148:	20000000 	andcs	r0, r0, r0
 800014c:	00000000 	andeq	r0, r0, r0
 8000150:	080010c4 	stmdaeq	r0, {r2, r6, r7, ip}

08000154 <frame_dummy>:
 8000154:	b508      	push	{r3, lr}
 8000156:	4b03      	ldr	r3, [pc, #12]	; (8000164 <frame_dummy+0x10>)
 8000158:	b11b      	cbz	r3, 8000162 <frame_dummy+0xe>
 800015a:	4903      	ldr	r1, [pc, #12]	; (8000168 <frame_dummy+0x14>)
 800015c:	4803      	ldr	r0, [pc, #12]	; (800016c <frame_dummy+0x18>)
 800015e:	f3af 8000 	nop.w
 8000162:	bd08      	pop	{r3, pc}
 8000164:	00000000 	andeq	r0, r0, r0
 8000168:	20000004 	andcs	r0, r0, r4
 800016c:	080010c4 	stmdaeq	r0, {r2, r6, r7, ip}

08000170 <EXTI_NVIC_EN>:
 8000170:	b480      	push	{r7}
 8000172:	b083      	sub	sp, #12
 8000174:	af00      	add	r7, sp, #0
 8000176:	4603      	mov	r3, r0
 8000178:	71fb      	strb	r3, [r7, #7]
 800017a:	79fb      	ldrb	r3, [r7, #7]
 800017c:	2b0f      	cmp	r3, #15
 800017e:	d854      	bhi.n	800022a <EXTI_NVIC_EN+0xba>
 8000180:	a201      	add	r2, pc, #4	; (adr r2, 8000188 <EXTI_NVIC_EN+0x18>)
 8000182:	f852 f023 	ldr.w	pc, [r2, r3, lsl #2]
 8000186:	bf00      	nop
 8000188:	080001c9 	stmdaeq	r0, {r0, r3, r6, r7, r8}
 800018c:	080001d7 	stmdaeq	r0, {r0, r1, r2, r4, r6, r7, r8}
 8000190:	080001e5 	stmdaeq	r0, {r0, r2, r5, r6, r7, r8}
 8000194:	080001f3 	stmdaeq	r0, {r0, r1, r4, r5, r6, r7, r8}
 8000198:	08000201 	stmdaeq	r0, {r0, r9}
 800019c:	0800020f 	stmdaeq	r0, {r0, r1, r2, r3, r9}
 80001a0:	0800020f 	stmdaeq	r0, {r0, r1, r2, r3, r9}
 80001a4:	0800020f 	stmdaeq	r0, {r0, r1, r2, r3, r9}
 80001a8:	0800020f 	stmdaeq	r0, {r0, r1, r2, r3, r9}
 80001ac:	0800020f 	stmdaeq	r0, {r0, r1, r2, r3, r9}
 80001b0:	0800021d 	stmdaeq	r0, {r0, r2, r3, r4, r9}
 80001b4:	0800021d 	stmdaeq	r0, {r0, r2, r3, r4, r9}
 80001b8:	0800021d 	stmdaeq	r0, {r0, r2, r3, r4, r9}
 80001bc:	0800021d 	stmdaeq	r0, {r0, r2, r3, r4, r9}
 80001c0:	0800021d 	stmdaeq	r0, {r0, r2, r3, r4, r9}
 80001c4:	0800021d 	stmdaeq	r0, {r0, r2, r3, r4, r9}
 80001c8:	4b1a      	ldr	r3, [pc, #104]	; (8000234 <EXTI_NVIC_EN+0xc4>)
 80001ca:	681b      	ldr	r3, [r3, #0]
 80001cc:	4a19      	ldr	r2, [pc, #100]	; (8000234 <EXTI_NVIC_EN+0xc4>)
 80001ce:	f043 0340 	orr.w	r3, r3, #64	; 0x40
 80001d2:	6013      	str	r3, [r2, #0]
 80001d4:	e029      	b.n	800022a <EXTI_NVIC_EN+0xba>
 80001d6:	4b17      	ldr	r3, [pc, #92]	; (8000234 <EXTI_NVIC_EN+0xc4>)
 80001d8:	681b      	ldr	r3, [r3, #0]
 80001da:	4a16      	ldr	r2, [pc, #88]	; (8000234 <EXTI_NVIC_EN+0xc4>)
 80001dc:	f043 0380 	orr.w	r3, r3, #128	; 0x80
 80001e0:	6013      	str	r3, [r2, #0]
 80001e2:	e022      	b.n	800022a <EXTI_NVIC_EN+0xba>
 80001e4:	4b13      	ldr	r3, [pc, #76]	; (8000234 <EXTI_NVIC_EN+0xc4>)
 80001e6:	681b      	ldr	r3, [r3, #0]
 80001e8:	4a12      	ldr	r2, [pc, #72]	; (8000234 <EXTI_NVIC_EN+0xc4>)
 80001ea:	f443 7380 	orr.w	r3, r3, #256	; 0x100
 80001ee:	6013      	str	r3, [r2, #0]
 80001f0:	e01b      	b.n	800022a <EXTI_NVIC_EN+0xba>
 80001f2:	4b10      	ldr	r3, [pc, #64]	; (8000234 <EXTI_NVIC_EN+0xc4>)
 80001f4:	681b      	ldr	r3, [r3, #0]
 80001f6:	4a0f      	ldr	r2, [pc, #60]	; (8000234 <EXTI_NVIC_EN+0xc4>)
 80001f8:	f443 7300 	orr.w	r3, r3, #512	; 0x200
 80001fc:	6013      	str	r3, [r2, #0]
 80001fe:	e014      	b.n	800022a <EXTI_NVIC_EN+0xba>
 8000200:	4b0c      	ldr	r3, [pc, #48]	; (8000234 <EXTI_NVIC_EN+0xc4>)
 8000202:	681b      	ldr	r3, [r3, #0]
 8000204:	4a0b      	ldr	r2, [pc, #44]	; (8000234 <EXTI_NVIC_EN+0xc4>)
 8000206:	f443 6380 	orr.w	r3, r3, #1024	; 0x400
 800020a:	6013      	str	r3, [r2, #0]
 800020c:	e00d      	b.n	800022a <EXTI_NVIC_EN+0xba>
 800020e:	4b09      	ldr	r3, [pc, #36]	; (8000234 <EXTI_NVIC_EN+0xc4>)
 8000210:	681b      	ldr	r3, [r3, #0]
 8000212:	4a08      	ldr	r2, [pc, #32]	; (8000234 <EXTI_NVIC_EN+0xc4>)
 8000214:	f443 0300 	orr.w	r3, r3, #8388608	; 0x800000
 8000218:	6013      	str	r3, [r2, #0]
 800021a:	e006      	b.n	800022a <EXTI_NVIC_EN+0xba>
 800021c:	4b06      	ldr	r3, [pc, #24]	; (8000238 <EXTI_NVIC_EN+0xc8>)
 800021e:	681b      	ldr	r3, [r3, #0]
 8000220:	4a05      	ldr	r2, [pc, #20]	; (8000238 <EXTI_NVIC_EN+0xc8>)
 8000222:	f443 7380 	orr.w	r3, r3, #256	; 0x100
 8000226:	6013      	str	r3, [r2, #0]
 8000228:	bf00      	nop
 800022a:	bf00      	nop
 800022c:	370c      	adds	r7, #12
 800022e:	46bd      	mov	sp, r7
 8000230:	bc80      	pop	{r7}
 8000232:	4770      	bx	lr
 8000234:	e000e100 	and	lr, r0, r0, lsl #2
 8000238:	e000e104 	and	lr, r0, r4, lsl #2

0800023c <EXTI_NVIC_DIS>:
 800023c:	b480      	push	{r7}
 800023e:	b083      	sub	sp, #12
 8000240:	af00      	add	r7, sp, #0
 8000242:	4603      	mov	r3, r0
 8000244:	71fb      	strb	r3, [r7, #7]
 8000246:	79fb      	ldrb	r3, [r7, #7]
 8000248:	2b0f      	cmp	r3, #15
 800024a:	d854      	bhi.n	80002f6 <EXTI_NVIC_DIS+0xba>
 800024c:	a201      	add	r2, pc, #4	; (adr r2, 8000254 <EXTI_NVIC_DIS+0x18>)
 800024e:	f852 f023 	ldr.w	pc, [r2, r3, lsl #2]
 8000252:	bf00      	nop
 8000254:	08000295 	stmdaeq	r0, {r0, r2, r4, r7, r9}
 8000258:	080002a3 	stmdaeq	r0, {r0, r1, r5, r7, r9}
 800025c:	080002b1 	stmdaeq	r0, {r0, r4, r5, r7, r9}
 8000260:	080002bf 	stmdaeq	r0, {r0, r1, r2, r3, r4, r5, r7, r9}
 8000264:	080002cd 	stmdaeq	r0, {r0, r2, r3, r6, r7, r9}
 8000268:	080002db 	stmdaeq	r0, {r0, r1, r3, r4, r6, r7, r9}
 800026c:	080002db 	stmdaeq	r0, {r0, r1, r3, r4, r6, r7, r9}
 8000270:	080002db 	stmdaeq	r0, {r0, r1, r3, r4, r6, r7, r9}
 8000274:	080002db 	stmdaeq	r0, {r0, r1, r3, r4, r6, r7, r9}
 8000278:	080002db 	stmdaeq	r0, {r0, r1, r3, r4, r6, r7, r9}
 800027c:	080002e9 	stmdaeq	r0, {r0, r3, r5, r6, r7, r9}
 8000280:	080002e9 	stmdaeq	r0, {r0, r3, r5, r6, r7, r9}
 8000284:	080002e9 	stmdaeq	r0, {r0, r3, r5, r6, r7, r9}
 8000288:	080002e9 	stmdaeq	r0, {r0, r3, r5, r6, r7, r9}
 800028c:	080002e9 	stmdaeq	r0, {r0, r3, r5, r6, r7, r9}
 8000290:	080002e9 	stmdaeq	r0, {r0, r3, r5, r6, r7, r9}
 8000294:	4b1a      	ldr	r3, [pc, #104]	; (8000300 <EXTI_NVIC_DIS+0xc4>)
 8000296:	681b      	ldr	r3, [r3, #0]
 8000298:	4a19      	ldr	r2, [pc, #100]	; (8000300 <EXTI_NVIC_DIS+0xc4>)
 800029a:	f043 0340 	orr.w	r3, r3, #64	; 0x40
 800029e:	6013      	str	r3, [r2, #0]
 80002a0:	e029      	b.n	80002f6 <EXTI_NVIC_DIS+0xba>
 80002a2:	4b17      	ldr	r3, [pc, #92]	; (8000300 <EXTI_NVIC_DIS+0xc4>)
 80002a4:	681b      	ldr	r3, [r3, #0]
 80002a6:	4a16      	ldr	r2, [pc, #88]	; (8000300 <EXTI_NVIC_DIS+0xc4>)
 80002a8:	f043 0380 	orr.w	r3, r3, #128	; 0x80
 80002ac:	6013      	str	r3, [r2, #0]
 80002ae:	e022      	b.n	80002f6 <EXTI_NVIC_DIS+0xba>
 80002b0:	4b13      	ldr	r3, [pc, #76]	; (8000300 <EXTI_NVIC_DIS+0xc4>)
 80002b2:	681b      	ldr	r3, [r3, #0]
 80002b4:	4a12      	ldr	r2, [pc, #72]	; (8000300 <EXTI_NVIC_DIS+0xc4>)
 80002b6:	f443 7380 	orr.w	r3, r3, #256	; 0x100
 80002ba:	6013      	str	r3, [r2, #0]
 80002bc:	e01b      	b.n	80002f6 <EXTI_NVIC_DIS+0xba>
 80002be:	4b10      	ldr	r3, [pc, #64]	; (8000300 <EXTI_NVIC_DIS+0xc4>)
 80002c0:	681b      	ldr	r3, [r3, #0]
 80002c2:	4a0f      	ldr	r2, [pc, #60]	; (8000300 <EXTI_NVIC_DIS+0xc4>)
 80002c4:	f443 7300 	orr.w	r3, r3, #512	; 0x200
 80002c8:	6013      	str	r3, [r2, #0]
 80002ca:	e014      	b.n	80002f6 <EXTI_NVIC_DIS+0xba>
 80002cc:	4b0c      	ldr	r3, [pc, #48]	; (8000300 <EXTI_NVIC_DIS+0xc4>)
 80002ce:	681b      	ldr	r3, [r3, #0]
 80002d0:	4a0b      	ldr	r2, [pc, #44]	; (8000300 <EXTI_NVIC_DIS+0xc4>)
 80002d2:	f443 6380 	orr.w	r3, r3, #1024	; 0x400
 80002d6:	6013      	str	r3, [r2, #0]
 80002d8:	e00d      	b.n	80002f6 <EXTI_NVIC_DIS+0xba>
 80002da:	4b09      	ldr	r3, [pc, #36]	; (8000300 <EXTI_NVIC_DIS+0xc4>)
 80002dc:	681b      	ldr	r3, [r3, #0]
 80002de:	4a08      	ldr	r2, [pc, #32]	; (8000300 <EXTI_NVIC_DIS+0xc4>)
 80002e0:	f443 0300 	orr.w	r3, r3, #8388608	; 0x800000
 80002e4:	6013      	str	r3, [r2, #0]
 80002e6:	e006      	b.n	80002f6 <EXTI_NVIC_DIS+0xba>
 80002e8:	4b06      	ldr	r3, [pc, #24]	; (8000304 <EXTI_NVIC_DIS+0xc8>)
 80002ea:	681b      	ldr	r3, [r3, #0]
 80002ec:	4a05      	ldr	r2, [pc, #20]	; (8000304 <EXTI_NVIC_DIS+0xc8>)
 80002ee:	f443 7380 	orr.w	r3, r3, #256	; 0x100
 80002f2:	6013      	str	r3, [r2, #0]
 80002f4:	bf00      	nop
 80002f6:	bf00      	nop
 80002f8:	370c      	adds	r7, #12
 80002fa:	46bd      	mov	sp, r7
 80002fc:	bc80      	pop	{r7}
 80002fe:	4770      	bx	lr
 8000300:	e000e180 	and	lr, r0, r0, lsl #3
 8000304:	e000e184 	and	lr, r0, r4, lsl #3

08000308 <EXTI_AFIO_EXTICR_shift>:
 8000308:	b480      	push	{r7}
 800030a:	b085      	sub	sp, #20
 800030c:	af00      	add	r7, sp, #0
 800030e:	4603      	mov	r3, r0
 8000310:	71fb      	strb	r3, [r7, #7]
 8000312:	79fb      	ldrb	r3, [r7, #7]
 8000314:	2b0f      	cmp	r3, #15
 8000316:	d82f      	bhi.n	8000378 <EXTI_AFIO_EXTICR_shift+0x70>
 8000318:	a201      	add	r2, pc, #4	; (adr r2, 8000320 <EXTI_AFIO_EXTICR_shift+0x18>)
 800031a:	f852 f023 	ldr.w	pc, [r2, r3, lsl #2]
 800031e:	bf00      	nop
 8000320:	08000361 	stmdaeq	r0, {r0, r5, r6, r8, r9}
 8000324:	08000367 	stmdaeq	r0, {r0, r1, r2, r5, r6, r8, r9}
 8000328:	0800036d 	stmdaeq	r0, {r0, r2, r3, r5, r6, r8, r9}
 800032c:	08000373 	stmdaeq	r0, {r0, r1, r4, r5, r6, r8, r9}
 8000330:	08000361 	stmdaeq	r0, {r0, r5, r6, r8, r9}
 8000334:	08000367 	stmdaeq	r0, {r0, r1, r2, r5, r6, r8, r9}
 8000338:	0800036d 	stmdaeq	r0, {r0, r2, r3, r5, r6, r8, r9}
 800033c:	08000373 	stmdaeq	r0, {r0, r1, r4, r5, r6, r8, r9}
 8000340:	08000361 	stmdaeq	r0, {r0, r5, r6, r8, r9}
 8000344:	08000367 	stmdaeq	r0, {r0, r1, r2, r5, r6, r8, r9}
 8000348:	0800036d 	stmdaeq	r0, {r0, r2, r3, r5, r6, r8, r9}
 800034c:	08000373 	stmdaeq	r0, {r0, r1, r4, r5, r6, r8, r9}
 8000350:	08000361 	stmdaeq	r0, {r0, r5, r6, r8, r9}
 8000354:	08000367 	stmdaeq	r0, {r0, r1, r2, r5, r6, r8, r9}
 8000358:	0800036d 	stmdaeq	r0, {r0, r2, r3, r5, r6, r8, r9}
 800035c:	08000373 	stmdaeq	r0, {r0, r1, r4, r5, r6, r8, r9}
 8000360:	2300      	movs	r3, #0
 8000362:	73fb      	strb	r3, [r7, #15]
 8000364:	e008      	b.n	8000378 <EXTI_AFIO_EXTICR_shift+0x70>
 8000366:	2304      	movs	r3, #4
 8000368:	73fb      	strb	r3, [r7, #15]
 800036a:	e005      	b.n	8000378 <EXTI_AFIO_EXTICR_shift+0x70>
 800036c:	2308      	movs	r3, #8
 800036e:	73fb      	strb	r3, [r7, #15]
 8000370:	e002      	b.n	8000378 <EXTI_AFIO_EXTICR_shift+0x70>
 8000372:	230c      	movs	r3, #12
 8000374:	73fb      	strb	r3, [r7, #15]
 8000376:	bf00      	nop
 8000378:	7bfb      	ldrb	r3, [r7, #15]
 800037a:	4618      	mov	r0, r3
 800037c:	3714      	adds	r7, #20
 800037e:	46bd      	mov	sp, r7
 8000380:	bc80      	pop	{r7}
 8000382:	4770      	bx	lr

