mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
08000384 <MCAL_EXTI_Init>:
 8000384:	b580      	push	{r7, lr}
 8000386:	b084      	sub	sp, #16
 8000388:	af00      	add	r7, sp, #0
 800038a:	6078      	str	r0, [r7, #4]
 800038c:	687b      	ldr	r3, [r7, #4]
 800038e:	3304      	adds	r3, #4
 8000390:	4618      	mov	r0, r3
 8000392:	f000 fa45 	bl	8000820 <MCAL_GPIO_Init>
 8000396:	687b      	ldr	r3, [r7, #4]
 8000398:	781b      	ldrb	r3, [r3, #0]
 800039a:	089b      	lsrs	r3, r3, #2
 800039c:	73fb      	strb	r3, [r7, #15]
 800039e:	687b      	ldr	r3, [r7, #4]
 80003a0:	781b      	ldrb	r3, [r3, #0]
 80003a2:	4618      	mov	r0, r3
 80003a4:	f7ff ffb0 	bl	8000308 <EXTI_AFIO_EXTICR_shift>
 80003a8:	4603      	mov	r3, r0
 80003aa:	73bb      	strb	r3, [r7, #14]
 80003ac:	4a61      	ldr	r2, [pc, #388]	; (8000534 <MCAL_EXTI_Init+0x1b0>)
 80003ae:	7bfb      	ldrb	r3, [r7, #15]
 80003b0:	3302      	adds	r3, #2
 80003b2:	f852 2023 	ldr.w	r2, [r2, r3, lsl #2]
 80003b6:	7bbb      	ldrb	r3, [r7, #14]
 80003b8:	210f      	movs	r1, #15
 80003ba:	fa01 f303 	lsl.w	r3, r1, r3
 80003be:	43db      	mvns	r3, r3
 80003c0:	4618      	mov	r0, r3
 80003c2:	495c      	ldr	r1, [pc, #368]	; (8000534 <MCAL_EXTI_Init+0x1b0>)
 80003c4:	7bfb      	ldrb	r3, [r7, #15]
 80003c6:	4002      	ands	r2, r0
 80003c8:	3302      	adds	r3, #2
 80003ca:	f841 2023 	str.w	r2, [r1, r3, lsl #2]
 80003ce:	4a59      	ldr	r2, [pc, #356]	; (8000534 <MCAL_EXTI_Init+0x1b0>)
 80003d0:	7bfb      	ldrb	r3, [r7, #15]
 80003d2:	3302      	adds	r3, #2
 80003d4:	f852 2023 	ldr.w	r2, [r2, r3, lsl #2]
 80003d8:	687b      	ldr	r3, [r7, #4]
 80003da:	685b      	ldr	r3, [r3, #4]
 80003dc:	4956      	ldr	r1, [pc, #344]	; (8000538 <MCAL_EXTI_Init+0x1b4>)
 80003de:	428b      	cmp	r3, r1
 80003e0:	d01d      	beq.n	800041e <MCAL_EXTI_Init+0x9a>
 80003e2:	687b      	ldr	r3, [r7, #4]
 80003e4:	685b      	ldr	r3, [r3, #4]
 80003e6:	4955      	ldr	r1, [pc, #340]	; (800053c <MCAL_EXTI_Init+0x1b8>)
 80003e8:	428b      	cmp	r3, r1
 80003ea:	d016      	beq.n	800041a <MCAL_EXTI_Init+0x96>
 80003ec:	687b      	ldr	r3, [r7, #4]
 80003ee:	685b      	ldr	r3, [r3, #4]
 80003f0:	4953      	ldr	r1, [pc, #332]	; (8000540 <MCAL_EXTI_Init+0x1bc>)
 80003f2:	428b      	cmp	r3, r1
 80003f4:	d00f      	beq.n	8000416 <MCAL_EXTI_Init+0x92>
 80003f6:	687b      	ldr	r3, [r7, #4]
 80003f8:	685b      	ldr	r3, [r3, #4]
 80003fa:	4952      	ldr	r1, [pc, #328]	; (8000544 <MCAL_EXTI_Init+0x1c0>)
 80003fc:	428b      	cmp	r3, r1
 80003fe:	d008      	beq.n	8000412 <MCAL_EXTI_Init+0x8e>
 8000400:	687b      	ldr	r3, [r7, #4]
 8000402:	685b      	ldr	r3, [r3, #4]
 8000404:	4950      	ldr	r1, [pc, #320]	; (8000548 <MCAL_EXTI_Init+0x1c4>)
 8000406:	428b      	cmp	r3, r1
 8000408:	d101      	bne.n	800040e <MCAL_EXTI_Init+0x8a>
 800040a:	2304      	movs	r3, #4
 800040c:	e008      	b.n	8000420 <MCAL_EXTI_Init+0x9c>
 800040e:	2300      	movs	r3, #0
 8000410:	e006      	b.n	8000420 <MCAL_EXTI_Init+0x9c>
 8000412:	2303      	movs	r3, #3
 8000414:	e004      	b.n	8000420 <MCAL_EXTI_Init+0x9c>
 8000416:	2302      	movs	r3, #2
 8000418:	e002      	b.n	8000420 <MCAL_EXTI_Init+0x9c>
 800041a:	2301      	movs	r3, #1
 800041c:	e000      	b.n	8000420 <MCAL_EXTI_Init+0x9c>
 800041e:	2300      	movs	r3, #0
 8000420:	7bb9      	ldrb	r1, [r7, #14]
 8000422:	408b      	lsls	r3, r1
 8000424:	4618      	mov	r0, r3
 8000426:	4943      	ldr	r1, [pc, #268]	; (8000534 <MCAL_EXTI_Init+0x1b0>)
 8000428:	7bfb      	ldrb	r3, [r7, #15]
 800042a:	4302      	orrs	r2, r0
 800042c:	3302      	adds	r3, #2
 800042e:	f841 2023 	str.w	r2, [r1, r3, lsl #2]
 8000432:	4b46      	ldr	r3, [pc, #280]	; (800054c <MCAL_EXTI_Init+0x1c8>)
 8000434:	689b      	ldr	r3, [r3, #8]
 8000436:	687a      	ldr	r2, [r7, #4]
 8000438:	7812      	ldrb	r2, [r2, #0]
 800043a:	4611      	mov	r1, r2
 800043c:	2201      	movs	r2, #1
 800043e:	408a      	lsls	r2, r1
 8000440:	43d2      	mvns	r2, r2
 8000442:	4611      	mov	r1, r2
 8000444:	4a41      	ldr	r2, [pc, #260]	; (800054c <MCAL_EXTI_Init+0x1c8>)
 8000446:	400b      	ands	r3, r1
 8000448:	6093      	str	r3, [r2, #8]
 800044a:	4b40      	ldr	r3, [pc, #256]	; (800054c <MCAL_EXTI_Init+0x1c8>)
 800044c:	68db      	ldr	r3, [r3, #12]
 800044e:	687a      	ldr	r2, [r7, #4]
 8000450:	7812      	ldrb	r2, [r2, #0]
 8000452:	4611      	mov	r1, r2
 8000454:	2201      	movs	r2, #1
 8000456:	408a      	lsls	r2, r1
 8000458:	43d2      	mvns	r2, r2
 800045a:	4611      	mov	r1, r2
 800045c:	4a3b      	ldr	r2, [pc, #236]	; (800054c <MCAL_EXTI_Init+0x1c8>)
 800045e:	400b      	ands	r3, r1
 8000460:	60d3      	str	r3, [r2, #12]
 8000462:	687b      	ldr	r3, [r7, #4]
 8000464:	7b1b      	ldrb	r3, [r3, #12]
 8000466:	2b01      	cmp	r3, #1
 8000468:	d00f      	beq.n	800048a <MCAL_EXTI_Init+0x106>
 800046a:	2b02      	cmp	r3, #2
 800046c:	d019      	beq.n	80004a2 <MCAL_EXTI_Init+0x11e>
 800046e:	2b00      	cmp	r3, #0
 8000470:	d12e      	bne.n	80004d0 <MCAL_EXTI_Init+0x14c>
 8000472:	4b36      	ldr	r3, [pc, #216]	; (800054c <MCAL_EXTI_Init+0x1c8>)
 8000474:	689b      	ldr	r3, [r3, #8]
 8000476:	687a      	ldr	r2, [r7, #4]
 8000478:	7812      	ldrb	r2, [r2, #0]
 800047a:	4611      	mov	r1, r2
 800047c:	2201      	movs	r2, #1
 800047e:	408a      	lsls	r2, r1
 8000480:	4611      	mov	r1, r2
 8000482:	4a32      	ldr	r2, [pc, #200]	; (800054c <MCAL_EXTI_Init+0x1c8>)
 8000484:	430b      	orrs	r3, r1
 8000486:	6093      	str	r3, [r2, #8]
 8000488:	e022      	b.n	80004d0 <MCAL_EXTI_Init+0x14c>
 800048a:	4b30      	ldr	r3, [pc, #192]	; (800054c <MCAL_EXTI_Init+0x1c8>)
 800048c:	68db      	ldr	r3, [r3, #12]
 800048e:	687a      	ldr	r2, [r7, #4]
 8000490:	7812      	ldrb	r2, [r2, #0]
 8000492:	4611      	mov	r1, r2
 8000494:	2201      	movs	r2, #1
 8000496:	408a      	lsls	r2, r1
 8000498:	4611      	mov	r1, r2
 800049a:	4a2c      	ldr	r2, [pc, #176]	; (800054c <MCAL_EXTI_Init+0x1c8>)
 800049c:	430b      	orrs	r3, r1
 800049e:	60d3      	str	r3, [r2, #12]
 80004a0:	e016      	b.n	80004d0 <MCAL_EXTI_Init+0x14c>
 80004a2:	4b2a      	ldr	r3, [pc, #168]	; (800054c <MCAL_EXTI_Init+0x1c8>)
 80004a4:	689b      	ldr	r3, [r3, #8]
 80004a6:	687a      	ldr	r2, [r7, #4]
 80004a8:	7812      	ldrb	r2, [r2, #0]
 80004aa:	4611      	mov	r1, r2
 80004ac:	2201      	movs	r2, #1
 80004ae:	408a      	lsls	r2, r1
 80004b0:	4611      	mov	r1, r2
 80004b2:	4a26      	ldr	r2, [pc, #152]	; (800054c <MCAL_EXTI_Init+0x1c8>)
 80004b4:	430b      	orrs	r3, r1
 80004b6:	6093      	str	r3, [r2, #8]
 80004b8:	4b24      	ldr	r3, [pc, #144]	; (800054c <MCAL_EXTI_Init+0x1c8>)
 80004ba:	68db      	ldr	r3, [r3, #12]
 80004bc:	687a      	ldr	r2, [r7, #4]
 80004be:	7812      	ldrb	r2, [r2, #0]
 80004c0:	4611      	mov	r1, r2
 80004c2:	2201      	movs	r2, #1
 80004c4:	408a      	lsls	r2, r1
 80004c6:	4611      	mov	r1, r2
 80004c8:	4a20      	ldr	r2, [pc, #128]	; (800054c <MCAL_EXTI_Init+0x1c8>)
 80004ca:	430b      	orrs	r3, r1
 80004cc:	60d3      	str	r3, [r2, #12]
 80004ce:	bf00      	nop
 80004d0:	687b      	ldr	r3, [r7, #4]
 80004d2:	781b      	ldrb	r3, [r3, #0]
 80004d4:	4619      	mov	r1, r3
 80004d6:	687b      	ldr	r3, [r7, #4]
 80004d8:	691b      	ldr	r3, [r3, #16]
 80004da:	4a1d      	ldr	r2, [pc, #116]	; (8000550 <MCAL_EXTI_Init+0x1cc>)
 80004dc:	f842 3021 	str.w	r3, [r2, r1, lsl #2]
 80004e0:	687b      	ldr	r3, [r7, #4]
 80004e2:	7b5b      	ldrb	r3, [r3, #13]
 80004e4:	2b01      	cmp	r3, #1
 80004e6:	d110      	bne.n	800050a <MCAL_EXTI_Init+0x186>
 80004e8:	4b18      	ldr	r3, [pc, #96]	; (800054c <MCAL_EXTI_Init+0x1c8>)
 80004ea:	681b      	ldr	r3, [r3, #0]
 80004ec:	687a      	ldr	r2, [r7, #4]
 80004ee:	7812      	ldrb	r2, [r2, #0]
 80004f0:	4611      	mov	r1, r2
 80004f2:	2201      	movs	r2, #1
 80004f4:	408a      	lsls	r2, r1
 80004f6:	4611      	mov	r1, r2
 80004f8:	4a14      	ldr	r2, [pc, #80]	; (800054c <MCAL_EXTI_Init+0x1c8>)
 80004fa:	430b      	orrs	r3, r1
 80004fc:	6013      	str	r3, [r2, #0]
 80004fe:	687b      	ldr	r3, [r7, #4]
 8000500:	781b      	ldrb	r3, [r3, #0]
 8000502:	4618      	mov	r0, r3
 8000504:	f7ff fe34 	bl	8000170 <EXTI_NVIC_EN>
 8000508:	e010      	b.n	800052c <MCAL_EXTI_Init+0x1a8>
 800050a:	4b10      	ldr	r3, [pc, #64]	; (800054c <MCAL_EXTI_Init+0x1c8>)
 800050c:	681b      	ldr	r3, [r3, #0]
 800050e:	687a      	ldr	r2, [r7, #4]
 8000510:	7812      	ldrb	r2, [r2, #0]
 8000512:	4611      	mov	r1, r2
 8000514:	2201      	movs	r2, #1
 8000516:	408a      	lsls	r2, r1
 8000518:	43d2      	mvns	r2, r2
 800051a:	4611      	mov	r1, r2
 800051c:	4a0b      	ldr	r2, [pc, #44]	; (800054c <MCAL_EXTI_Init+0x1c8>)
 800051e:	400b      	ands	r3, r1
 8000520:	6013      	str	r3, [r2, #0]
 8000522:	687b      	ldr	r3, [r7, #4]
 8000524:	781b      	ldrb	r3, [r3, #0]
 8000526:	4618      	mov	r0, r3
 8000528:	f7ff fe88 	bl	800023c <EXTI_NVIC_DIS>
 800052c:	bf00      	nop
 800052e:	3710      	adds	r7, #16
 8000530:	46bd      	mov	sp, r7
 8000532:	bd80      	pop	{r7, pc}
 8000534:	40010000 	andmi	r0, r1, r0
 8000538:	40010800 	andmi	r0, r1, r0, lsl #16
 800053c:	40010c00 	andmi	r0, r1, r0, lsl #24
 8000540:	40011000 	andmi	r1, r1, r0
 8000544:	40011400 	andmi	r1, r1, r0, lsl #8
 8000548:	40011800 	andmi	r1, r1, r0, lsl #16
 800054c:	40010400 	andmi	r0, r1, r0, lsl #8
 8000550:	2000001c 	andcs	r0, r0, ip, lsl r0

08000554 <EXTI0_IRQHandler>:
 8000554:	b580      	push	{r7, lr}
 8000556:	af00      	add	r7, sp, #0
 8000558:	4b05      	ldr	r3, [pc, #20]	; (8000570 <EXTI0_IRQHandler+0x1c>)
 800055a:	695b      	ldr	r3, [r3, #20]
 800055c:	4a04      	ldr	r2, [pc, #16]	; (8000570 <EXTI0_IRQHandler+0x1c>)
 800055e:	f043 0301 	orr.w	r3, r3, #1
 8000562:	6153      	str	r3, [r2, #20]
 8000564:	4b03      	ldr	r3, [pc, #12]	; (8000574 <EXTI0_IRQHandler+0x20>)
 8000566:	681b      	ldr	r3, [r3, #0]
 8000568:	4798      	blx	r3
 800056a:	bf00      	nop
 800056c:	bd80      	pop	{r7, pc}
 800056e:	bf00      	nop
 8000570:	40010400 	andmi	r0, r1, r0, lsl #8
 8000574:	2000001c 	andcs	r0, r0, ip, lsl r0

08000578 <EXTI1_IRQHandler>:
 8000578:	b580      	push	{r7, lr}
 800057a:	af00      	add	r7, sp, #0
 800057c:	4b05      	ldr	r3, [pc, #20]	; (8000594 <EXTI1_IRQHandler+0x1c>)
 800057e:	695b      	ldr	r3, [r3, #20]
 8000580:	4a04      	ldr	r2, [pc, #16]	; (8000594 <EXTI1_IRQHandler+0x1c>)
 8000582:	f043 0302 	orr.w	r3, r3, #2
 8000586:	6153      	str	r3, [r2, #20]
 8000588:	4b03      	ldr	r3, [pc, #12]	; (8000598 <EXTI1_IRQHandler+0x20>)
 800058a:	685b      	ldr	r3, [r3, #4]
 800058c:	4798      	blx	r3
 800058e:	bf00      	nop
 8000590:	bd80      	pop	{r7, pc}
 8000592:	bf00      	nop
 8000594:	40010400 	andmi	r0, r1, r0, lsl #8
 8000598:	2000001c 	andcs	r0, r0, ip, lsl r0

0800059c <EXTI2_IRQHandler>:
 800059c:	b580      	push	{r7, lr}
 800059e:	af00      	add	r7, sp, #0
 80005a0:	4b05      	ldr	r3, [pc, #20]	; (80005b8 <EXTI2_IRQHandler+0x1c>)
 80005a2:	695b      	ldr	r3, [r3, #20]
 80005a4:	4a04      	ldr	r2, [pc, #16]	; (80005b8 <EXTI2_IRQHandler+0x1c>)
 80005a6:	f043 0304 	orr.w	r3, r3, #4
 80005aa:	6153      	str	r3, [r2, #20]
 80005ac:	4b03      	ldr	r3, [pc, #12]	; (80005bc <EXTI2_IRQHandler+0x20>)
 80005ae:	689b      	ldr	r3, [r3, #8]
 80005b0:	4798      	blx	r3
 80005b2:	bf00      	nop
 80005b4:	bd80      	pop	{r7, pc}
 80005b6:	bf00      	nop
 80005b8:	40010400 	andmi	r0, r1, r0, lsl #8
 80005bc:	2000001c 	andcs	r0, r0, ip, lsl r0

080005c0 <EXTI3_IRQHandler>:
 80005c0:	b580      	push	{r7, lr}
 80005c2:	af00      	add	r7, sp, #0
 80005c4:	4b05      	ldr	r3, [pc, #20]	; (80005dc <EXTI3_IRQHandler+0x1c>)
 80005c6:	695b      	ldr	r3, [r3, #20]
 80005c8:	4a04      	ldr	r2, [pc, #16]	; (80005dc <EXTI3_IRQHandler+0x1c>)
 80005ca:	f043 0308 	orr.w	r3, r3, #8
 80005ce:	6153      	str	r3, [r2, #20]
 80005d0:	4b03      	ldr	r3, [pc, #12]	; (80005e0 <EXTI3_IRQHandler+0x20>)
 80005d2:	68db      	ldr	r3, [r3, #12]
 80005d4:	4798      	blx	r3
 80005d6:	bf00      	nop
 80005d8:	bd80      	pop	{r7, pc}
 80005da:	bf00      	nop
 80005dc:	40010400 	andmi	r0, r1, r0, lsl #8
 80005e0:	2000001c 	andcs	r0, r0, ip, lsl r0

