mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
080005e4 <EXTI4_IRQHandler>:
 80005e4:	b580      	push	{r7, lr}
 80005e6:	af00      	add	r7, sp, #0
 80005e8:	4b05      	ldr	r3, [pc, #20]	; (8000600 <EXTI4_IRQHandler+0x1c>)
 80005ea:	695b      	ldr	r3, [r3, #20]
 80005ec:	4a04      	ldr	r2, [pc, #16]	; (8000600 <EXTI4_IRQHandler+0x1c>)
 80005ee:	f043 0310 	orr.w	r3, r3, #16
 80005f2:	6153      	str	r3, [r2, #20]
 80005f4:	4b03      	ldr	r3, [pc, #12]	; (8000604 <EXTI4_IRQHandler+0x20>)
 80005f6:	691b      	ldr	r3, [r3, #16]
 80005f8:	4798      	blx	r3
 80005fa:	bf00      	nop
 80005fc:	bd80      	pop	{r7, pc}
 80005fe:	bf00      	nop
 8000600:	40010400 	andmi	r0, r1, r0, lsl #8
 8000604:	2000001c 	andcs	r0, r0, ip, lsl r0

08000608 <EXTI9_5_IRQHandler>:
 8000608:	b580      	push	{r7, lr}
 800060a:	af00      	add	r7, sp, #0
 800060c:	4b26      	ldr	r3, [pc, #152]	; (80006a8 <EXTI9_5_IRQHandler+0xa0>)
 800060e:	695b      	ldr	r3, [r3, #20]
 8000610:	f003 0320 	and.w	r3, r3, #32
 8000614:	2b00      	cmp	r3, #0
 8000616:	d008      	beq.n	800062a <EXTI9_5_IRQHandler+0x22>
 8000618:	4b23      	ldr	r3, [pc, #140]	; (80006a8 <EXTI9_5_IRQHandler+0xa0>)
 800061a:	695b      	ldr	r3, [r3, #20]
 800061c:	4a22      	ldr	r2, [pc, #136]	; (80006a8 <EXTI9_5_IRQHandler+0xa0>)
 800061e:	f043 0320 	orr.w	r3, r3, #32
 8000622:	6153      	str	r3, [r2, #20]
 8000624:	4b21      	ldr	r3, [pc, #132]	; (80006ac <EXTI9_5_IRQHandler+0xa4>)
 8000626:	695b      	ldr	r3, [r3, #20]
 8000628:	4798      	blx	r3
 800062a:	4b1f      	ldr	r3, [pc, #124]	; (80006a8 <EXTI9_5_IRQHandler+0xa0>)
 800062c:	695b      	ldr	r3, [r3, #20]
 800062e:	f003 0340 	and.w	r3, r3, #64	; 0x40
 8000632:	2b00      	cmp	r3, #0
 8000634:	d008      	beq.n	8000648 <EXTI9_5_IRQHandler+0x40>
 8000636:	4b1c      	ldr	r3, [pc, #112]	; (80006a8 <EXTI9_5_IRQHandler+0xa0>)
 8000638:	695b      	ldr	r3, [r3, #20]
 800063a:	4a1b      	ldr	r2, [pc, #108]	; (80006a8 <EXTI9_5_IRQHandler+0xa0>)
 800063c:	f043 0340 	orr.w	r3, r3, #64	; 0x40
 8000640:	6153      	str	r3, [r2, #20]
 8000642:	4b1a      	ldr	r3, [pc, #104]	; (80006ac <EXTI9_5_IRQHandler+0xa4>)
 8000644:	699b      	ldr	r3, [r3, #24]
 8000646:	4798      	blx	r3
 8000648:	4b17      	ldr	r3, [pc, #92]	; (80006a8 <EXTI9_5_IRQHandler+0xa0>)
 800064a:	695b      	ldr	r3, [r3, #20]
 800064c:	f003 0380 	and.w	r3, r3, #128	; 0x80
 8000650:	2b00      	cmp	r3, #0
 8000652:	d008      	beq.n	8000666 <EXTI9_5_IRQHandler+0x5e>
 8000654:	4b14      	ldr	r3, [pc, #80]	; (80006a8 <EXTI9_5_IRQHandler+0xa0>)
 8000656:	695b      	ldr	r3, [r3, #20]
 8000658:	4a13      	ldr	r2, [pc, #76]	; (80006a8 <EXTI9_5_IRQHandler+0xa0>)
 800065a:	f043 0380 	orr.w	r3, r3, #128	; 0x80
 800065e:	6153      	str	r3, [r2, #20]
 8000660:	4b12      	ldr	r3, [pc, #72]	; (80006ac <EXTI9_5_IRQHandler+0xa4>)
 8000662:	69db      	ldr	r3, [r3, #28]
 8000664:	4798      	blx	r3
 8000666:	4b10      	ldr	r3, [pc, #64]	; (80006a8 <EXTI9_5_IRQHandler+0xa0>)
 8000668:	695b      	ldr	r3, [r3, #20]
 800066a:	f403 7380 	and.w	r3, r3, #256	; 0x100
 800066e:	2b00      	cmp	r3, #0
 8000670:	d008      	beq.n	8000684 <EXTI9_5_IRQHandler+0x7c>
 8000672:	4b0d      	ldr	r3, [pc, #52]	; (80006a8 <EXTI9_5_IRQHandler+0xa0>)
 8000674:	695b      	ldr	r3, [r3, #20]
 8000676:	4a0c      	ldr	r2, [pc, #48]	; (80006a8 <EXTI9_5_IRQHandler+0xa0>)
 8000678:	f443 7380 	orr.w	r3, r3, #256	; 0x100
 800067c:	6153      	str	r3, [r2, #20]
 800067e:	4b0b      	ldr	r3, [pc, #44]	; (80006ac <EXTI9_5_IRQHandler+0xa4>)
 8000680:	6a1b      	ldr	r3, [r3, #32]
 8000682:	4798      	blx	r3
 8000684:	4b08      	ldr	r3, [pc, #32]	; (80006a8 <EXTI9_5_IRQHandler+0xa0>)
 8000686:	695b      	ldr	r3, [r3, #20]
 8000688:	f403 7300 	and.w	r3, r3, #512	; 0x200
 800068c:	2b00      	cmp	r3, #0
 800068e:	d008      	beq.n	80006a2 <EXTI9_5_IRQHandler+0x9a>
 8000690:	4b05      	ldr	r3, [pc, #20]	; (80006a8 <EXTI9_5_IRQHandler+0xa0>)
 8000692:	695b      	ldr	r3, [r3, #20]
 8000694:	4a04      	ldr	r2, [pc, #16]	; (80006a8 <EXTI9_5_IRQHandler+0xa0>)
 8000696:	f443 7300 	orr.w	r3, r3, #512	; 0x200
 800069a:	6153      	str	r3, [r2, #20]
 800069c:	4b03      	ldr	r3, [pc, #12]	; (80006ac <EXTI9_5_IRQHandler+0xa4>)
 800069e:	6a5b      	ldr	r3, [r3, #36]	; 0x24
 80006a0:	4798      	blx	r3
 80006a2:	bf00      	nop
 80006a4:	bd80      	pop	{r7, pc}
 80006a6:	bf00      	nop
 80006a8:	40010400 	andmi	r0, r1, r0, lsl #8
 80006ac:	2000001c 	andcs	r0, r0, ip, lsl r0

080006b0 <EXTI15_10_IRQHandler>:
 80006b0:	b580      	push	{r7, lr}
 80006b2:	af00      	add	r7, sp, #0
 80006b4:	4b26      	ldr	r3, [pc, #152]	; (8000750 <EXTI15_10_IRQHandler+0xa0>)
 80006b6:	695b      	ldr	r3, [r3, #20]
 80006b8:	f403 6380 	and.w	r3, r3, #1024	; 0x400
 80006bc:	2b00      	cmp	r3, #0
 80006be:	d008      	beq.n	80006d2 <EXTI15_10_IRQHandler+0x22>
 80006c0:	4b23      	ldr	r3, [pc, #140]	; (8000750 <EXTI15_10_IRQHandler+0xa0>)
 80006c2:	695b      	ldr	r3, [r3, #20]
 80006c4:	4a22      	ldr	r2, [pc, #136]	; (8000750 <EXTI15_10_IRQHandler+0xa0>)
 80006c6:	f443 6380 	orr.w	r3, r3, #1024	; 0x400
 80006ca:	6153      	str	r3, [r2, #20]
 80006cc:	4b21      	ldr	r3, [pc, #132]	; (8000754 <EXTI15_10_IRQHandler+0xa4>)
 80006ce:	6a9b      	ldr	r3, [r3, #40]	; 0x28
 80006d0:	4798      	blx	r3
 80006d2:	4b1f      	ldr	r3, [pc, #124]	; (8000750 <EXTI15_10_IRQHandler+0xa0>)
 80006d4:	695b      	ldr	r3, [r3, #20]
 80006d6:	f403 6300 	and.w	r3, r3, #2048	; 0x800
 80006da:	2b00      	cmp	r3, #0
 80006dc:	d008      	beq.n	80006f0 <EXTI15_10_IRQHandler+0x40>
 80006de:	4b1c      	ldr	r3, [pc, #112]	; (8000750 <EXTI15_10_IRQHandler+0xa0>)
 80006e0:	695b      	ldr	r3, [r3, #20]
 80006e2:	4a1b      	ldr	r2, [pc, #108]	; (8000750 <EXTI15_10_IRQHandler+0xa0>)
 80006e4:	f443 6300 	orr.w	r3, r3, #2048	; 0x800
 80006e8:	6153      	str	r3, [r2, #20]
 80006ea:	4b1a      	ldr	r3, [pc, #104]	; (8000754 <EXTI15_10_IRQHandler+0xa4>)
 80006ec:	6adb      	ldr	r3, [r3, #44]	; 0x2c
 80006ee:	4798      	blx	r3
 80006f0:	4b17      	ldr	r3, [pc, #92]	; (8000750 <EXTI15_10_IRQHandler+0xa0>)
 80006f2:	695b      	ldr	r3, [r3, #20]
 80006f4:	f403 5380 	and.w	r3, r3, #4096	; 0x1000
 80006f8:	2b00      	cmp	r3, #0
 80006fa:	d008      	beq.n	800070e <EXTI15_10_IRQHandler+0x5e>
 80006fc:	4b14      	ldr	r3, [pc, #80]	; (8000750 <EXTI15_10_IRQHandler+0xa0>)
 80006fe:	695b      	ldr	r3, [r3, #20]
 8000700:	4a13      	ldr	r2, [pc, #76]	; (8000750 <EXTI15_10_IRQHandler+0xa0>)
 8000702:	f443 5380 	orr.w	r3, r3, #4096	; 0x1000
 8000706:	6153      	str	r3, [r2, #20]
 8000708:	4b12      	ldr	r3, [pc, #72]	; (8000754 <EXTI15_10_IRQHandler+0xa4>)
 800070a:	6b1b      	ldr	r3, [r3, #48]	; 0x30
 800070c:	4798      	blx	r3
 800070e:	4b10      	ldr	r3, [pc, #64]	; (8000750 <EXTI15_10_IRQHandler+0xa0>)
 8000710:	695b      	ldr	r3, [r3, #20]
 8000712:	f403 5300 	and.w	r3, r3, #8192	; 0x2000
 8000716:	2b00      	cmp	r3, #0
 8000718:	d008      	beq.n	800072c <EXTI15_10_IRQHandler+0x7c>
 800071a:	4b0d      	ldr	r3, [pc, #52]	; (8000750 <EXTI15_10_IRQHandler+0xa0>)
 800071c:	695b      	ldr	r3, [r3, #20]
 800071e:	4a0c      	ldr	r2, [pc, #48]	; (8000750 <EXTI15_10_IRQHandler+0xa0>)
 8000720:	f443 5300 	orr.w	r3, r3, #8192	; 0x2000
 8000724:	6153      	str	r3, [r2, #20]
 8000726:	4b0b      	ldr	r3, [pc, #44]	; (8000754 <EXTI15_10_IRQHandler+0xa4>)
 8000728:	6b5b      	ldr	r3, [r3, #52]	; 0x34
 800072a:	4798      	blx	r3
 800072c:	4b08      	ldr	r3, [pc, #32]	; (8000750 <EXTI15_10_IRQHandler+0xa0>)
 800072e:	695b      	ldr	r3, [r3, #20]
 8000730:	f403 4380 	and.w	r3, r3, #16384	; 0x4000
 8000734:	2b00      	cmp	r3, #0
 8000736:	d008      	beq.n	800074a <EXTI15_10_IRQHandler+0x9a>
 8000738:	4b05      	ldr	r3, [pc, #20]	; (8000750 <EXTI15_10_IRQHandler+0xa0>)
 800073a:	695b      	ldr	r3, [r3, #20]
 800073c:	4a04      	ldr	r2, [pc, #16]	; (8000750 <EXTI15_10_IRQHandler+0xa0>)
 800073e:	f443 4380 	orr.w	r3, r3, #16384	; 0x4000
 8000742:	6153      	str	r3, [r2, #20]
 8000744:	4b03      	ldr	r3, [pc, #12]	; (8000754 <EXTI15_10_IRQHandler+0xa4>)
 8000746:	6b9b      	ldr	r3, [r3, #56]	; 0x38
 8000748:	4798      	blx	r3
 800074a:	bf00      	nop
 800074c:	bd80      	pop	{r7, pc}
 800074e:	bf00      	nop
 8000750:	40010400 	andmi	r0, r1, r0, lsl #8
 8000754:	2000001c 	andcs	r0, r0, ip, lsl r0

