mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
08000758 <Get_CRx_Position>:
 8000758:	b480      	push	{r7}
 800075a:	b083      	sub	sp, #12
 800075c:	af00      	add	r7, sp, #0
 800075e:	4603      	mov	r3, r0
 8000760:	80fb      	strh	r3, [r7, #6]
 8000762:	88fb      	ldrh	r3, [r7, #6]
 8000764:	2b80      	cmp	r3, #128	; 0x80
 8000766:	d042      	beq.n	80007ee <Get_CRx_Position+0x96>
 8000768:	2b80      	cmp	r3, #128	; 0x80
 800076a:	dc11      	bgt.n	8000790 <Get_CRx_Position+0x38>
 800076c:	2b08      	cmp	r3, #8
 800076e:	d036      	beq.n	80007de <Get_CRx_Position+0x86>
 8000770:	2b08      	cmp	r3, #8
 8000772:	dc06      	bgt.n	8000782 <Get_CRx_Position+0x2a>
 8000774:	2b02      	cmp	r3, #2
 8000776:	d02e      	beq.n	80007d6 <Get_CRx_Position+0x7e>
 8000778:	2b04      	cmp	r3, #4
 800077a:	d02e      	beq.n	80007da <Get_CRx_Position+0x82>
 800077c:	2b01      	cmp	r3, #1
 800077e:	d028      	beq.n	80007d2 <Get_CRx_Position+0x7a>
 8000780:	e047      	b.n	8000812 <Get_CRx_Position+0xba>
 8000782:	2b20      	cmp	r3, #32
 8000784:	d02f      	beq.n	80007e6 <Get_CRx_Position+0x8e>
 8000786:	2b40      	cmp	r3, #64	; 0x40
 8000788:	d02f      	beq.n	80007ea <Get_CRx_Position+0x92>
 800078a:	2b10      	cmp	r3, #16
 800078c:	d029      	beq.n	80007e2 <Get_CRx_Position+0x8a>
 800078e:	e040      	b.n	8000812 <Get_CRx_Position+0xba>
 8000790:	f5b3 6f00 	cmp.w	r3, #2048	; 0x800
 8000794:	d033      	beq.n	80007fe <Get_CRx_Position+0xa6>
 8000796:	f5b3 6f00 	cmp.w	r3, #2048	; 0x800
 800079a:	dc09      	bgt.n	80007b0 <Get_CRx_Position+0x58>
 800079c:	f5b3 7f00 	cmp.w	r3, #512	; 0x200
 80007a0:	d029      	beq.n	80007f6 <Get_CRx_Position+0x9e>
 80007a2:	f5b3 6f80 	cmp.w	r3, #1024	; 0x400
 80007a6:	d028      	beq.n	80007fa <Get_CRx_Position+0xa2>
 80007a8:	f5b3 7f80 	cmp.w	r3, #256	; 0x100
 80007ac:	d021      	beq.n	80007f2 <Get_CRx_Position+0x9a>
 80007ae:	e030      	b.n	8000812 <Get_CRx_Position+0xba>
 80007b0:	f5b3 5f00 	cmp.w	r3, #8192	; 0x2000
 80007b4:	d027      	beq.n	8000806 <Get_CRx_Position+0xae>
 80007b6:	f5b3 5f00 	cmp.w	r3, #8192	; 0x2000
 80007ba:	dc03      	bgt.n	80007c4 <Get_CRx_Position+0x6c>
 80007bc:	f5b3 5f80 	cmp.w	r3, #4096	; 0x1000
 80007c0:	d01f      	beq.n	8000802 <Get_CRx_Position+0xaa>
 80007c2:	e026      	b.n	8000812 <Get_CRx_Position+0xba>
 80007c4:	f5b3 4f80 	cmp.w	r3, #16384	; 0x4000
 80007c8:	d01f      	beq.n	800080a <Get_CRx_Position+0xb2>
 80007ca:	f5b3 4f00 	cmp.w	r3, #32768	; 0x8000
 80007ce:	d01e      	beq.n	800080e <Get_CRx_Position+0xb6>
 80007d0:	e01f      	b.n	8000812 <Get_CRx_Position+0xba>
 80007d2:	2300      	movs	r3, #0
 80007d4:	e01e      	b.n	8000814 <Get_CRx_Position+0xbc>
 80007d6:	2304      	movs	r3, #4
 80007d8:	e01c      	b.n	8000814 <Get_CRx_Position+0xbc>
 80007da:	2308      	movs	r3, #8
 80007dc:	e01a      	b.n	8000814 <Get_CRx_Position+0xbc>
 80007de:	230c      	movs	r3, #12
 80007e0:	e018      	b.n	8000814 <Get_CRx_Position+0xbc>
 80007e2:	2310      	movs	r3, #16
 80007e4:	e016      	b.n	8000814 <Get_CRx_Position+0xbc>
 80007e6:	2314      	movs	r3, #20
 80007e8:	e014      	b.n	8000814 <Get_CRx_Position+0xbc>
 80007ea:	2318      	movs	r3, #24
 80007ec:	e012      	b.n	8000814 <Get_CRx_Position+0xbc>
 80007ee:	231c      	movs	r3, #28
 80007f0:	e010      	b.n	8000814 <Get_CRx_Position+0xbc>
 80007f2:	2300      	movs	r3, #0
 80007f4:	e00e      	b.n	8000814 <Get_CRx_Position+0xbc>
 80007f6:	2304      	movs	r3, #4
 80007f8:	e00c      	b.n	8000814 <Get_CRx_Position+0xbc>
 80007fa:	2308      	movs	r3, #8
 80007fc:	e00a      	b.n	8000814 <Get_CRx_Position+0xbc>
 80007fe:	230c      	movs	r3, #12
 8000800:	e008      	b.n	8000814 <Get_CRx_Position+0xbc>
 8000802:	2310      	movs	r3, #16
 8000804:	e006      	b.n	8000814 <Get_CRx_Position+0xbc>
 8000806:	2314      	movs	r3, #20
 8000808:	e004      	b.n	8000814 <Get_CRx_Position+0xbc>
 800080a:	2318      	movs	r3, #24
 800080c:	e002      	b.n	8000814 <Get_CRx_Position+0xbc>
 800080e:	231c      	movs	r3, #28
 8000810:	e000      	b.n	8000814 <Get_CRx_Position+0xbc>
 8000812:	2300      	movs	r3, #0
 8000814:	4618      	mov	r0, r3
 8000816:	370c      	adds	r7, #12
 8000818:	46bd      	mov	sp, r7
 800081a:	bc80      	pop	{r7}
 800081c:	4770      	bx	lr
	...

08000820 <MCAL_GPIO_Init>:
 8000820:	b590      	push	{r4, r7, lr}
 8000822:	b085      	sub	sp, #20
 8000824:	af00      	add	r7, sp, #0
 8000826:	6078      	str	r0, [r7, #4]
 8000828:	687b      	ldr	r3, [r7, #4]
 800082a:	681b      	ldr	r3, [r3, #0]
 800082c:	4a7c      	ldr	r2, [pc, #496]	; (8000a20 <MCAL_GPIO_Init+0x200>)
 800082e:	4293      	cmp	r3, r2
 8000830:	d10d      	bne.n	800084e <MCAL_GPIO_Init+0x2e>
 8000832:	4b7c      	ldr	r3, [pc, #496]	; (8000a24 <MCAL_GPIO_Init+0x204>)
 8000834:	781b      	ldrb	r3, [r3, #0]
 8000836:	2b01      	cmp	r3, #1
 8000838:	d009      	beq.n	800084e <MCAL_GPIO_Init+0x2e>
 800083a:	4b7b      	ldr	r3, [pc, #492]	; (8000a28 <MCAL_GPIO_Init+0x208>)
 800083c:	699b      	ldr	r3, [r3, #24]
 800083e:	4a7a      	ldr	r2, [pc, #488]	; (8000a28 <MCAL_GPIO_Init+0x208>)
 8000840:	f043 0304 	orr.w	r3, r3, #4
 8000844:	6193      	str	r3, [r2, #24]
 8000846:	4b77      	ldr	r3, [pc, #476]	; (8000a24 <MCAL_GPIO_Init+0x204>)
 8000848:	2201      	movs	r2, #1
 800084a:	701a      	strb	r2, [r3, #0]
 800084c:	e04a      	b.n	80008e4 <MCAL_GPIO_Init+0xc4>
 800084e:	687b      	ldr	r3, [r7, #4]
 8000850:	681b      	ldr	r3, [r3, #0]
 8000852:	4a76      	ldr	r2, [pc, #472]	; (8000a2c <MCAL_GPIO_Init+0x20c>)
 8000854:	4293      	cmp	r3, r2
 8000856:	d10d      	bne.n	8000874 <MCAL_GPIO_Init+0x54>
 8000858:	4b72      	ldr	r3, [pc, #456]	; (8000a24 <MCAL_GPIO_Init+0x204>)
 800085a:	785b      	ldrb	r3, [r3, #1]
 800085c:	2b01      	cmp	r3, #1
 800085e:	d009      	beq.n	8000874 <MCAL_GPIO_Init+0x54>
 8000860:	4b71      	ldr	r3, [pc, #452]	; (8000a28 <MCAL_GPIO_Init+0x208>)
 8000862:	699b      	ldr	r3, [r3, #24]
 8000864:	4a70      	ldr	r2, [pc, #448]	; (8000a28 <MCAL_GPIO_Init+0x208>)
 8000866:	f043 0308 	orr.w	r3, r3, #8
 800086a:	6193      	str	r3, [r2, #24]
 800086c:	4b6d      	ldr	r3, [pc, #436]	; (8000a24 <MCAL_GPIO_Init+0x204>)
 800086e:	2201      	movs	r2, #1
 8000870:	705a      	strb	r2, [r3, #1]
 8000872:	e037      	b.n	80008e4 <MCAL_GPIO_Init+0xc4>
 8000874:	687b      	ldr	r3, [r7, #4]
 8000876:	681b      	ldr	r3, [r3, #0]
 8000878:	4a6d      	ldr	r2, [pc, #436]	; (8000a30 <MCAL_GPIO_Init+0x210>)
 800087a:	4293      	cmp	r3, r2
 800087c:	d10d      	bne.n	800089a <MCAL_GPIO_Init+0x7a>
 800087e:	4b69      	ldr	r3, [pc, #420]	; (8000a24 <MCAL_GPIO_Init+0x204>)
 8000880:	789b      	ldrb	r3, [r3, #2]
 8000882:	2b01      	cmp	r3, #1
 8000884:	d009      	beq.n	800089a <MCAL_GPIO_Init+0x7a>
 8000886:	4b68      	ldr	r3, [pc, #416]	; (8000a28 <MCAL_GPIO_Init+0x208>)
 8000888:	699b      	ldr	r3, [r3, #24]
 800088a:	4a67      	ldr	r2, [pc, #412]	; (8000a28 <MCAL_GPIO_Init+0x208>)
 800088c:	f043 0310 	orr.w	r3, r3, #16
 8000890:	6193      	str	r3, [r2, #24]
 8000892:	4b64      	ldr	r3, [pc, #400]	; (8000a24 <MCAL_GPIO_Init+0x204>)
 8000894:	2201      	movs	r2, #1
 8000896:	709a      	strb	r2, [r3, #2]
 8000898:	e024      	b.n	80008e4 <MCAL_GPIO_Init+0xc4>
 800089a:	687b      	ldr	r3, [r7, #4]
 800089c:	681b      	ldr	r3, [r3, #0]
 800089e:	4a65      	ldr	r2, [pc, #404]	; (8000a34 <MCAL_GPIO_Init+0x214>)
 80008a0:	4293      	cmp	r3, r2
 80008a2:	d10d      	bne.n	80008c0 <MCAL_GPIO_Init+0xa0>
 80008a4:	4b5f      	ldr	r3, [pc, #380]	; (8000a24 <MCAL_GPIO_Init+0x204>)
 80008a6:	78db      	ldrb	r3, [r3, #3]
 80008a8:	2b01      	cmp	r3, #1
 80008aa:	d009      	beq.n	80008c0 <MCAL_GPIO_Init+0xa0>
 80008ac:	4b5e      	ldr	r3, [pc, #376]	; (8000a28 <MCAL_GPIO_Init+0x208>)
 80008ae:	699b      	ldr	r3, [r3, #24]
 80008b0:	4a5d      	ldr	r2, [pc, #372]	; (8000a28 <MCAL_GPIO_Init+0x208>)
 80008b2:	f043 0320 	orr.w	r3, r3, #32
 80008b6:	6193      	str	r3, [r2, #24]
 80008b8:	4b5a      	ldr	r3, [pc, #360]	; (8000a24 <MCAL_GPIO_Init+0x204>)
 80008ba:	2201      	movs	r2, #1
 80008bc:	70da      	strb	r2, [r3, #3]
 80008be:	e011      	b.n	80008e4 <MCAL_GPIO_Init+0xc4>
 80008c0:	687b      	ldr	r3, [r7, #4]
 80008c2:	681b      	ldr	r3, [r3, #0]
 80008c4:	4a5c      	ldr	r2, [pc, #368]	; (8000a38 <MCAL_GPIO_Init+0x218>)
 80008c6:	4293      	cmp	r3, r2
 80008c8:	d10c      	bne.n	80008e4 <MCAL_GPIO_Init+0xc4>
 80008ca:	4b56      	ldr	r3, [pc, #344]	; (8000a24 <MCAL_GPIO_Init+0x204>)
 80008cc:	791b      	ldrb	r3, [r3, #4]
 80008ce:	2b01      	cmp	r3, #1
 80008d0:	d008      	beq.n	80008e4 <MCAL_GPIO_Init+0xc4>
 80008d2:	4b55      	ldr	r3, [pc, #340]	; (8000a28 <MCAL_GPIO_Init+0x208>)
 80008d4:	699b      	ldr	r3, [r3, #24]
 80008d6:	4a54      	ldr	r2, [pc, #336]	; (8000a28 <MCAL_GPIO_Init+0x208>)
 80008d8:	f043 0340 	orr.w	r3, r3, #64	; 0x40
 80008dc:	6193      	str	r3, [r2, #24]
 80008de:	4b51      	ldr	r3, [pc, #324]	; (8000a24 <MCAL_GPIO_Init+0x204>)
 80008e0:	2201      	movs	r2, #1
 80008e2:	711a      	strb	r2, [r3, #4]
 80008e4:	687b      	ldr	r3, [r7, #4]
 80008e6:	799b      	ldrb	r3, [r3, #6]
 80008e8:	2b05      	cmp	r3, #5
 80008ea:	d908      	bls.n	80008fe <MCAL_GPIO_Init+0xde>
 80008ec:	4b4e      	ldr	r3, [pc, #312]	; (8000a28 <MCAL_GPIO_Init+0x208>)
 80008ee:	699b      	ldr	r3, [r3, #24]
 80008f0:	4a4d      	ldr	r2, [pc, #308]	; (8000a28 <MCAL_GPIO_Init+0x208>)
 80008f2:	f043 0301 	orr.w	r3, r3, #1
 80008f6:	6193      	str	r3, [r2, #24]
 80008f8:	4b4a      	ldr	r3, [pc, #296]	; (8000a24 <MCAL_GPIO_Init+0x204>)
 80008fa:	2201      	movs	r2, #1
 80008fc:	715a      	strb	r2, [r3, #5]
 80008fe:	2300      	movs	r3, #0
 8000900:	60bb      	str	r3, [r7, #8]
 8000902:	687b      	ldr	r3, [r7, #4]
 8000904:	889b      	ldrh	r3, [r3, #4]
 8000906:	2bff      	cmp	r3, #255	; 0xff
 8000908:	d802      	bhi.n	8000910 <MCAL_GPIO_Init+0xf0>
 800090a:	687b      	ldr	r3, [r7, #4]
 800090c:	681b      	ldr	r3, [r3, #0]
 800090e:	e002      	b.n	8000916 <MCAL_GPIO_Init+0xf6>
 8000910:	687b      	ldr	r3, [r7, #4]
 8000912:	681b      	ldr	r3, [r3, #0]
 8000914:	3304      	adds	r3, #4
 8000916:	60bb      	str	r3, [r7, #8]
 8000918:	2304      	movs	r3, #4
 800091a:	73fb      	strb	r3, [r7, #15]
 800091c:	687b      	ldr	r3, [r7, #4]
 800091e:	889b      	ldrh	r3, [r3, #4]
 8000920:	4618      	mov	r0, r3
 8000922:	f7ff ff19 	bl	8000758 <Get_CRx_Position>
 8000926:	4603      	mov	r3, r0
 8000928:	461a      	mov	r2, r3
 800092a:	230f      	movs	r3, #15
 800092c:	4093      	lsls	r3, r2
 800092e:	43da      	mvns	r2, r3
 8000930:	68bb      	ldr	r3, [r7, #8]
 8000932:	681b      	ldr	r3, [r3, #0]
 8000934:	401a      	ands	r2, r3
 8000936:	68bb      	ldr	r3, [r7, #8]
 8000938:	601a      	str	r2, [r3, #0]
 800093a:	687b      	ldr	r3, [r7, #4]
 800093c:	799b      	ldrb	r3, [r3, #6]
 800093e:	2b03      	cmp	r3, #3
 8000940:	d914      	bls.n	800096c <MCAL_GPIO_Init+0x14c>
 8000942:	687b      	ldr	r3, [r7, #4]
 8000944:	799b      	ldrb	r3, [r3, #6]
 8000946:	2b07      	cmp	r3, #7
 8000948:	d810      	bhi.n	800096c <MCAL_GPIO_Init+0x14c>
 800094a:	2300      	movs	r3, #0
 800094c:	73fb      	strb	r3, [r7, #15]
 800094e:	687b      	ldr	r3, [r7, #4]
 8000950:	799b      	ldrb	r3, [r3, #6]
 8000952:	3b04      	subs	r3, #4
 8000954:	009b      	lsls	r3, r3, #2
 8000956:	b25a      	sxtb	r2, r3
 8000958:	687b      	ldr	r3, [r7, #4]
 800095a:	79db      	ldrb	r3, [r3, #7]
 800095c:	b25b      	sxtb	r3, r3
 800095e:	4313      	orrs	r3, r2
 8000960:	b25b      	sxtb	r3, r3
 8000962:	b2db      	uxtb	r3, r3
 8000964:	f003 030f 	and.w	r3, r3, #15
 8000968:	73fb      	strb	r3, [r7, #15]
 800096a:	e037      	b.n	80009dc <MCAL_GPIO_Init+0x1bc>
 800096c:	2300      	movs	r3, #0
 800096e:	73fb      	strb	r3, [r7, #15]
 8000970:	687b      	ldr	r3, [r7, #4]
 8000972:	799b      	ldrb	r3, [r3, #6]
 8000974:	2b00      	cmp	r3, #0
 8000976:	d003      	beq.n	8000980 <MCAL_GPIO_Init+0x160>
 8000978:	687b      	ldr	r3, [r7, #4]
 800097a:	799b      	ldrb	r3, [r3, #6]
 800097c:	2b01      	cmp	r3, #1
 800097e:	d107      	bne.n	8000990 <MCAL_GPIO_Init+0x170>
 8000980:	687b      	ldr	r3, [r7, #4]
 8000982:	799b      	ldrb	r3, [r3, #6]
 8000984:	009b      	lsls	r3, r3, #2
 8000986:	b2db      	uxtb	r3, r3
 8000988:	f003 030f 	and.w	r3, r3, #15
 800098c:	73fb      	strb	r3, [r7, #15]
 800098e:	e025      	b.n	80009dc <MCAL_GPIO_Init+0x1bc>
 8000990:	687b      	ldr	r3, [r7, #4]
 8000992:	799b      	ldrb	r3, [r3, #6]
 8000994:	2b02      	cmp	r3, #2
 8000996:	d003      	beq.n	80009a0 <MCAL_GPIO_Init+0x180>
 8000998:	687b      	ldr	r3, [r7, #4]
 800099a:	799b      	ldrb	r3, [r3, #6]
 800099c:	2b03      	cmp	r3, #3
 800099e:	d11b      	bne.n	80009d8 <MCAL_GPIO_Init+0x1b8>
 80009a0:	2308      	movs	r3, #8
 80009a2:	73fb      	strb	r3, [r7, #15]
 80009a4:	687b      	ldr	r3, [r7, #4]
 80009a6:	799b      	ldrb	r3, [r3, #6]
 80009a8:	2b02      	cmp	r3, #2
 80009aa:	d10a      	bne.n	80009c2 <MCAL_GPIO_Init+0x1a2>
 80009ac:	687b      	ldr	r3, [r7, #4]
 80009ae:	681b      	ldr	r3, [r3, #0]
 80009b0:	68da      	ldr	r2, [r3, #12]
 80009b2:	687b      	ldr	r3, [r7, #4]
 80009b4:	889b      	ldrh	r3, [r3, #4]
 80009b6:	4619      	mov	r1, r3
 80009b8:	687b      	ldr	r3, [r7, #4]
 80009ba:	681b      	ldr	r3, [r3, #0]
 80009bc:	430a      	orrs	r2, r1
 80009be:	60da      	str	r2, [r3, #12]
 80009c0:	e00c      	b.n	80009dc <MCAL_GPIO_Init+0x1bc>
 80009c2:	687b      	ldr	r3, [r7, #4]
 80009c4:	681b      	ldr	r3, [r3, #0]
 80009c6:	68da      	ldr	r2, [r3, #12]
 80009c8:	687b      	ldr	r3, [r7, #4]
 80009ca:	889b      	ldrh	r3, [r3, #4]
 80009cc:	4619      	mov	r1, r3
 80009ce:	687b      	ldr	r3, [r7, #4]
 80009d0:	681b      	ldr	r3, [r3, #0]
 80009d2:	430a      	orrs	r2, r1
 80009d4:	60da      	str	r2, [r3, #12]
 80009d6:	e001      	b.n	80009dc <MCAL_GPIO_Init+0x1bc>
 80009d8:	2304      	movs	r3, #4
 80009da:	73fb      	strb	r3, [r7, #15]
 80009dc:	7bfc      	ldrb	r4, [r7, #15]
 80009de:	687b      	ldr	r3, [r7, #4]
 80009e0:	889b      	ldrh	r3, [r3, #4]
 80009e2:	4618      	mov	r0, r3
 80009e4:	f7ff feb8 	bl	8000758 <Get_CRx_Position>
 80009e8:	4603      	mov	r3, r0
 80009ea:	fa04 f303 	lsl.w	r3, r4, r3
 80009ee:	43da      	mvns	r2, r3
 80009f0:	68bb      	ldr	r3, [r7, #8]
 80009f2:	681b      	ldr	r3, [r3, #0]
 80009f4:	401a      	ands	r2, r3
 80009f6:	68bb      	ldr	r3, [r7, #8]
 80009f8:	601a      	str	r2, [r3, #0]
 80009fa:	7bfc      	ldrb	r4, [r7, #15]
 80009fc:	687b      	ldr	r3, [r7, #4]
 80009fe:	889b      	ldrh	r3, [r3, #4]
 8000a00:	4618      	mov	r0, r3
 8000a02:	f7ff fea9 	bl	8000758 <Get_CRx_Position>
 8000a06:	4603      	mov	r3, r0
 8000a08:	fa04 f203 	lsl.w	r2, r4, r3
 8000a0c:	68bb      	ldr	r3, [r7, #8]
 8000a0e:	681b      	ldr	r3, [r3, #0]
 8000a10:	431a      	orrs	r2, r3
 8000a12:	68bb      	ldr	r3, [r7, #8]
 8000a14:	601a      	str	r2, [r3, #0]
 8000a16:	bf00      	nop
 8000a18:	3714      	adds	r7, #20
 8000a1a:	46bd      	mov	sp, r7
 8000a1c:	bd90      	pop	{r4, r7, pc}
 8000a1e:	bf00      	nop
 8000a20:	40010800 	andmi	r0, r1, r0, lsl #16
 8000a24:	20000058 	andcs	r0, r0, r8, asr r0
 8000a28:	40021000 	andmi	r1, r2, r0
 8000a2c:	40010c00 	andmi	r0, r1, r0, lsl #24
 8000a30:	40011000 	andmi	r1, r1, r0
 8000a34:	40011400 	andmi	r1, r1, r0, lsl #8
 8000a38:	40011800 	andmi	r1, r1, r0, lsl #16

