mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
08000a3c <TIM2_IRQHandler>:
 8000a3c:	b580      	push	{r7, lr}
 8000a3e:	af00      	add	r7, sp, #0
 8000a40:	f04f 4380 	mov.w	r3, #1073741824	; 0x40000000
 8000a44:	691b      	ldr	r3, [r3, #16]
 8000a46:	f003 0301 	and.w	r3, r3, #1
 8000a4a:	2b00      	cmp	r3, #0
 8000a4c:	d012      	beq.n	8000a74 <TIM2_IRQHandler+0x38>
 8000a4e:	f04f 4380 	mov.w	r3, #1073741824	; 0x40000000
 8000a52:	681b      	ldr	r3, [r3, #0]
 8000a54:	f04f 4280 	mov.w	r2, #1073741824	; 0x40000000
 8000a58:	f023 0301 	bic.w	r3, r3, #1
 8000a5c:	6013      	str	r3, [r2, #0]
 8000a5e:	f04f 4380 	mov.w	r3, #1073741824	; 0x40000000
 8000a62:	691b      	ldr	r3, [r3, #16]
 8000a64:	f04f 4280 	mov.w	r2, #1073741824	; 0x40000000
 8000a68:	f023 0301 	bic.w	r3, r3, #1
 8000a6c:	6113      	str	r3, [r2, #16]
 8000a6e:	4b0b      	ldr	r3, [pc, #44]	; (8000a9c <TIM2_IRQHandler+0x60>)
 8000a70:	681b      	ldr	r3, [r3, #0]
 8000a72:	4798      	blx	r3
 8000a74:	f04f 4380 	mov.w	r3, #1073741824	; 0x40000000
 8000a78:	691b      	ldr	r3, [r3, #16]
 8000a7a:	f003 0340 	and.w	r3, r3, #64	; 0x40
 8000a7e:	2b00      	cmp	r3, #0
 8000a80:	d00a      	beq.n	8000a98 <TIM2_IRQHandler+0x5c>
 8000a82:	f04f 4380 	mov.w	r3, #1073741824	; 0x40000000
 8000a86:	691b      	ldr	r3, [r3, #16]
 8000a88:	f04f 4280 	mov.w	r2, #1073741824	; 0x40000000
 8000a8c:	f023 0340 	bic.w	r3, r3, #64	; 0x40
 8000a90:	6113      	str	r3, [r2, #16]
 8000a92:	4b02      	ldr	r3, [pc, #8]	; (8000a9c <TIM2_IRQHandler+0x60>)
 8000a94:	681b      	ldr	r3, [r3, #0]
 8000a96:	4798      	blx	r3
 8000a98:	bf00      	nop
 8000a9a:	bd80      	pop	{r7, pc}
 8000a9c:	20000060 	andcs	r0, r0, r0, rrx

08000aa0 <TIM3_IRQHandler>:
 8000aa0:	b580      	push	{r7, lr}
 8000aa2:	af00      	add	r7, sp, #0
 8000aa4:	4b12      	ldr	r3, [pc, #72]	; (8000af0 <TIM3_IRQHandler+0x50>)
 8000aa6:	691b      	ldr	r3, [r3, #16]
 8000aa8:	f003 0301 	and.w	r3, r3, #1
 8000aac:	2b00      	cmp	r3, #0
 8000aae:	d00e      	beq.n	8000ace <TIM3_IRQHandler+0x2e>
 8000ab0:	4b0f      	ldr	r3, [pc, #60]	; (8000af0 <TIM3_IRQHandler+0x50>)
 8000ab2:	681b      	ldr	r3, [r3, #0]
 8000ab4:	4a0e      	ldr	r2, [pc, #56]	; (8000af0 <TIM3_IRQHandler+0x50>)
 8000ab6:	f023 0301 	bic.w	r3, r3, #1
 8000aba:	6013      	str	r3, [r2, #0]
 8000abc:	4b0c      	ldr	r3, [pc, #48]	; (8000af0 <TIM3_IRQHandler+0x50>)
 8000abe:	691b      	ldr	r3, [r3, #16]
 8000ac0:	4a0b      	ldr	r2, [pc, #44]	; (8000af0 <TIM3_IRQHandler+0x50>)
 8000ac2:	f023 0301 	bic.w	r3, r3, #1
 8000ac6:	6113      	str	r3, [r2, #16]
 8000ac8:	4b0a      	ldr	r3, [pc, #40]	; (8000af4 <TIM3_IRQHandler+0x54>)
 8000aca:	685b      	ldr	r3, [r3, #4]
 8000acc:	4798      	blx	r3
 8000ace:	4b08      	ldr	r3, [pc, #32]	; (8000af0 <TIM3_IRQHandler+0x50>)
 8000ad0:	691b      	ldr	r3, [r3, #16]
 8000ad2:	f003 0340 	and.w	r3, r3, #64	; 0x40
 8000ad6:	2b00      	cmp	r3, #0
 8000ad8:	d008      	beq.n	8000aec <TIM3_IRQHandler+0x4c>
 8000ada:	4b05      	ldr	r3, [pc, #20]	; (8000af0 <TIM3_IRQHandler+0x50>)
 8000adc:	691b      	ldr	r3, [r3, #16]
 8000ade:	4a04      	ldr	r2, [pc, #16]	; (8000af0 <TIM3_IRQHandler+0x50>)
 8000ae0:	f023 0340 	bic.w	r3, r3, #64	; 0x40
 8000ae4:	6113      	str	r3, [r2, #16]
 8000ae6:	4b03      	ldr	r3, [pc, #12]	; (8000af4 <TIM3_IRQHandler+0x54>)
 8000ae8:	685b      	ldr	r3, [r3, #4]
 8000aea:	4798      	blx	r3
 8000aec:	bf00      	nop
 8000aee:	bd80      	pop	{r7, pc}
 8000af0:	40000400 	andmi	r0, r0, r0, lsl #8
 8000af4:	20000060 	andcs	r0, r0, r0, rrx

08000af8 <TIM4_IRQHandler>:
 8000af8:	b580      	push	{r7, lr}
 8000afa:	af00      	add	r7, sp, #0
 8000afc:	4b12      	ldr	r3, [pc, #72]	; (8000b48 <TIM4_IRQHandler+0x50>)
 8000afe:	691b      	ldr	r3, [r3, #16]
 8000b00:	f003 0301 	and.w	r3, r3, #1
 8000b04:	2b00      	cmp	r3, #0
 8000b06:	d00e      	beq.n	8000b26 <TIM4_IRQHandler+0x2e>
 8000b08:	4b0f      	ldr	r3, [pc, #60]	; (8000b48 <TIM4_IRQHandler+0x50>)
 8000b0a:	681b      	ldr	r3, [r3, #0]
 8000b0c:	4a0e      	ldr	r2, [pc, #56]	; (8000b48 <TIM4_IRQHandler+0x50>)
 8000b0e:	f023 0301 	bic.w	r3, r3, #1
 8000b12:	6013      	str	r3, [r2, #0]
 8000b14:	4b0c      	ldr	r3, [pc, #48]	; (8000b48 <TIM4_IRQHandler+0x50>)
 8000b16:	691b      	ldr	r3, [r3, #16]
 8000b18:	4a0b      	ldr	r2, [pc, #44]	; (8000b48 <TIM4_IRQHandler+0x50>)
 8000b1a:	f023 0301 	bic.w	r3, r3, #1
 8000b1e:	6113      	str	r3, [r2, #16]
 8000b20:	4b0a      	ldr	r3, [pc, #40]	; (8000b4c <TIM4_IRQHandler+0x54>)
 8000b22:	689b      	ldr	r3, [r3, #8]
 8000b24:	4798      	blx	r3
 8000b26:	4b08      	ldr	r3, [pc, #32]	; (8000b48 <TIM4_IRQHandler+0x50>)
 8000b28:	691b      	ldr	r3, [r3, #16]
 8000b2a:	f003 0340 	and.w	r3, r3, #64	; 0x40
 8000b2e:	2b00      	cmp	r3, #0
 8000b30:	d008      	beq.n	8000b44 <TIM4_IRQHandler+0x4c>
 8000b32:	4b05      	ldr	r3, [pc, #20]	; (8000b48 <TIM4_IRQHandler+0x50>)
 8000b34:	691b      	ldr	r3, [r3, #16]
 8000b36:	4a04      	ldr	r2, [pc, #16]	; (8000b48 <TIM4_IRQHandler+0x50>)
 8000b38:	f023 0340 	bic.w	r3, r3, #64	; 0x40
 8000b3c:	6113      	str	r3, [r2, #16]
 8000b3e:	4b03      	ldr	r3, [pc, #12]	; (8000b4c <TIM4_IRQHandler+0x54>)
 8000b40:	689b      	ldr	r3, [r3, #8]
 8000b42:	4798      	blx	r3
 8000b44:	bf00      	nop
 8000b46:	bd80      	pop	{r7, pc}
 8000b48:	40000800 	andmi	r0, r0, r0, lsl #16
 8000b4c:	20000060 	andcs	r0, r0, r0, rrx

08000b50 <I2C1_EV_IRQHandler>:
 8000b50:	b580      	push	{r7, lr}
 8000b52:	b084      	sub	sp, #16
 8000b54:	af00      	add	r7, sp, #0
 8000b56:	2300      	movs	r3, #0
 8000b58:	603b      	str	r3, [r7, #0]
 8000b5a:	4b39      	ldr	r3, [pc, #228]	; (8000c40 <I2C1_EV_IRQHandler+0xf0>)
 8000b5c:	685b      	ldr	r3, [r3, #4]
 8000b5e:	f403 7300 	and.w	r3, r3, #512	; 0x200
 8000b62:	60fb      	str	r3, [r7, #12]
 8000b64:	4b36      	ldr	r3, [pc, #216]	; (8000c40 <I2C1_EV_IRQHandler+0xf0>)
 8000b66:	685b      	ldr	r3, [r3, #4]
 8000b68:	f403 6380 	and.w	r3, r3, #1024	; 0x400
 8000b6c:	60bb      	str	r3, [r7, #8]
 8000b6e:	4b34      	ldr	r3, [pc, #208]	; (8000c40 <I2C1_EV_IRQHandler+0xf0>)
 8000b70:	695b      	ldr	r3, [r3, #20]
 8000b72:	f003 0304 	and.w	r3, r3, #4
 8000b76:	607b      	str	r3, [r7, #4]
 8000b78:	68fb      	ldr	r3, [r7, #12]
 8000b7a:	2b00      	cmp	r3, #0
 8000b7c:	d00a      	beq.n	8000b94 <I2C1_EV_IRQHandler+0x44>
 8000b7e:	687b      	ldr	r3, [r7, #4]
 8000b80:	2b00      	cmp	r3, #0
 8000b82:	d007      	beq.n	8000b94 <I2C1_EV_IRQHandler+0x44>
 8000b84:	4b2e      	ldr	r3, [pc, #184]	; (8000c40 <I2C1_EV_IRQHandler+0xf0>)
 8000b86:	4a2e      	ldr	r2, [pc, #184]	; (8000c40 <I2C1_EV_IRQHandler+0xf0>)
 8000b88:	681b      	ldr	r3, [r3, #0]
 8000b8a:	6013      	str	r3, [r2, #0]
 8000b8c:	4b2d      	ldr	r3, [pc, #180]	; (8000c44 <I2C1_EV_IRQHandler+0xf4>)
 8000b8e:	681b      	ldr	r3, [r3, #0]
 8000b90:	2004      	movs	r0, #4
 8000b92:	4798      	blx	r3
 8000b94:	4b2a      	ldr	r3, [pc, #168]	; (8000c40 <I2C1_EV_IRQHandler+0xf0>)
 8000b96:	695b      	ldr	r3, [r3, #20]
 8000b98:	f003 0301 	and.w	r3, r3, #1
 8000b9c:	607b      	str	r3, [r7, #4]
 8000b9e:	68fb      	ldr	r3, [r7, #12]
 8000ba0:	2b00      	cmp	r3, #0
 8000ba2:	d00c      	beq.n	8000bbe <I2C1_EV_IRQHandler+0x6e>
 8000ba4:	687b      	ldr	r3, [r7, #4]
 8000ba6:	2b00      	cmp	r3, #0
 8000ba8:	d009      	beq.n	8000bbe <I2C1_EV_IRQHandler+0x6e>
 8000baa:	4b25      	ldr	r3, [pc, #148]	; (8000c40 <I2C1_EV_IRQHandler+0xf0>)
 8000bac:	699b      	ldr	r3, [r3, #24]
 8000bae:	f403 3380 	and.w	r3, r3, #65536	; 0x10000
 8000bb2:	2b00      	cmp	r3, #0
 8000bb4:	d103      	bne.n	8000bbe <I2C1_EV_IRQHandler+0x6e>
 8000bb6:	4b23      	ldr	r3, [pc, #140]	; (8000c44 <I2C1_EV_IRQHandler+0xf4>)
 8000bb8:	681b      	ldr	r3, [r3, #0]
 8000bba:	2001      	movs	r0, #1
 8000bbc:	4798      	blx	r3
 8000bbe:	4b20      	ldr	r3, [pc, #128]	; (8000c40 <I2C1_EV_IRQHandler+0xf0>)
 8000bc0:	695b      	ldr	r3, [r3, #20]
 8000bc2:	f003 0307 	and.w	r3, r3, #7
 8000bc6:	607b      	str	r3, [r7, #4]
 8000bc8:	68fb      	ldr	r3, [r7, #12]
 8000bca:	2b00      	cmp	r3, #0
 8000bcc:	d015      	beq.n	8000bfa <I2C1_EV_IRQHandler+0xaa>
 8000bce:	68bb      	ldr	r3, [r7, #8]
 8000bd0:	2b00      	cmp	r3, #0
 8000bd2:	d012      	beq.n	8000bfa <I2C1_EV_IRQHandler+0xaa>
 8000bd4:	687b      	ldr	r3, [r7, #4]
 8000bd6:	2b00      	cmp	r3, #0
 8000bd8:	d00f      	beq.n	8000bfa <I2C1_EV_IRQHandler+0xaa>
 8000bda:	4b19      	ldr	r3, [pc, #100]	; (8000c40 <I2C1_EV_IRQHandler+0xf0>)
 8000bdc:	699b      	ldr	r3, [r3, #24]
 8000bde:	f403 3380 	and.w	r3, r3, #65536	; 0x10000
 8000be2:	2b00      	cmp	r3, #0
 8000be4:	d109      	bne.n	8000bfa <I2C1_EV_IRQHandler+0xaa>
 8000be6:	4b16      	ldr	r3, [pc, #88]	; (8000c40 <I2C1_EV_IRQHandler+0xf0>)
 8000be8:	699b      	ldr	r3, [r3, #24]
 8000bea:	f403 2380 	and.w	r3, r3, #262144	; 0x40000
 8000bee:	2b00      	cmp	r3, #0
 8000bf0:	d003      	beq.n	8000bfa <I2C1_EV_IRQHandler+0xaa>
 8000bf2:	4b14      	ldr	r3, [pc, #80]	; (8000c44 <I2C1_EV_IRQHandler+0xf4>)
 8000bf4:	681b      	ldr	r3, [r3, #0]
 8000bf6:	2006      	movs	r0, #6
 8000bf8:	4798      	blx	r3
 8000bfa:	4b11      	ldr	r3, [pc, #68]	; (8000c40 <I2C1_EV_IRQHandler+0xf0>)
 8000bfc:	695b      	ldr	r3, [r3, #20]
 8000bfe:	f003 0306 	and.w	r3, r3, #6
 8000c02:	607b      	str	r3, [r7, #4]
 8000c04:	68fb      	ldr	r3, [r7, #12]
 8000c06:	2b00      	cmp	r3, #0
 8000c08:	d015      	beq.n	8000c36 <I2C1_EV_IRQHandler+0xe6>
 8000c0a:	68bb      	ldr	r3, [r7, #8]
 8000c0c:	2b00      	cmp	r3, #0
 8000c0e:	d012      	beq.n	8000c36 <I2C1_EV_IRQHandler+0xe6>
 8000c10:	687b      	ldr	r3, [r7, #4]
 8000c12:	2b00      	cmp	r3, #0
 8000c14:	d00f      	beq.n	8000c36 <I2C1_EV_IRQHandler+0xe6>
 8000c16:	4b0a      	ldr	r3, [pc, #40]	; (8000c40 <I2C1_EV_IRQHandler+0xf0>)
 8000c18:	699b      	ldr	r3, [r3, #24]
 8000c1a:	f403 3380 	and.w	r3, r3, #65536	; 0x10000
 8000c1e:	2b00      	cmp	r3, #0
 8000c20:	d109      	bne.n	8000c36 <I2C1_EV_IRQHandler+0xe6>
 8000c22:	4b07      	ldr	r3, [pc, #28]	; (8000c40 <I2C1_EV_IRQHandler+0xf0>)
 8000c24:	699b      	ldr	r3, [r3, #24]
 8000c26:	f403 2380 	and.w	r3, r3, #262144	; 0x40000
 8000c2a:	2b00      	cmp	r3, #0
 8000c2c:	d003      	beq.n	8000c36 <I2C1_EV_IRQHandler+0xe6>
 8000c2e:	4b05      	ldr	r3, [pc, #20]	; (8000c44 <I2C1_EV_IRQHandler+0xf4>)
 8000c30:	681b      	ldr	r3, [r3, #0]
 8000c32:	2005      	movs	r0, #5
 8000c34:	4798      	blx	r3
 8000c36:	683b      	ldr	r3, [r7, #0]
 8000c38:	bf00      	nop
 8000c3a:	3710      	adds	r7, #16
 8000c3c:	46bd      	mov	sp, r7
 8000c3e:	bd80      	pop	{r7, pc}
 8000c40:	40005400 	andmi	r5, r0, r0, lsl #8
 8000c44:	2000006c 	andcs	r0, r0, ip, rrx

