mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
08000c48 <I2C1_ER_IRQHandler>:
 8000c48:	b580      	push	{r7, lr}
 8000c4a:	b082      	sub	sp, #8
 8000c4c:	af00      	add	r7, sp, #0
 8000c4e:	4b39      	ldr	r3, [pc, #228]	; (8000d34 <I2C1_ER_IRQHandler+0xec>)
 8000c50:	685b      	ldr	r3, [r3, #4]
 8000c52:	f403 7380 	and.w	r3, r3, #256	; 0x100
 8000c56:	607b      	str	r3, [r7, #4]
 8000c58:	4b36      	ldr	r3, [pc, #216]	; (8000d34 <I2C1_ER_IRQHandler+0xec>)
 8000c5a:	695b      	ldr	r3, [r3, #20]
 8000c5c:	f003 0301 	and.w	r3, r3, #1
 8000c60:	603b      	str	r3, [r7, #0]
 8000c62:	683b      	ldr	r3, [r7, #0]
 8000c64:	2b00      	cmp	r3, #0
 8000c66:	d00c      	beq.n	8000c82 <I2C1_ER_IRQHandler+0x3a>
 8000c68:	687b      	ldr	r3, [r7, #4]
 8000c6a:	2b00      	cmp	r3, #0
 8000c6c:	d009      	beq.n	8000c82 <I2C1_ER_IRQHandler+0x3a>
 8000c6e:	4b31      	ldr	r3, [pc, #196]	; (8000d34 <I2C1_ER_IRQHandler+0xec>)
 8000c70:	695b      	ldr	r3, [r3, #20]
 8000c72:	4a30      	ldr	r2, [pc, #192]	; (8000d34 <I2C1_ER_IRQHandler+0xec>)
 8000c74:	f423 7380 	bic.w	r3, r3, #256	; 0x100
 8000c78:	6153      	str	r3, [r2, #20]
 8000c7a:	4b2f      	ldr	r3, [pc, #188]	; (8000d38 <I2C1_ER_IRQHandler+0xf0>)
 8000c7c:	681b      	ldr	r3, [r3, #0]
 8000c7e:	2000      	movs	r0, #0
 8000c80:	4798      	blx	r3
 8000c82:	4b2c      	ldr	r3, [pc, #176]	; (8000d34 <I2C1_ER_IRQHandler+0xec>)
 8000c84:	695b      	ldr	r3, [r3, #20]
 8000c86:	f003 0302 	and.w	r3, r3, #2
 8000c8a:	603b      	str	r3, [r7, #0]
 8000c8c:	683b      	ldr	r3, [r7, #0]
 8000c8e:	2b00      	cmp	r3, #0
 8000c90:	d00c      	beq.n	8000cac <I2C1_ER_IRQHandler+0x64>
 8000c92:	687b      	ldr	r3, [r7, #4]
 8000c94:	2b00      	cmp	r3, #0
 8000c96:	d009      	beq.n	8000cac <I2C1_ER_IRQHandler+0x64>
 8000c98:	4b26      	ldr	r3, [pc, #152]	; (8000d34 <I2C1_ER_IRQHandler+0xec>)
 8000c9a:	695b      	ldr	r3, [r3, #20]
 8000c9c:	4a25      	ldr	r2, [pc, #148]	; (8000d34 <I2C1_ER_IRQHandler+0xec>)
 8000c9e:	f423 7300 	bic.w	r3, r3, #512	; 0x200
 8000ca2:	6153      	str	r3, [r2, #20]
 8000ca4:	4b24      	ldr	r3, [pc, #144]	; (8000d38 <I2C1_ER_IRQHandler+0xf0>)
 8000ca6:	681b      	ldr	r3, [r3, #0]
 8000ca8:	2001      	movs	r0, #1
 8000caa:	4798      	blx	r3
 8000cac:	4b21      	ldr	r3, [pc, #132]	; (8000d34 <I2C1_ER_IRQHandler+0xec>)
 8000cae:	695b      	ldr	r3, [r3, #20]
 8000cb0:	f003 0304 	and.w	r3, r3, #4
 8000cb4:	603b      	str	r3, [r7, #0]
 8000cb6:	683b      	ldr	r3, [r7, #0]
 8000cb8:	2b00      	cmp	r3, #0
 8000cba:	d00c      	beq.n	8000cd6 <I2C1_ER_IRQHandler+0x8e>
 8000cbc:	687b      	ldr	r3, [r7, #4]
 8000cbe:	2b00      	cmp	r3, #0
 8000cc0:	d009      	beq.n	8000cd6 <I2C1_ER_IRQHandler+0x8e>
 8000cc2:	4b1c      	ldr	r3, [pc, #112]	; (8000d34 <I2C1_ER_IRQHandler+0xec>)
 8000cc4:	695b      	ldr	r3, [r3, #20]
 8000cc6:	4a1b      	ldr	r2, [pc, #108]	; (8000d34 <I2C1_ER_IRQHandler+0xec>)
 8000cc8:	f423 6380 	bic.w	r3, r3, #1024	; 0x400
 8000ccc:	6153      	str	r3, [r2, #20]
 8000cce:	4b1a      	ldr	r3, [pc, #104]	; (8000d38 <I2C1_ER_IRQHandler+0xf0>)
 8000cd0:	681b      	ldr	r3, [r3, #0]
 8000cd2:	2002      	movs	r0, #2
 8000cd4:	4798      	blx	r3
 8000cd6:	4b17      	ldr	r3, [pc, #92]	; (8000d34 <I2C1_ER_IRQHandler+0xec>)
 8000cd8:	695b      	ldr	r3, [r3, #20]
 8000cda:	f003 0308 	and.w	r3, r3, #8
 8000cde:	603b      	str	r3, [r7, #0]
 8000ce0:	683b      	ldr	r3, [r7, #0]
 8000ce2:	2b00      	cmp	r3, #0
 8000ce4:	d00c      	beq.n	8000d00 <I2C1_ER_IRQHandler+0xb8>
 8000ce6:	687b      	ldr	r3, [r7, #4]
 8000ce8:	2b00      	cmp	r3, #0
 8000cea:	d009      	beq.n	8000d00 <I2C1_ER_IRQHandler+0xb8>
 8000cec:	4b11      	ldr	r3, [pc, #68]	; (8000d34 <I2C1_ER_IRQHandler+0xec>)
 8000cee:	695b      	ldr	r3, [r3, #20]
 8000cf0:	4a10      	ldr	r2, [pc, #64]	; (8000d34 <I2C1_ER_IRQHandler+0xec>)
 8000cf2:	f423 6300 	bic.w	r3, r3, #2048	; 0x800
 8000cf6:	6153      	str	r3, [r2, #20]
 8000cf8:	4b0f      	ldr	r3, [pc, #60]	; (8000d38 <I2C1_ER_IRQHandler+0xf0>)
 8000cfa:	681b      	ldr	r3, [r3, #0]
 8000cfc:	2003      	movs	r0, #3
 8000cfe:	4798      	blx	r3
 8000d00:	4b0c      	ldr	r3, [pc, #48]	; (8000d34 <I2C1_ER_IRQHandler+0xec>)
 8000d02:	695b      	ldr	r3, [r3, #20]
 8000d04:	f003 0320 	and.w	r3, r3, #32
 8000d08:	603b      	str	r3, [r7, #0]
 8000d0a:	683b      	ldr	r3, [r7, #0]
 8000d0c:	2b00      	cmp	r3, #0
 8000d0e:	d00c      	beq.n	8000d2a <I2C1_ER_IRQHandler+0xe2>
 8000d10:	687b      	ldr	r3, [r7, #4]
 8000d12:	2b00      	cmp	r3, #0
 8000d14:	d009      	beq.n	8000d2a <I2C1_ER_IRQHandler+0xe2>
 8000d16:	4b07      	ldr	r3, [pc, #28]	; (8000d34 <I2C1_ER_IRQHandler+0xec>)
 8000d18:	695b      	ldr	r3, [r3, #20]
 8000d1a:	4a06      	ldr	r2, [pc, #24]	; (8000d34 <I2C1_ER_IRQHandler+0xec>)
 8000d1c:	f423 4380 	bic.w	r3, r3, #16384	; 0x4000
 8000d20:	6153      	str	r3, [r2, #20]
 8000d22:	4b05      	ldr	r3, [pc, #20]	; (8000d38 <I2C1_ER_IRQHandler+0xf0>)
 8000d24:	681b      	ldr	r3, [r3, #0]
 8000d26:	2005      	movs	r0, #5
 8000d28:	4798      	blx	r3
 8000d2a:	bf00      	nop
 8000d2c:	3708      	adds	r7, #8
 8000d2e:	46bd      	mov	sp, r7
 8000d30:	bd80      	pop	{r7, pc}
 8000d32:	bf00      	nop
 8000d34:	40005400 	andmi	r5, r0, r0, lsl #8
 8000d38:	20000074 	andcs	r0, r0, r4, ror r0

08000d3c <I2C2_EV_IRQHandler>:
 8000d3c:	b580      	push	{r7, lr}
 8000d3e:	b084      	sub	sp, #16
 8000d40:	af00      	add	r7, sp, #0
 8000d42:	2300      	movs	r3, #0
 8000d44:	603b      	str	r3, [r7, #0]
 8000d46:	4b39      	ldr	r3, [pc, #228]	; (8000e2c <I2C2_EV_IRQHandler+0xf0>)
 8000d48:	685b      	ldr	r3, [r3, #4]
 8000d4a:	f403 7300 	and.w	r3, r3, #512	; 0x200
 8000d4e:	60fb      	str	r3, [r7, #12]
 8000d50:	4b36      	ldr	r3, [pc, #216]	; (8000e2c <I2C2_EV_IRQHandler+0xf0>)
 8000d52:	685b      	ldr	r3, [r3, #4]
 8000d54:	f403 6380 	and.w	r3, r3, #1024	; 0x400
 8000d58:	60bb      	str	r3, [r7, #8]
 8000d5a:	4b34      	ldr	r3, [pc, #208]	; (8000e2c <I2C2_EV_IRQHandler+0xf0>)
 8000d5c:	695b      	ldr	r3, [r3, #20]
 8000d5e:	f003 0304 	and.w	r3, r3, #4
 8000d62:	607b      	str	r3, [r7, #4]
 8000d64:	68fb      	ldr	r3, [r7, #12]
 8000d66:	2b00      	cmp	r3, #0
 8000d68:	d00a      	beq.n	8000d80 <I2C2_EV_IRQHandler+0x44>
 8000d6a:	687b      	ldr	r3, [r7, #4]
 8000d6c:	2b00      	cmp	r3, #0
 8000d6e:	d007      	beq.n	8000d80 <I2C2_EV_IRQHandler+0x44>
 8000d70:	4b2e      	ldr	r3, [pc, #184]	; (8000e2c <I2C2_EV_IRQHandler+0xf0>)
 8000d72:	4a2e      	ldr	r2, [pc, #184]	; (8000e2c <I2C2_EV_IRQHandler+0xf0>)
 8000d74:	681b      	ldr	r3, [r3, #0]
 8000d76:	6013      	str	r3, [r2, #0]
 8000d78:	4b2d      	ldr	r3, [pc, #180]	; (8000e30 <I2C2_EV_IRQHandler+0xf4>)
 8000d7a:	681b      	ldr	r3, [r3, #0]
 8000d7c:	2004      	movs	r0, #4
 8000d7e:	4798      	blx	r3
 8000d80:	4b2a      	ldr	r3, [pc, #168]	; (8000e2c <I2C2_EV_IRQHandler+0xf0>)
 8000d82:	695b      	ldr	r3, [r3, #20]
 8000d84:	f003 0301 	and.w	r3, r3, #1
 8000d88:	607b      	str	r3, [r7, #4]
 8000d8a:	68fb      	ldr	r3, [r7, #12]
 8000d8c:	2b00      	cmp	r3, #0
 8000d8e:	d00c      	beq.n	8000daa <I2C2_EV_IRQHandler+0x6e>
 8000d90:	687b      	ldr	r3, [r7, #4]
 8000d92:	2b00      	cmp	r3, #0
 8000d94:	d009      	beq.n	8000daa <I2C2_EV_IRQHandler+0x6e>
 8000d96:	4b25      	ldr	r3, [pc, #148]	; (8000e2c <I2C2_EV_IRQHandler+0xf0>)
 8000d98:	699b      	ldr	r3, [r3, #24]
 8000d9a:	f403 3380 	and.w	r3, r3, #65536	; 0x10000
 8000d9e:	2b00      	cmp	r3, #0
 8000da0:	d103      	bne.n	8000daa <I2C2_EV_IRQHandler+0x6e>
 8000da2:	4b23      	ldr	r3, [pc, #140]	; (8000e30 <I2C2_EV_IRQHandler+0xf4>)
 8000da4:	681b      	ldr	r3, [r3, #0]
 8000da6:	2001      	movs	r0, #1
 8000da8:	4798      	blx	r3
 8000daa:	4b20      	ldr	r3, [pc, #128]	; (8000e2c <I2C2_EV_IRQHandler+0xf0>)
 8000dac:	695b      	ldr	r3, [r3, #20]
 8000dae:	f003 0307 	and.w	r3, r3, #7
 8000db2:	607b      	str	r3, [r7, #4]
 8000db4:	68fb      	ldr	r3, [r7, #12]
 8000db6:	2b00      	cmp	r3, #0
 8000db8:	d015      	beq.n	8000de6 <I2C2_EV_IRQHandler+0xaa>
 8000dba:	68bb      	ldr	r3, [r7, #8]
 8000dbc:	2b00      	cmp	r3, #0
 8000dbe:	d012      	beq.n	8000de6 <I2C2_EV_IRQHandler+0xaa>
 8000dc0:	687b      	ldr	r3, [r7, #4]
 8000dc2:	2b00      	cmp	r3, #0
 8000dc4:	d00f      	beq.n	8000de6 <I2C2_EV_IRQHandler+0xaa>
 8000dc6:	4b19      	ldr	r3, [pc, #100]	; (8000e2c <I2C2_EV_IRQHandler+0xf0>)
 8000dc8:	699b      	ldr	r3, [r3, #24]
 8000dca:	f403 3380 	and.w	r3, r3, #65536	; 0x10000
 8000dce:	2b00      	cmp	r3, #0
 8000dd0:	d109      	bne.n	8000de6 <I2C2_EV_IRQHandler+0xaa>
 8000dd2:	4b16      	ldr	r3, [pc, #88]	; (8000e2c <I2C2_EV_IRQHandler+0xf0>)
 8000dd4:	699b      	ldr	r3, [r3, #24]
 8000dd6:	f403 2380 	and.w	r3, r3, #262144	; 0x40000
 8000dda:	2b00      	cmp	r3, #0
 8000ddc:	d003      	beq.n	8000de6 <I2C2_EV_IRQHandler+0xaa>
 8000dde:	4b14      	ldr	r3, [pc, #80]	; (8000e30 <I2C2_EV_IRQHandler+0xf4>)
 8000de0:	681b      	ldr	r3, [r3, #0]
 8000de2:	2006      	movs	r0, #6
 8000de4:	4798      	blx	r3
 8000de6:	4b11      	ldr	r3, [pc, #68]	; (8000e2c <I2C2_EV_IRQHandler+0xf0>)
 8000de8:	695b      	ldr	r3, [r3, #20]
 8000dea:	f003 0306 	and.w	r3, r3, #6
 8000dee:	607b      	str	r3, [r7, #4]
 8000df0:	68fb      	ldr	r3, [r7, #12]
 8000df2:	2b00      	cmp	r3, #0
 8000df4:	d015      	beq.n	8000e22 <I2C2_EV_IRQHandler+0xe6>
 8000df6:	68bb      	ldr	r3, [r7, #8]
 8000df8:	2b00      	cmp	r3, #0
 8000dfa:	d012      	beq.n	8000e22 <I2C2_EV_IRQHandler+0xe6>
 8000dfc:	687b      	ldr	r3, [r7, #4]
 8000dfe:	2b00      	cmp	r3, #0
 8000e00:	d00f      	beq.n	8000e22 <I2C2_EV_IRQHandler+0xe6>
 8000e02:	4b0c      	ldr	r3, [pc, #48]	; (8000e34 <I2C2_EV_IRQHandler+0xf8>)
 8000e04:	699b      	ldr	r3, [r3, #24]
 8000e06:	f403 3380 	and.w	r3, r3, #65536	; 0x10000
 8000e0a:	2b00      	cmp	r3, #0
 8000e0c:	d109      	bne.n	8000e22 <I2C2_EV_IRQHandler+0xe6>
 8000e0e:	4b07      	ldr	r3, [pc, #28]	; (8000e2c <I2C2_EV_IRQHandler+0xf0>)
 8000e10:	699b      	ldr	r3, [r3, #24]
 8000e12:	f403 2380 	and.w	r3, r3, #262144	; 0x40000
 8000e16:	2b00      	cmp	r3, #0
 8000e18:	d003      	beq.n	8000e22 <I2C2_EV_IRQHandler+0xe6>
 8000e1a:	4b05      	ldr	r3, [pc, #20]	; (8000e30 <I2C2_EV_IRQHandler+0xf4>)
 8000e1c:	681b      	ldr	r3, [r3, #0]
 8000e1e:	2005      	movs	r0, #5
 8000e20:	4798      	blx	r3
 8000e22:	683b      	ldr	r3, [r7, #0]
 8000e24:	bf00      	nop
 8000e26:	3710      	adds	r7, #16
 8000e28:	46bd      	mov	sp, r7
 8000e2a:	bd80      	pop	{r7, pc}
 8000e2c:	40005800 	andmi	r5, r0, r0, lsl #16
 8000e30:	20000070 	andcs	r0, r0, r0, ror r0
 8000e34:	40005400 	andmi	r5, r0, r0, lsl #8

08000e38 <I2C2_ER_IRQHandler>:
 8000e38:	b580      	push	{r7, lr}
 8000e3a:	b082      	sub	sp, #8
 8000e3c:	af00      	add	r7, sp, #0
 8000e3e:	4b39      	ldr	r3, [pc, #228]	; (8000f24 <I2C2_ER_IRQHandler+0xec>)
 8000e40:	685b      	ldr	r3, [r3, #4]
 8000e42:	f403 7380 	and.w	r3, r3, #256	; 0x100
 8000e46:	607b      	str	r3, [r7, #4]
 8000e48:	4b36      	ldr	r3, [pc, #216]	; (8000f24 <I2C2_ER_IRQHandler+0xec>)
 8000e4a:	695b      	ldr	r3, [r3, #20]
 8000e4c:	f003 0301 	and.w	r3, r3, #1
 8000e50:	603b      	str	r3, [r7, #0]
 8000e52:	683b      	ldr	r3, [r7, #0]
 8000e54:	2b00      	cmp	r3, #0
 8000e56:	d00c      	beq.n	8000e72 <I2C2_ER_IRQHandler+0x3a>
 8000e58:	687b      	ldr	r3, [r7, #4]
 8000e5a:	2b00      	cmp	r3, #0
 8000e5c:	d009      	beq.n	8000e72 <I2C2_ER_IRQHandler+0x3a>
 8000e5e:	4b31      	ldr	r3, [pc, #196]	; (8000f24 <I2C2_ER_IRQHandler+0xec>)
 8000e60:	695b      	ldr	r3, [r3, #20]
 8000e62:	4a30      	ldr	r2, [pc, #192]	; (8000f24 <I2C2_ER_IRQHandler+0xec>)
 8000e64:	f423 7380 	bic.w	r3, r3, #256	; 0x100
 8000e68:	6153      	str	r3, [r2, #20]
 8000e6a:	4b2f      	ldr	r3, [pc, #188]	; (8000f28 <I2C2_ER_IRQHandler+0xf0>)
 8000e6c:	681b      	ldr	r3, [r3, #0]
 8000e6e:	2000      	movs	r0, #0
 8000e70:	4798      	blx	r3
 8000e72:	4b2c      	ldr	r3, [pc, #176]	; (8000f24 <I2C2_ER_IRQHandler+0xec>)
 8000e74:	695b      	ldr	r3, [r3, #20]
 8000e76:	f003 0302 	and.w	r3, r3, #2
 8000e7a:	603b      	str	r3, [r7, #0]
 8000e7c:	683b      	ldr	r3, [r7, #0]
 8000e7e:	2b00      	cmp	r3, #0
 8000e80:	d00c      	beq.n	8000e9c <I2C2_ER_IRQHandler+0x64>
 8000e82:	687b      	ldr	r3, [r7, #4]
 8000e84:	2b00      	cmp	r3, #0
 8000e86:	d009      	beq.n	8000e9c <I2C2_ER_IRQHandler+0x64>
 8000e88:	4b26      	ldr	r3, [pc, #152]	; (8000f24 <I2C2_ER_IRQHandler+0xec>)
 8000e8a:	695b      	ldr	r3, [r3, #20]
 8000e8c:	4a25      	ldr	r2, [pc, #148]	; (8000f24 <I2C2_ER_IRQHandler+0xec>)
 8000e8e:	f423 7300 	bic.w	r3, r3, #512	; 0x200
 8000e92:	6153      	str	r3, [r2, #20]
 8000e94:	4b24      	ldr	r3, [pc, #144]	; (8000f28 <I2C2_ER_IRQHandler+0xf0>)
 8000e96:	681b      	ldr	r3, [r3, #0]
 8000e98:	2001      	movs	r0, #1
 8000e9a:	4798      	blx	r3
 8000e9c:	4b21      	ldr	r3, [pc, #132]	; (8000f24 <I2C2_ER_IRQHandler+0xec>)
 8000e9e:	695b      	ldr	r3, [r3, #20]
 8000ea0:	f003 0304 	and.w	r3, r3, #4
 8000ea4:	603b      	str	r3, [r7, #0]
 8000ea6:	683b      	ldr	r3, [r7, #0]
 8000ea8:	2b00      	cmp	r3, #0
 8000eaa:	d00c      	beq.n	8000ec6 <I2C2_ER_IRQHandler+0x8e>
 8000eac:	687b      	ldr	r3, [r7, #4]
 8000eae:	2b00      	cmp	r3, #0
 8000eb0:	d009      	beq.n	8000ec6 <I2C2_ER_IRQHandler+0x8e>
 8000eb2:	4b1e      	ldr	r3, [pc, #120]	; (8000f2c <I2C2_ER_IRQHandler+0xf4>)
 8000eb4:	699b      	ldr	r3, [r3, #24]
 8000eb6:	4a1d      	ldr	r2, [pc, #116]	; (8000f2c <I2C2_ER_IRQHandler+0xf4>)
 8000eb8:	f423 6380 	bic.w	r3, r3, #1024	; 0x400
 8000ebc:	6193      	str	r3, [r2, #24]
 8000ebe:	4b1a      	ldr	r3, [pc, #104]	; (8000f28 <I2C2_ER_IRQHandler+0xf0>)
 8000ec0:	681b      	ldr	r3, [r3, #0]
 8000ec2:	2002      	movs	r0, #2
 8000ec4:	4798      	blx	r3
 8000ec6:	4b17      	ldr	r3, [pc, #92]	; (8000f24 <I2C2_ER_IRQHandler+0xec>)
 8000ec8:	695b      	ldr	r3, [r3, #20]
 8000eca:	f003 0308 	and.w	r3, r3, #8
 8000ece:	603b      	str	r3, [r7, #0]
 8000ed0:	683b      	ldr	r3, [r7, #0]
 8000ed2:	2b00      	cmp	r3, #0
 8000ed4:	d00c      	beq.n	8000ef0 <I2C2_ER_IRQHandler+0xb8>
 8000ed6:	687b      	ldr	r3, [r7, #4]
 8000ed8:	2b00      	cmp	r3, #0
 8000eda:	d009      	beq.n	8000ef0 <I2C2_ER_IRQHandler+0xb8>
 8000edc:	4b11      	ldr	r3, [pc, #68]	; (8000f24 <I2C2_ER_IRQHandler+0xec>)
 8000ede:	695b      	ldr	r3, [r3, #20]
 8000ee0:	4a10      	ldr	r2, [pc, #64]	; (8000f24 <I2C2_ER_IRQHandler+0xec>)
 8000ee2:	f423 6300 	bic.w	r3, r3, #2048	; 0x800
 8000ee6:	6153      	str	r3, [r2, #20]
 8000ee8:	4b0f      	ldr	r3, [pc, #60]	; (8000f28 <I2C2_ER_IRQHandler+0xf0>)
 8000eea:	681b      	ldr	r3, [r3, #0]
 8000eec:	2003      	movs	r0, #3
 8000eee:	4798      	blx	r3
 8000ef0:	4b0c      	ldr	r3, [pc, #48]	; (8000f24 <I2C2_ER_IRQHandler+0xec>)
 8000ef2:	695b      	ldr	r3, [r3, #20]
 8000ef4:	f003 0320 	and.w	r3, r3, #32
 8000ef8:	603b      	str	r3, [r7, #0]
 8000efa:	683b      	ldr	r3, [r7, #0]
 8000efc:	2b00      	cmp	r3, #0
 8000efe:	d00c      	beq.n	8000f1a <I2C2_ER_IRQHandler+0xe2>
 8000f00:	687b      	ldr	r3, [r7, #4]
 8000f02:	2b00      	cmp	r3, #0
 8000f04:	d009      	beq.n	8000f1a <I2C2_ER_IRQHandler+0xe2>
 8000f06:	4b07      	ldr	r3, [pc, #28]	; (8000f24 <I2C2_ER_IRQHandler+0xec>)
 8000f08:	695b      	ldr	r3, [r3, #20]
 8000f0a:	4a06      	ldr	r2, [pc, #24]	; (8000f24 <I2C2_ER_IRQHandler+0xec>)
 8000f0c:	f423 4380 	bic.w	r3, r3, #16384	; 0x4000
 8000f10:	6153      	str	r3, [r2, #20]
 8000f12:	4b05      	ldr	r3, [pc, #20]	; (8000f28 <I2C2_ER_IRQHandler+0xf0>)
 8000f14:	681b      	ldr	r3, [r3, #0]
 8000f16:	2005      	movs	r0, #5
 8000f18:	4798      	blx	r3
 8000f1a:	bf00      	nop
 8000f1c:	3708      	adds	r7, #8
 8000f1e:	46bd      	mov	sp, r7
 8000f20:	bd80      	pop	{r7, pc}
 8000f22:	bf00      	nop
 8000f24:	40005800 	andmi	r5, r0, r0, lsl #16
 8000f28:	20000078 	andcs	r0, r0, r8, ror r0
 8000f2c:	40005400 	andmi	r5, r0, r0, lsl #8

08000f30 <SPI1_IRQHandler>:
 8000f30:	b580      	push	{r7, lr}
 8000f32:	af00      	add	r7, sp, #0
 8000f34:	4b02      	ldr	r3, [pc, #8]	; (8000f40 <SPI1_IRQHandler+0x10>)
 8000f36:	681b      	ldr	r3, [r3, #0]
 8000f38:	4798      	blx	r3
 8000f3a:	bf00      	nop
 8000f3c:	bd80      	pop	{r7, pc}
 8000f3e:	bf00      	nop
 8000f40:	2000007c 	andcs	r0, r0, ip, ror r0

