mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
08000f44 <SPI2_IRQHandler>:
 8000f44:	b580      	push	{r7, lr}
 8000f46:	af00      	add	r7, sp, #0
 8000f48:	4b02      	ldr	r3, [pc, #8]	; (8000f54 <SPI2_IRQHandler+0x10>)
 8000f4a:	685b      	ldr	r3, [r3, #4]
 8000f4c:	4798      	blx	r3
 8000f4e:	bf00      	nop
 8000f50:	bd80      	pop	{r7, pc}
 8000f52:	bf00      	nop
 8000f54:	2000007c 	andcs	r0, r0, ip, ror r0

08000f58 <USART1_IRQHandler>:
 8000f58:	b580      	push	{r7, lr}
 8000f5a:	af00      	add	r7, sp, #0
 8000f5c:	4b02      	ldr	r3, [pc, #8]	; (8000f68 <USART1_IRQHandler+0x10>)
 8000f5e:	681b      	ldr	r3, [r3, #0]
 8000f60:	4798      	blx	r3
 8000f62:	bf00      	nop
 8000f64:	bd80      	pop	{r7, pc}
 8000f66:	bf00      	nop
 8000f68:	2000008c 	andcs	r0, r0, ip, lsl #1

08000f6c <USART2_IRQHandler>:
 8000f6c:	b580      	push	{r7, lr}
 8000f6e:	af00      	add	r7, sp, #0
 8000f70:	4b02      	ldr	r3, [pc, #8]	; (8000f7c <USART2_IRQHandler+0x10>)
 8000f72:	685b      	ldr	r3, [r3, #4]
 8000f74:	4798      	blx	r3
 8000f76:	bf00      	nop
 8000f78:	bd80      	pop	{r7, pc}
 8000f7a:	bf00      	nop
 8000f7c:	2000008c 	andcs	r0, r0, ip, lsl #1

08000f80 <USART3_IRQHandler>:
 8000f80:	b580      	push	{r7, lr}
 8000f82:	af00      	add	r7, sp, #0
 8000f84:	4b02      	ldr	r3, [pc, #8]	; (8000f90 <USART3_IRQHandler+0x10>)
 8000f86:	689b      	ldr	r3, [r3, #8]
 8000f88:	4798      	blx	r3
 8000f8a:	bf00      	nop
 8000f8c:	bd80      	pop	{r7, pc}
 8000f8e:	bf00      	nop
 8000f90:	2000008c 	andcs	r0, r0, ip, lsl #1

08000f94 <CallBackFunction>:
 8000f94:	b480      	push	{r7}
 8000f96:	af00      	add	r7, sp, #0
 8000f98:	4b08      	ldr	r3, [pc, #32]	; (8000fbc <CallBackFunction+0x28>)
 8000f9a:	2201      	movs	r2, #1
 8000f9c:	701a      	strb	r2, [r3, #0]
 8000f9e:	bf00      	nop
 8000fa0:	bf00      	nop
 8000fa2:	bf00      	nop
 8000fa4:	f3ef 8305 	mrs	r3, IPSR
 8000fa8:	4a05      	ldr	r2, [pc, #20]	; (8000fc0 <CallBackFunction+0x2c>)
 8000faa:	6013      	str	r3, [r2, #0]
 8000fac:	bf00      	nop
 8000fae:	bf00      	nop
 8000fb0:	bf00      	nop
 8000fb2:	bf00      	nop
 8000fb4:	46bd      	mov	sp, r7
 8000fb6:	bc80      	pop	{r7}
 8000fb8:	4770      	bx	lr
 8000fba:	bf00      	nop
 8000fbc:	20000098 	mulcs	r0, r8, r0
 8000fc0:	200000a0 	andcs	r0, r0, r0, lsr #1

08000fc4 <main>:
 8000fc4:	b580      	push	{r7, lr}
 8000fc6:	b086      	sub	sp, #24
 8000fc8:	af00      	add	r7, sp, #0
 8000fca:	2301      	movs	r3, #1
 8000fcc:	747b      	strb	r3, [r7, #17]
 8000fce:	2309      	movs	r3, #9
 8000fd0:	713b      	strb	r3, [r7, #4]
 8000fd2:	4b11      	ldr	r3, [pc, #68]	; (8001018 <main+0x54>)
 8000fd4:	60bb      	str	r3, [r7, #8]
 8000fd6:	f44f 7300 	mov.w	r3, #512	; 0x200
 8000fda:	81bb      	strh	r3, [r7, #12]
 8000fdc:	2308      	movs	r3, #8
 8000fde:	73bb      	strb	r3, [r7, #14]
 8000fe0:	2300      	movs	r3, #0
 8000fe2:	73fb      	strb	r3, [r7, #15]
 8000fe4:	2300      	movs	r3, #0
 8000fe6:	743b      	strb	r3, [r7, #16]
 8000fe8:	4b0c      	ldr	r3, [pc, #48]	; (800101c <main+0x58>)
 8000fea:	617b      	str	r3, [r7, #20]
 8000fec:	1d3b      	adds	r3, r7, #4
 8000fee:	4618      	mov	r0, r3
 8000ff0:	f7ff f9c8 	bl	8000384 <MCAL_EXTI_Init>
 8000ff4:	bf00      	nop
 8000ff6:	bf00      	nop
 8000ff8:	bf00      	nop
 8000ffa:	f3ef 8314 	mrs	r3, CONTROL
 8000ffe:	4a08      	ldr	r2, [pc, #32]	; (8001020 <main+0x5c>)
 8001000:	6013      	str	r3, [r2, #0]
 8001002:	bf00      	nop
 8001004:	bf00      	nop
 8001006:	bf00      	nop
 8001008:	4b06      	ldr	r3, [pc, #24]	; (8001024 <main+0x60>)
 800100a:	781b      	ldrb	r3, [r3, #0]
 800100c:	2b00      	cmp	r3, #0
 800100e:	d0fb      	beq.n	8001008 <main+0x44>
 8001010:	4b04      	ldr	r3, [pc, #16]	; (8001024 <main+0x60>)
 8001012:	2200      	movs	r2, #0
 8001014:	701a      	strb	r2, [r3, #0]
 8001016:	e7f7      	b.n	8001008 <main+0x44>
 8001018:	40010c00 	andmi	r0, r1, r0, lsl #24
 800101c:	08000f95 	stmdaeq	r0, {r0, r2, r4, r7, r8, r9, sl, fp}
 8001020:	2000009c 	mulcs	r0, ip, r0
 8001024:	20000098 	mulcs	r0, r8, r0

08001028 <Reset_Handler>:
 8001028:	480d      	ldr	r0, [pc, #52]	; (8001060 <LoopForever+0x2>)
 800102a:	4685      	mov	sp, r0
 800102c:	f3af 8000 	nop.w
 8001030:	480c      	ldr	r0, [pc, #48]	; (8001064 <LoopForever+0x6>)
 8001032:	490d      	ldr	r1, [pc, #52]	; (8001068 <LoopForever+0xa>)
 8001034:	4a0d      	ldr	r2, [pc, #52]	; (800106c <LoopForever+0xe>)
 8001036:	2300      	movs	r3, #0
 8001038:	e002      	b.n	8001040 <LoopCopyDataInit>

0800103a <CopyDataInit>:
 800103a:	58d4      	ldr	r4, [r2, r3]
 800103c:	50c4      	str	r4, [r0, r3]
 800103e:	3304      	adds	r3, #4

08001040 <LoopCopyDataInit>:
 8001040:	18c4      	adds	r4, r0, r3
 8001042:	428c      	cmp	r4, r1
 8001044:	d3f9      	bcc.n	800103a <CopyDataInit>
 8001046:	4a0a      	ldr	r2, [pc, #40]	; (8001070 <LoopForever+0x12>)
 8001048:	4c0a      	ldr	r4, [pc, #40]	; (8001074 <LoopForever+0x16>)
 800104a:	2300      	movs	r3, #0
 800104c:	e001      	b.n	8001052 <LoopFillZerobss>

0800104e <FillZerobss>:
 800104e:	6013      	str	r3, [r2, #0]
 8001050:	3204      	adds	r2, #4

08001052 <LoopFillZerobss>:
 8001052:	42a2      	cmp	r2, r4
 8001054:	d3fb      	bcc.n	800104e <FillZerobss>
 8001056:	f000 f811 	bl	800107c <__libc_init_array>
 800105a:	f7ff ffb3 	bl	8000fc4 <main>

0800105e <LoopForever>:
 800105e:	e7fe      	b.n	800105e <LoopForever>
 8001060:	20005000 	andcs	r5, r0, r0
 8001064:	20000000 	andcs	r0, r0, r0
 8001068:	20000000 	andcs	r0, r0, r0
 800106c:	080010e4 	stmdaeq	r0, {r2, r5, r6, r7, ip}
 8001070:	20000000 	andcs	r0, r0, r0
 8001074:	200000a4 	andcs	r0, r0, r4, lsr #1

08001078 <ADC1_2_IRQHandler>:
 8001078:	e7fe      	b.n	8001078 <ADC1_2_IRQHandler>
	...

0800107c <__libc_init_array>:
 800107c:	b570      	push	{r4, r5, r6, lr}
 800107e:	2500      	movs	r5, #0
 8001080:	4e0c      	ldr	r6, [pc, #48]	; (80010b4 <__libc_init_array+0x38>)
 8001082:	4c0d      	ldr	r4, [pc, #52]	; (80010b8 <__libc_init_array+0x3c>)
 8001084:	1ba4      	subs	r4, r4, r6
 8001086:	10a4      	asrs	r4, r4, #2
 8001088:	42a5      	cmp	r5, r4
 800108a:	d109      	bne.n	80010a0 <__libc_init_array+0x24>
 800108c:	f000 f81a 	bl	80010c4 <_init>
 8001090:	2500      	movs	r5, #0
 8001092:	4e0a      	ldr	r6, [pc, #40]	; (80010bc <__libc_init_array+0x40>)
 8001094:	4c0a      	ldr	r4, [pc, #40]	; (80010c0 <__libc_init_array+0x44>)
 8001096:	1ba4      	subs	r4, r4, r6
 8001098:	10a4      	asrs	r4, r4, #2
 800109a:	42a5      	cmp	r5, r4
 800109c:	d105      	bne.n	80010aa <__libc_init_array+0x2e>
 800109e:	bd70      	pop	{r4, r5, r6, pc}
 80010a0:	f856 3025 	ldr.w	r3, [r6, r5, lsl #2]
 80010a4:	4798      	blx	r3
 80010a6:	3501      	adds	r5, #1
 80010a8:	e7ee      	b.n	8001088 <__libc_init_array+0xc>
 80010aa:	f856 3025 	ldr.w	r3, [r6, r5, lsl #2]
 80010ae:	4798      	blx	r3
 80010b0:	3501      	adds	r5, #1
 80010b2:	e7f2      	b.n	800109a <__libc_init_array+0x1e>
 80010b4:	080010dc 	stmdaeq	r0, {r2, r3, r4, r6, r7, ip}
 80010b8:	080010dc 	stmdaeq	r0, {r2, r3, r4, r6, r7, ip}
 80010bc:	080010dc 	stmdaeq	r0, {r2, r3, r4, r6, r7, ip}
 80010c0:	080010e0 	stmdaeq	r0, {r5, r6, r7, ip}

080010c4 <_init>:
 80010c4:	b5f8      	push	{r3, r4, r5, r6, r7, lr}
 80010c6:	bf00      	nop
 80010c8:	bcf8      	pop	{r3, r4, r5, r6, r7}
 80010ca:	bc08      	pop	{r3}
 80010cc:	469e      	mov	lr, r3
 80010ce:	4770      	bx	lr

080010d0 <_fini>:
 80010d0:	b5f8      	push	{r3, r4, r5, r6, r7, lr}
 80010d2:	bf00      	nop
 80010d4:	bcf8      	pop	{r3, r4, r5, r6, r7}
 80010d6:	bc08      	pop	{r3}
 80010d8:	469e      	mov	lr, r3
 80010da:	4770      	bx	lr

