mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
Disassembly of section .init_array:

080010dc <__frame_dummy_init_array_entry>:
 80010dc:	08000155 	stmdaeq	r0, {r0, r2, r4, r6, r8}

Disassembly of section .fini_array:

080010e0 <__do_global_dtors_aux_fini_array_entry>:
 80010e0:	08000131 	stmdaeq	r0, {r0, r4, r5, r8}

Disassembly of section .bss:

20000000 <__bss_start__>:
20000000:	00000000 	andeq	r0, r0, r0

20000004 <object.8661>:
	...

2000001c <g_IRQ_CallBackPtr>:
	...

20000058 <GPIO_CLK_InitFlag.4250>:
	...

20000060 <g_IRQ_CallBackPtr>:
	...

2000006c <g_IRQ_I2C1_Event_CallBackFunction>:
2000006c:	00000000 	andeq	r0, r0, r0

20000070 <g_IRQ_I2C2_Event_CallBackFunction>:
20000070:	00000000 	andeq	r0, r0, r0

20000074 <g_IRQ_I2C1_Error_CallBackFunction>:
20000074:	00000000 	andeq	r0, r0, r0

20000078 <g_IRQ_I2C2_Error_CallBackFunction>:
20000078:	00000000 	andeq	r0, r0, r0

2000007c <g_IRQ_CallBackPtr>:
	...

2000008c <g_IRQ_CallBackPtr>:
	...

20000098 <IRQ_Flag>:
20000098:	00000000 	andeq	r0, r0, r0

2000009c <VAL_CONTROL>:
2000009c:	00000000 	andeq	r0, r0, r0

200000a0 <VAL_IPSR>:
200000a0:	00000000 	andeq	r0, r0, r0

Disassembly of section ._user_heap_stack:

200000a4 <_end-0x4>:
200000a4:	00000000 	andeq	r0, r0, r0

200000a8 <_end>:
	...

Disassembly of section .ARM.attributes:

00000000 <.ARM.attributes>:
   0:	00002841 	andeq	r2, r0, r1, asr #16
   4:	61656100 	cmnvs	r5, r0, lsl #2
   8:	01006962 	tsteq	r0, r2, ror #18
   c:	0000001e 	andeq	r0, r0, lr, lsl r0
  10:	4d2d3705 	stcmi	7, cr3, [sp, #-20]!	; 0xffffffec
  14:	070a0600 	streq	r0, [sl, -r0, lsl #12]
  18:	1202094d 	andne	r0, r2, #1261568	; 0x134000
  1c:	15011404 	strne	r1, [r1, #-1028]	; 0xfffffbfc
  20:	18031701 	stmdane	r3, {r0, r8, r9, sl, ip}
  24:	22011a01 	andcs	r1, r1, #4096	; 0x1000
  28:	Address 0x0000000000000028 is out of bounds.


Disassembly of section .debug_info:

00000000 <.debug_info>:
       0:	00000487 	andeq	r0, r0, r7, lsl #9
       4:	00000002 	andeq	r0, r0, r2
       8:	01040000 	mrseq	r0, (UNDEF: 4)
       c:	00006576 	andeq	r6, r0, r6, ror r5
      10:	0039b70c 	eorseq	fp, r9, ip, lsl #14
      14:	004d0800 	subeq	r0, sp, r0, lsl #16
	...
      2c:	02010200 	andeq	r0, r1, #0, 4
      30:	00002a74 	andeq	r2, r0, r4, ror sl
      34:	e1080102 	tst	r8, r2, lsl #2
      38:	02000004 	andeq	r0, r0, #4
      3c:	04da0601 	ldrbeq	r0, [sl], #1537	; 0x601
      40:	e1030000 	mrs	r0, (UNDEF: 3)
      44:	0200004f 	andeq	r0, r0, #79	; 0x4f
      48:	00005214 	andeq	r5, r0, r4, lsl r2
      4c:	00420400 	subeq	r0, r2, r0, lsl #8
      50:	01020000 	mrseq	r0, (UNDEF: 2)
      54:	0048ac08 	subeq	sl, r8, r8, lsl #24
      58:	05020200 	streq	r0, [r2, #-512]	; 0xfffffe00
      5c:	0000060d 	andeq	r0, r0, sp, lsl #12
      60:	00804c03 	addeq	r4, r0, r3, lsl #24
      64:	6b160200 	blvs	58086c <_Min_Stack_Size+0x58046c>
      68:	02000000 	andeq	r0, r0, #0
      6c:	51ca0702 	bicpl	r0, sl, r2, lsl #14
      70:	04050000 	streq	r0, [r5], #-0
      74:	746e6905 	strbtvc	r6, [lr], #-2309	; 0xfffff6fb
      78:	00890300 	addeq	r0, r9, r0, lsl #6
      7c:	18020000 	stmdane	r2, {}	; <UNPREDICTABLE>
      80:	00000084 	andeq	r0, r0, r4, lsl #1
      84:	40070402 	andmi	r0, r7, r2, lsl #8
      88:	06000028 	streq	r0, [r0], -r8, lsr #32
      8c:	00000084 	andeq	r0, r0, r4, lsl #1
      90:	fc050802 	stc2	8, cr0, [r5], {2}
      94:	02000041 	andeq	r0, r0, #65	; 0x41
      98:	58fe0708 	ldmpl	lr!, {r3, r8, r9, sl}^
      9c:	88030000 	stmdahi	r3, {}	; <UNPREDICTABLE>
      a0:	02000000 	andeq	r0, r0, #0
      a4:	00008b22 	andeq	r8, r0, r2, lsr #22
      a8:	04040200 	streq	r0, [r4], #-512	; 0xfffffe00
      ac:	0000648d 	andeq	r6, r0, sp, lsl #9
      b0:	8b040802 	blhi	1020c0 <_Min_Stack_Size+0x101cc0>
      b4:	07000041 	streq	r0, [r0, -r1, asr #32]
      b8:	068b0320 	streq	r0, [fp], r0, lsr #6
      bc:	08000001 	stmdaeq	r0, {r0}
      c0:	00003dfe 	strdeq	r3, [r0], -lr
      c4:	009e8c03 	addseq	r8, lr, r3, lsl #24
      c8:	23020000 	movwcs	r0, #8192	; 0x2000
      cc:	52900800 	addspl	r0, r0, #0, 16
      d0:	8d030000 	stchi	0, cr0, [r3, #-0]
      d4:	0000009e 	muleq	r0, lr, r0
      d8:	08042302 	stmdaeq	r4, {r1, r8, r9, sp}
      dc:	000000fe 	strdeq	r0, [r0], -lr
      e0:	01168e03 	tsteq	r6, r3, lsl #28
      e4:	23020000 	movwcs	r0, #8192	; 0x2000
      e8:	34250808 	strtcc	r0, [r5], #-2056	; 0xfffff7f8
      ec:	8f030000 	svchi	0x00030000
      f0:	0000009e 	muleq	r0, lr, r0
      f4:	08182302 	ldmdaeq	r8, {r1, r8, r9, sp}
      f8:	0000300b 	andeq	r3, r0, fp
      fc:	009e9003 	addseq	r9, lr, r3
     100:	23020000 	movwcs	r0, #8192	; 0x2000
     104:	9e09001c 	mcrls	0, 0, r0, cr9, cr12, {0}
     108:	16000000 	strne	r0, [r0], -r0
     10c:	0a000001 	beq	118 <_Min_Heap_Size-0xe8>
     110:	00000084 	andeq	r0, r0, r4, lsl #1
     114:	06060003 	streq	r0, [r6], -r3
     118:	03000001 	movweq	r0, #1
     11c:	00002da1 	andeq	r2, r0, r1, lsr #27
     120:	00b79103 	adcseq	r9, r7, r3, lsl #2
     124:	18070000 	stmdane	r7, {}	; <UNPREDICTABLE>
     128:	01829503 	orreq	r9, r2, r3, lsl #10
     12c:	490b0000 	stmdbmi	fp, {}	; <UNPREDICTABLE>
     130:	0300524d 	movweq	r5, #589	; 0x24d
     134:	00009e96 	muleq	r0, r6, lr
     138:	00230200 	eoreq	r0, r3, r0, lsl #4
     13c:	524d450b 	subpl	r4, sp, #46137344	; 0x2c00000
     140:	9e970300 	cdpls	3, 9, cr0, cr7, cr0, {0}
     144:	02000000 	andeq	r0, r0, #0
     148:	6c080423 	cfstrsvs	mvf0, [r8], {35}	; 0x23
     14c:	03000018 	movweq	r0, #24
     150:	00009e98 	muleq	r0, r8, lr
     154:	08230200 	stmdaeq	r3!, {r9}
     158:	000bc208 	andeq	ip, fp, r8, lsl #4
     15c:	9e990300 	cdpls	3, 9, cr0, cr9, cr0, {0}
     160:	02000000 	andeq	r0, r0, #0
     164:	f0080c23 			; <UNDEFINED> instruction: 0xf0080c23
     168:	0300004c 	movweq	r0, #76	; 0x4c
     16c:	00009e9a 	muleq	r0, sl, lr
     170:	10230200 	eorne	r0, r3, r0, lsl #4
     174:	0052500b 	subseq	r5, r2, fp
     178:	009e9b03 	addseq	r9, lr, r3, lsl #22
     17c:	23020000 	movwcs	r0, #8192	; 0x2000
     180:	6c030014 	stcvs	0, cr0, [r3], {20}
     184:	0300004a 	movweq	r0, #74	; 0x4a
     188:	0001269c 	muleq	r1, ip, r6
     18c:	031c0700 	tsteq	ip, #0, 14
     190:	0001f8a0 	andeq	pc, r1, r0, lsr #17
     194:	52430b00 	subpl	r0, r3, #0, 22
     198:	a103004c 	tstge	r3, ip, asr #32
     19c:	0000009e 	muleq	r0, lr, r0
     1a0:	0b002302 	bleq	8db0 <_Min_Stack_Size+0x89b0>
     1a4:	00485243 	subeq	r5, r8, r3, asr #4
     1a8:	009ea203 	addseq	sl, lr, r3, lsl #4
     1ac:	23020000 	movwcs	r0, #8192	; 0x2000
     1b0:	44490b04 	strbmi	r0, [r9], #-2820	; 0xfffff4fc
     1b4:	a3030052 	movwge	r0, #12370	; 0x3052
     1b8:	0000009e 	muleq	r0, lr, r0
     1bc:	0b082302 	bleq	208dcc <_Min_Stack_Size+0x2089cc>
     1c0:	0052444f 	subseq	r4, r2, pc, asr #8
     1c4:	009ea403 	addseq	sl, lr, r3, lsl #8
     1c8:	23020000 	movwcs	r0, #8192	; 0x2000
     1cc:	5d9c080c 	ldcpl	8, cr0, [ip, #48]	; 0x30
     1d0:	a5030000 	strge	r0, [r3, #-0]
     1d4:	0000009e 	muleq	r0, lr, r0
     1d8:	0b102302 	bleq	408de8 <_Min_Stack_Size+0x4089e8>
     1dc:	00525242 	subseq	r5, r2, r2, asr #4
     1e0:	009ea603 	addseq	sl, lr, r3, lsl #12
     1e4:	23020000 	movwcs	r0, #8192	; 0x2000
     1e8:	3b1b0814 	blcc	6c2240 <_Min_Stack_Size+0x6c1e40>
     1ec:	a7030000 	strge	r0, [r3, -r0]
     1f0:	0000009e 	muleq	r0, lr, r0
     1f4:	00182302 	andseq	r2, r8, r2, lsl #6
     1f8:	00304303 	eorseq	r4, r0, r3, lsl #6
     1fc:	8da80300 	stchi	3, cr0, [r8]
     200:	07000001 	streq	r0, [r0, -r1]
     204:	445f0408 	ldrbmi	r0, [pc], #-1032	; 20c <_Min_Heap_Size+0xc>
     208:	08000002 	stmdaeq	r0, {r1}
     20c:	000051dd 	ldrdeq	r5, [r0], -sp
     210:	02446004 	subeq	r6, r4, #4
     214:	23020000 	movwcs	r0, #8192	; 0x2000
     218:	3aee0800 	bcc	ffb82220 <_estack+0xdfb7d220>
     21c:	63040000 	movwvs	r0, #16384	; 0x4000
     220:	00000060 	andeq	r0, r0, r0, rrx
     224:	08042302 	stmdaeq	r4, {r1, r8, r9, sp}
     228:	000052dc 	ldrdeq	r5, [r0], -ip
     22c:	00426604 	subeq	r6, r2, r4, lsl #12
     230:	23020000 	movwcs	r0, #8192	; 0x2000
     234:	01450806 	cmpeq	r5, r6, lsl #16
     238:	69040000 	stmdbvs	r4, {}	; <UNPREDICTABLE>
     23c:	00000042 	andeq	r0, r0, r2, asr #32
     240:	00072302 	andeq	r2, r7, r2, lsl #6
     244:	01f8040c 	mvnseq	r0, ip, lsl #8
     248:	1e030000 	cdpne	0, 0, cr0, cr3, cr0, {0}
     24c:	0400002e 	streq	r0, [r0], #-46	; 0xffffffd2
     250:	0002036d 	andeq	r0, r2, sp, ror #6
     254:	050c0d00 	streq	r0, [ip, #-3328]	; 0xfffff300
     258:	027d0102 	rsbseq	r0, sp, #-2147483648	; 0x80000000
     25c:	270e0000 	strcs	r0, [lr, -r0]
     260:	0500004e 	streq	r0, [r0, #-78]	; 0xffffffb2
     264:	00420104 	subeq	r0, r2, r4, lsl #2
     268:	23020000 	movwcs	r0, #8192	; 0x2000
     26c:	48890e00 	stmmi	r9, {r9, sl, fp}
     270:	05050000 	streq	r0, [r5, #-0]
     274:	00024a01 	andeq	r4, r2, r1, lsl #20
     278:	04230200 	strteq	r0, [r3], #-512	; 0xfffffe00
     27c:	68810f00 	stmvs	r1, {r8, r9, sl, fp}
     280:	07050000 	streq	r0, [r5, -r0]
     284:	00025501 	andeq	r5, r2, r1, lsl #10
     288:	05140d00 	ldreq	r0, [r4, #-3328]	; 0xfffff300
     28c:	02cf0109 	sbceq	r0, pc, #1073741826	; 0x40000002
     290:	530e0000 	movwpl	r0, #57344	; 0xe000
     294:	05000048 	streq	r0, [r0, #-72]	; 0xffffffb8
     298:	027d010b 	rsbseq	r0, sp, #-1073741822	; 0xc0000002
     29c:	23020000 	movwcs	r0, #8192	; 0x2000
     2a0:	34e10e00 	strbtcc	r0, [r1], #3584	; 0xe00
     2a4:	0e050000 	cdpeq	0, 0, cr0, cr5, cr0, {0}
     2a8:	00004201 	andeq	r4, r0, r1, lsl #4
     2ac:	0c230200 	sfmeq	f0, 4, [r3], #-0
     2b0:	00685c0e 	rsbeq	r5, r8, lr, lsl #24
     2b4:	01110500 	tsteq	r1, r0, lsl #10
     2b8:	00000042 	andeq	r0, r0, r2, asr #32
     2bc:	0e0d2302 	cdpeq	3, 0, cr2, cr13, cr2, {0}
     2c0:	000048fc 	strdeq	r4, [r0], -ip
     2c4:	d1011505 	tstle	r1, r5, lsl #10
     2c8:	02000002 	andeq	r0, r0, #2
     2cc:	10001023 	andne	r1, r0, r3, lsr #32
     2d0:	cf040c01 	svcgt	0x00040c01
     2d4:	0f000002 	svceq	0x00000002
     2d8:	00002ec4 	andeq	r2, r0, r4, asr #29
     2dc:	89011705 	stmdbhi	r1, {r0, r2, r8, r9, sl, ip}
     2e0:	09000002 	stmdbeq	r0, {r1}
     2e4:	000002d1 	ldrdeq	r0, [r0], -r1
     2e8:	000002f3 	strdeq	r0, [r0], -r3
     2ec:	0000840a 	andeq	r8, r0, sl, lsl #8
     2f0:	11000e00 	tstne	r0, r0, lsl #28
     2f4:	000048fa 	strdeq	r4, [r0], -sl
     2f8:	02e31d01 	rsceq	r1, r3, #1, 26	; 0x40
     2fc:	03050000 	movweq	r0, #20480	; 0x5000
     300:	2000001c 	andcs	r0, r0, ip, lsl r0
     304:	61ac0112 			; <UNDEFINED> instruction: 0x61ac0112
     308:	2a010000 	bcs	40310 <_Min_Stack_Size+0x3ff10>
     30c:	06b00101 	ldrteq	r0, [r0], r1, lsl #2
     310:	07580800 	ldrbeq	r0, [r8, -r0, lsl #16]
     314:	00000800 	andeq	r0, r0, r0, lsl #16
     318:	12010000 	andne	r0, r1, #0
     31c:	0055e301 	subseq	lr, r5, r1, lsl #6
     320:	01200100 			; <UNDEFINED> instruction: 0x01200100
     324:	00060801 	andeq	r0, r6, r1, lsl #16
     328:	0006b008 	andeq	fp, r6, r8
     32c:	00002c08 	andeq	r2, r0, r8, lsl #24
     330:	01120100 	tsteq	r2, r0, lsl #2
     334:	00002bd6 	ldrdeq	r2, [r0], -r6
     338:	01011601 	tsteq	r1, r1, lsl #12
     33c:	080005e4 	stmdaeq	r0, {r2, r5, r6, r7, r8, sl}
     340:	08000608 	stmdaeq	r0, {r3, r9, sl}
     344:	00000058 	andeq	r0, r0, r8, asr r0
     348:	8c011201 	sfmhi	f1, 4, [r1], {1}
     34c:	0100005b 	qaddeq	r0, fp, r0
     350:	c001010c 	andgt	r0, r1, ip, lsl #2
     354:	e4080005 	str	r0, [r8], #-5
     358:	84080005 	strhi	r0, [r8], #-5
     35c:	01000000 	mrseq	r0, (UNDEF: 0)
     360:	46640112 			; <UNDEFINED> instruction: 0x46640112
     364:	02010000 	andeq	r0, r1, #0
     368:	059c0101 	ldreq	r0, [ip, #257]	; 0x101
     36c:	05c00800 	strbeq	r0, [r0, #2048]	; 0x800
     370:	00b00800 	adcseq	r0, r0, r0, lsl #16
     374:	13010000 	movwne	r0, #4096	; 0x1000
     378:	0060c701 	rsbeq	ip, r0, r1, lsl #14
     37c:	01f80100 	mvnseq	r0, r0, lsl #2
     380:	08000578 	stmdaeq	r0, {r3, r4, r5, r6, r8, sl}
     384:	0800059c 	stmdaeq	r0, {r2, r3, r4, r7, r8, sl}
     388:	000000dc 	ldrdeq	r0, [r0], -ip
     38c:	38011301 	stmdacc	r1, {r0, r8, r9, ip}
     390:	0100005e 	qaddeq	r0, lr, r0
     394:	055401ee 	ldrbeq	r0, [r4, #-494]	; 0xfffffe12
     398:	05780800 	ldrbeq	r0, [r8, #-2048]!	; 0xfffff800
     39c:	01080800 	tsteq	r8, r0, lsl #16
     3a0:	14010000 	strne	r0, [r1], #-0
     3a4:	005d7901 	subseq	r7, sp, r1, lsl #18
     3a8:	01d50100 	bicseq	r0, r5, r0, lsl #2
	...
     3b4:	00000134 	andeq	r0, r0, r4, lsr r1
     3b8:	60011501 	andvs	r1, r1, r1, lsl #10
     3bc:	0100001c 	tsteq	r0, ip, lsl r0
     3c0:	0384018d 	orreq	r0, r4, #1073741859	; 0x40000023
     3c4:	05540800 	ldrbeq	r0, [r4, #-2048]	; 0xfffff800
     3c8:	01780800 	cmneq	r8, r0, lsl #16
     3cc:	fe010000 	cdp2	0, 0, cr0, cr1, cr0, {0}
     3d0:	16000003 	strne	r0, [r0], -r3
     3d4:	000017e2 	andeq	r1, r0, r2, ror #15
     3d8:	03fe8d01 	mvnseq	r8, #1, 26	; 0x40
     3dc:	91020000 	mrsls	r0, (UNDEF: 2)
     3e0:	5d8a116c 	stfpls	f1, [sl, #432]	; 0x1b0
     3e4:	97010000 	strls	r0, [r1, -r0]
     3e8:	00000042 	andeq	r0, r0, r2, asr #32
     3ec:	11779102 	cmnne	r7, r2, lsl #2
     3f0:	00000f6a 	andeq	r0, r0, sl, ror #30
     3f4:	00429801 	subeq	r9, r2, r1, lsl #16
     3f8:	91020000 	mrsls	r0, (UNDEF: 2)
     3fc:	040c0076 	streq	r0, [ip], #-118	; 0xffffff8a
     400:	000002d7 	ldrdeq	r0, [r0], -r7
     404:	000f6517 	andeq	r6, pc, r7, lsl r5	; <UNPREDICTABLE>
     408:	01610100 	cmneq	r1, r0, lsl #2
     40c:	00000042 	andeq	r0, r0, r2, asr #32
     410:	08000308 	stmdaeq	r0, {r3, r8, r9}
     414:	08000384 	stmdaeq	r0, {r2, r7, r8, r9}
     418:	000001c8 	andeq	r0, r0, r8, asr #3
     41c:	00043e01 	andeq	r3, r4, r1, lsl #28
     420:	5fff1600 	svcpl	0x00ff1600
     424:	61010000 	mrsvs	r0, (UNDEF: 1)
     428:	0000004d 	andeq	r0, r0, sp, asr #32
     42c:	116f9102 	cmnne	pc, r2, lsl #2
     430:	00000f76 	andeq	r0, r0, r6, ror pc
     434:	00426301 	subeq	r6, r2, r1, lsl #6
     438:	91020000 	mrsls	r0, (UNDEF: 2)
     43c:	50180077 	andspl	r0, r8, r7, ror r0
     440:	0100004f 	tsteq	r0, pc, asr #32
     444:	023c0145 	eorseq	r0, ip, #1073741841	; 0x40000011
     448:	03080800 	movweq	r0, #34816	; 0x8800
     44c:	02240800 	eoreq	r0, r4, #0, 16
     450:	66010000 	strvs	r0, [r1], -r0
     454:	16000004 	strne	r0, [r0], -r4
     458:	00005fff 	strdeq	r5, [r0], -pc	; <UNPREDICTABLE>
     45c:	004d4501 	subeq	r4, sp, r1, lsl #10
     460:	91020000 	mrsls	r0, (UNDEF: 2)
     464:	37190077 			; <UNDEFINED> instruction: 0x37190077
     468:	0100004e 	tsteq	r0, lr, asr #32
     46c:	01700129 	cmneq	r0, r9, lsr #2
     470:	023c0800 	eorseq	r0, ip, #0, 16
     474:	02800800 	addeq	r0, r0, #0, 16
     478:	16010000 	strne	r0, [r1], -r0
     47c:	00005fff 	strdeq	r5, [r0], -pc	; <UNPREDICTABLE>
     480:	004d2901 	subeq	r2, sp, r1, lsl #18
     484:	91020000 	mrsls	r0, (UNDEF: 2)
     488:	03000077 	movweq	r0, #119	; 0x77
     48c:	02000004 	andeq	r0, r0, #4
     490:	00018800 	andeq	r8, r1, r0, lsl #16
     494:	76010400 	strvc	r0, [r1], -r0, lsl #8
     498:	0c000065 	stceq	0, cr0, [r0], {101}	; 0x65
     49c:	00006a89 	andeq	r6, r0, r9, lsl #21
     4a0:	00004d08 	andeq	r4, r0, r8, lsl #26
     4a4:	00000068 	andeq	r0, r0, r8, rrx
	...
     4b0:	00000258 	andeq	r0, r0, r8, asr r2
     4b4:	0000030b 	andeq	r0, r0, fp, lsl #6
     4b8:	74020102 	strvc	r0, [r2], #-258	; 0xfffffefe
     4bc:	0200002a 	andeq	r0, r0, #42	; 0x2a
     4c0:	04e10801 	strbteq	r0, [r1], #2049	; 0x801
     4c4:	01020000 	mrseq	r0, (UNDEF: 2)
     4c8:	0004da06 	andeq	sp, r4, r6, lsl #20
     4cc:	4fe10300 	svcmi	0x00e10300
     4d0:	14020000 	strne	r0, [r2], #-0
     4d4:	0000004d 	andeq	r0, r0, sp, asr #32
     4d8:	ac080102 	stfges	f0, [r8], {2}
     4dc:	02000048 	andeq	r0, r0, #72	; 0x48
     4e0:	060d0502 	streq	r0, [sp], -r2, lsl #10
     4e4:	4c030000 	stcmi	0, cr0, [r3], {-0}
     4e8:	02000080 	andeq	r0, r0, #128	; 0x80
     4ec:	00006616 	andeq	r6, r0, r6, lsl r6
     4f0:	07020200 	streq	r0, [r2, -r0, lsl #4]
     4f4:	000051ca 	andeq	r5, r0, sl, asr #3
     4f8:	69050404 	stmdbvs	r5, {r2, sl}
     4fc:	0300746e 	movweq	r7, #1134	; 0x46e
     500:	00000089 	andeq	r0, r0, r9, lsl #1
     504:	007f1802 	rsbseq	r1, pc, r2, lsl #16
     508:	04020000 	streq	r0, [r2], #-0
     50c:	00284007 	eoreq	r4, r8, r7
     510:	007f0500 	rsbseq	r0, pc, r0, lsl #10
     514:	08020000 	stmdaeq	r2, {}	; <UNPREDICTABLE>
     518:	0041fc05 	subeq	pc, r1, r5, lsl #24
     51c:	07080200 	streq	r0, [r8, -r0, lsl #4]
     520:	000058fe 	strdeq	r5, [r0], -lr
     524:	00008803 	andeq	r8, r0, r3, lsl #16
     528:	86220200 	strthi	r0, [r2], -r0, lsl #4
     52c:	02000000 	andeq	r0, r0, #0
     530:	648d0404 	strvs	r0, [sp], #1028	; 0x404
     534:	08020000 	stmdaeq	r2, {}	; <UNPREDICTABLE>
     538:	00418b04 	subeq	r8, r1, r4, lsl #22
     53c:	03280600 			; <UNDEFINED> instruction: 0x03280600
     540:	0001467c 	andeq	r4, r1, ip, ror r6
     544:	52430700 	subpl	r0, r3, #0, 14
     548:	997d0300 	ldmdbls	sp!, {r8, r9}^
     54c:	02000000 	andeq	r0, r0, #0
     550:	ae080023 	cdpge	0, 0, cr0, cr8, cr3, {1}
     554:	03000098 	movweq	r0, #152	; 0x98
     558:	0000997e 	andeq	r9, r0, lr, ror r9
     55c:	04230200 	strteq	r0, [r3], #-512	; 0xfffffe00
     560:	52494307 	subpl	r4, r9, #469762048	; 0x1c000000
     564:	997f0300 	ldmdbls	pc!, {r8, r9}^	; <UNPREDICTABLE>
     568:	02000000 	andeq	r0, r0, #0
     56c:	2f080823 	svccs	0x00080823
     570:	0300006a 	movweq	r0, #106	; 0x6a
     574:	00009980 	andeq	r9, r0, r0, lsl #19
     578:	0c230200 	sfmeq	f0, 4, [r3], #-0
     57c:	006a4808 	rsbeq	r4, sl, r8, lsl #16
     580:	99810300 	stmibls	r1, {r8, r9}
     584:	02000000 	andeq	r0, r0, #0
     588:	38081023 	stmdacc	r8, {r0, r1, r5, ip}
     58c:	0300006a 	movweq	r0, #106	; 0x6a
     590:	00009982 	andeq	r9, r0, r2, lsl #19
     594:	14230200 	strtne	r0, [r3], #-512	; 0xfffffe00
     598:	006af308 	rsbeq	pc, sl, r8, lsl #6
     59c:	99830300 	stmibls	r3, {r8, r9}
     5a0:	02000000 	andeq	r0, r0, #0
     5a4:	0b081823 	bleq	206638 <_Min_Stack_Size+0x206238>
     5a8:	0300006a 	movweq	r0, #106	; 0x6a
     5ac:	00009984 	andeq	r9, r0, r4, lsl #19
     5b0:	1c230200 	sfmne	f0, 4, [r3], #-0
     5b4:	006a0608 	rsbeq	r0, sl, r8, lsl #12
     5b8:	99850300 	stmibls	r5, {r8, r9}
     5bc:	02000000 	andeq	r0, r0, #0
     5c0:	43072023 	movwmi	r2, #28707	; 0x7023
     5c4:	03005253 	movweq	r5, #595	; 0x253
     5c8:	00009986 	andeq	r9, r0, r6, lsl #19
     5cc:	24230200 	strtcs	r0, [r3], #-512	; 0xfffffe00
     5d0:	6a230300 	bvs	8c11d8 <_Min_Stack_Size+0x8c0dd8>
     5d4:	87030000 	strhi	r0, [r3, -r0]
     5d8:	000000b2 	strheq	r0, [r0], -r2
     5dc:	a0031c06 	andge	r1, r3, r6, lsl #24
     5e0:	000001bc 			; <UNDEFINED> instruction: 0x000001bc
     5e4:	4c524307 	mrrcmi	3, 0, r4, r2, cr7
     5e8:	99a10300 	stmibls	r1!, {r8, r9}
     5ec:	02000000 	andeq	r0, r0, #0
     5f0:	43070023 	movwmi	r0, #28707	; 0x7023
     5f4:	03004852 	movweq	r4, #2130	; 0x852
     5f8:	000099a2 	andeq	r9, r0, r2, lsr #19
     5fc:	04230200 	strteq	r0, [r3], #-512	; 0xfffffe00
     600:	52444907 	subpl	r4, r4, #114688	; 0x1c000
     604:	99a30300 	stmibls	r3!, {r8, r9}
     608:	02000000 	andeq	r0, r0, #0
     60c:	4f070823 	svcmi	0x00070823
     610:	03005244 	movweq	r5, #580	; 0x244
     614:	000099a4 	andeq	r9, r0, r4, lsr #19
     618:	0c230200 	sfmeq	f0, 4, [r3], #-0
     61c:	005d9c08 	subseq	r9, sp, r8, lsl #24
     620:	99a50300 	stmibls	r5!, {r8, r9}
     624:	02000000 	andeq	r0, r0, #0
     628:	42071023 	andmi	r1, r7, #35	; 0x23
     62c:	03005252 	movweq	r5, #594	; 0x252
     630:	000099a6 	andeq	r9, r0, r6, lsr #19
     634:	14230200 	strtne	r0, [r3], #-512	; 0xfffffe00
     638:	003b1b08 	eorseq	r1, fp, r8, lsl #22
     63c:	99a70300 	stmibls	r7!, {r8, r9}
     640:	02000000 	andeq	r0, r0, #0
     644:	03001823 	movweq	r1, #2083	; 0x823
     648:	00003043 	andeq	r3, r0, r3, asr #32
     64c:	0151a803 	cmpeq	r1, r3, lsl #16
     650:	08060000 	stmdaeq	r6, {}	; <UNPREDICTABLE>
     654:	02085f04 	andeq	r5, r8, #4, 30
     658:	dd080000 	stcle	0, cr0, [r8, #-0]
     65c:	04000051 	streq	r0, [r0], #-81	; 0xffffffaf
     660:	00020860 	andeq	r0, r2, r0, ror #16
     664:	00230200 	eoreq	r0, r3, r0, lsl #4
     668:	003aee08 	eorseq	lr, sl, r8, lsl #28
     66c:	5b630400 	blpl	18c1674 <_Min_Stack_Size+0x18c1274>
     670:	02000000 	andeq	r0, r0, #0
     674:	dc080423 	cfstrsle	mvf0, [r8], {35}	; 0x23
     678:	04000052 	streq	r0, [r0], #-82	; 0xffffffae
     67c:	00004266 	andeq	r4, r0, r6, ror #4
     680:	06230200 	strteq	r0, [r3], -r0, lsl #4
     684:	00014508 	andeq	r4, r1, r8, lsl #10
     688:	42690400 	rsbmi	r0, r9, #0, 8
     68c:	02000000 	andeq	r0, r0, #0
     690:	09000723 	stmdbeq	r0, {r0, r1, r5, r8, r9, sl}
     694:	0001bc04 	andeq	fp, r1, r4, lsl #24
     698:	2e1e0300 	cdpcs	3, 1, cr0, cr14, cr0, {0}
     69c:	6d040000 	stcvs	0, cr0, [r4, #-0]
     6a0:	000001c7 	andeq	r0, r0, r7, asr #3
     6a4:	6ab4010a 	bvs	fed00ad4 <_estack+0xdecfbad4>
     6a8:	73010000 	movwvc	r0, #4096	; 0x1000
     6ac:	00420101 	subeq	r0, r2, r1, lsl #2
	...
     6b8:	02dc0000 	sbcseq	r0, ip, #0
     6bc:	48010000 	stmdami	r1, {}	; <UNPREDICTABLE>
     6c0:	0b000002 	bleq	6d0 <_Min_Stack_Size+0x2d0>
     6c4:	00006a64 	andeq	r6, r0, r4, ror #20
     6c8:	48017301 	stmdami	r1, {r0, r8, r9, ip, sp, lr}
     6cc:	02000002 	andeq	r0, r0, #2
     6d0:	09007491 	stmdbeq	r0, {r0, r4, r7, sl, ip, sp, lr}
     6d4:	00020e04 	andeq	r0, r2, r4, lsl #28
     6d8:	fb010c00 	blx	436e2 <_Min_Stack_Size+0x432e2>
     6dc:	0100006a 	tsteq	r0, sl, rrx
     6e0:	0001015e 	andeq	r0, r1, lr, asr r1
     6e4:	00000000 	andeq	r0, r0, r0
     6e8:	38000000 	stmdacc	r0, {}	; <UNPREDICTABLE>
     6ec:	01000003 	tsteq	r0, r3
     6f0:	00000279 	andeq	r0, r0, r9, ror r2
     6f4:	006a640b 	rsbeq	r6, sl, fp, lsl #8
     6f8:	015e0100 	cmpeq	lr, r0, lsl #2
     6fc:	00000248 	andeq	r0, r0, r8, asr #4
     700:	00749102 	rsbseq	r9, r4, r2, lsl #2
     704:	6b42010c 	blvs	1080b3c <_Min_Stack_Size+0x108073c>
     708:	4a010000 	bmi	40710 <_Min_Stack_Size+0x40310>
     70c:	00000101 	andeq	r0, r0, r1, lsl #2
     710:	00000000 	andeq	r0, r0, r0
     714:	03940000 	orrseq	r0, r4, #0
     718:	b3010000 	movwlt	r0, #4096	; 0x1000
     71c:	0b000002 	bleq	72c <_Min_Stack_Size+0x32c>
     720:	00006a98 	muleq	r0, r8, sl
     724:	08014a01 	stmdaeq	r1, {r0, r9, fp, lr}
     728:	02000002 	andeq	r0, r0, #2
     72c:	d80b7491 	stmdale	fp, {r0, r4, r7, sl, ip, sp, lr}
     730:	0100006a 	tsteq	r0, sl, rrx
     734:	005b014a 	subseq	r0, fp, sl, asr #2
     738:	91020000 	mrsls	r0, (UNDEF: 2)
     73c:	010c0072 	tsteq	ip, r2, ror r0
     740:	00006a76 	andeq	r6, r0, r6, ror sl
     744:	01012a01 	tsteq	r1, r1, lsl #20
	...
     750:	000003f0 	strdeq	r0, [r0], -r0	; <UNPREDICTABLE>
     754:	0002ed01 	andeq	lr, r2, r1, lsl #26
     758:	6a640b00 	bvs	1903360 <_Min_Stack_Size+0x1902f60>
     75c:	2a010000 	bcs	40764 <_Min_Stack_Size+0x40364>
     760:	00024801 	andeq	r4, r2, r1, lsl #16
     764:	74910200 	ldrvc	r0, [r1], #512	; 0x200
     768:	006a3f0b 	rsbeq	r3, sl, fp, lsl #30
     76c:	012a0100 			; <UNDEFINED> instruction: 0x012a0100
     770:	00000042 	andeq	r0, r0, r2, asr #32
     774:	00739102 	rsbseq	r9, r3, r2, lsl #2
     778:	6b0f010a 	blvs	3c0ba8 <_Min_Stack_Size+0x3c07a8>
     77c:	13010000 	movwne	r0, #4096	; 0x1000
     780:	005b0101 	subseq	r0, fp, r1, lsl #2
	...
     78c:	044c0000 	strbeq	r0, [ip], #-0
     790:	1c010000 	stcne	0, cr0, [r1], {-0}
     794:	0b000003 	bleq	7a8 <_Min_Stack_Size+0x3a8>
     798:	00006a98 	muleq	r0, r8, sl
     79c:	08011301 	stmdaeq	r1, {r0, r8, r9, ip}
     7a0:	02000002 	andeq	r0, r0, #2
     7a4:	0d007491 	cfstrseq	mvf7, [r0, #-580]	; 0xfffffdbc
     7a8:	006aa201 	rsbeq	sl, sl, r1, lsl #4
     7ac:	01f70100 	mvnseq	r0, r0, lsl #2
     7b0:	00000042 	andeq	r0, r0, r2, asr #32
	...
     7bc:	000004a8 	andeq	r0, r0, r8, lsr #9
     7c0:	00034901 	andeq	r4, r3, r1, lsl #18
     7c4:	6a640e00 	bvs	1903fcc <_Min_Stack_Size+0x1903bcc>
