mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
     7c8:	f7010000 			; <UNDEFINED> instruction: 0xf7010000
     7cc:	00000248 	andeq	r0, r0, r8, asr #4
     7d0:	00749102 	rsbseq	r9, r4, r2, lsl #2
     7d4:	6b31010f 	blvs	c40c18 <_Min_Stack_Size+0xc40818>
     7d8:	c8010000 	stmdagt	r1, {}	; <UNPREDICTABLE>
     7dc:	00000001 	andeq	r0, r0, r1
     7e0:	00000000 	andeq	r0, r0, r0
     7e4:	00050400 	andeq	r0, r5, r0, lsl #8
     7e8:	03720100 	cmneq	r2, #0, 2
     7ec:	980e0000 	stmdals	lr, {}	; <UNPREDICTABLE>
     7f0:	0100006a 	tsteq	r0, sl, rrx
     7f4:	000208c8 	andeq	r0, r2, r8, asr #17
     7f8:	74910200 	ldrvc	r0, [r1], #512	; 0x200
     7fc:	22011000 	andcs	r1, r1, #0
     800:	0100006b 	tsteq	r0, fp, rrx
     804:	08200153 	stmdaeq	r0!, {r0, r1, r4, r6, r8}
     808:	0a3c0800 	beq	f02810 <_Min_Stack_Size+0xf02410>
     80c:	05600800 	strbeq	r0, [r0, #-2048]!	; 0xfffff800
     810:	c8010000 	stmdagt	r1, {}	; <UNPREDICTABLE>
     814:	0e000003 	cdpeq	0, 0, cr0, cr0, cr3, {0}
     818:	00006a64 	andeq	r6, r0, r4, ror #20
     81c:	02485301 	subeq	r5, r8, #67108864	; 0x4000000
     820:	91020000 	mrsls	r0, (UNDEF: 2)
     824:	6ac61164 	bvs	ff184dbc <_estack+0xdf17fdbc>
     828:	54010000 	strpl	r0, [r1], #-0
     82c:	000003c8 	andeq	r0, r0, r8, asr #7
     830:	00580305 	subseq	r0, r8, r5, lsl #6
     834:	51112000 	tstpl	r1, r0
     838:	0100006a 	tsteq	r0, sl, rrx
     83c:	0003d878 	andeq	sp, r3, r8, ror r8
     840:	68910200 	ldmvs	r1, {r9}
     844:	006a1311 	rsbeq	r1, sl, r1, lsl r3
     848:	427c0100 	rsbsmi	r0, ip, #0, 2
     84c:	02000000 	andeq	r0, r0, #0
     850:	12006f91 	andne	r6, r0, #580	; 0x244
     854:	00000042 	andeq	r0, r0, r2, asr #32
     858:	000003d8 	ldrdeq	r0, [r0], -r8
     85c:	00007f13 	andeq	r7, r0, r3, lsl pc
     860:	09000500 	stmdbeq	r0, {r8, sl}
     864:	00009904 	andeq	r9, r0, r4, lsl #18
     868:	6ae21400 	bvs	ff885870 <_estack+0xdf880870>
     86c:	18010000 	stmdane	r1, {}	; <UNPREDICTABLE>
     870:	00004201 	andeq	r4, r0, r1, lsl #4
     874:	00075800 	andeq	r5, r7, r0, lsl #16
     878:	00081e08 	andeq	r1, r8, r8, lsl #28
     87c:	0005b008 	andeq	fp, r5, r8
     880:	5a0e0100 	bpl	380c88 <_Min_Stack_Size+0x380888>
     884:	0100006a 	tsteq	r0, sl, rrx
     888:	00005b18 	andeq	r5, r0, r8, lsl fp
     88c:	76910200 	ldrvc	r0, [r1], r0, lsl #4
     890:	0b2a0000 	bleq	a80898 <_Min_Stack_Size+0xa80498>
     894:	00020000 	andeq	r0, r2, r0
     898:	000002dc 	ldrdeq	r0, [r0], -ip
     89c:	65760104 	ldrbvs	r0, [r6, #-260]!	; 0xfffffefc
     8a0:	f50c0000 			; <UNDEFINED> instruction: 0xf50c0000
     8a4:	0800006c 	stmdaeq	r0, {r2, r3, r5, r6}
     8a8:	b800004d 	stmdalt	r0, {r0, r2, r3, r6}
	...
     8b4:	60000000 	andvs	r0, r0, r0
     8b8:	50000004 	andpl	r0, r0, r4
     8bc:	02000003 	andeq	r0, r0, #3
     8c0:	2a740201 	bcs	1d010cc <_Min_Stack_Size+0x1d00ccc>
     8c4:	01020000 	mrseq	r0, (UNDEF: 2)
     8c8:	0004e108 	andeq	lr, r4, r8, lsl #2
     8cc:	06010200 	streq	r0, [r1], -r0, lsl #4
     8d0:	000004da 	ldrdeq	r0, [r0], -sl
     8d4:	004fe103 	subeq	lr, pc, r3, lsl #2
     8d8:	4d140200 	lfmmi	f0, 4, [r4, #-0]
     8dc:	02000000 	andeq	r0, r0, #0
     8e0:	48ac0801 	stmiami	ip!, {r0, fp}
     8e4:	02020000 	andeq	r0, r2, #0
     8e8:	00060d05 	andeq	r0, r6, r5, lsl #26
     8ec:	804c0300 	subhi	r0, ip, r0, lsl #6
     8f0:	16020000 	strne	r0, [r2], -r0
     8f4:	00000066 	andeq	r0, r0, r6, rrx
     8f8:	ca070202 	bgt	1c1108 <_Min_Stack_Size+0x1c0d08>
     8fc:	04000051 	streq	r0, [r0], #-81	; 0xffffffaf
     900:	00000066 	andeq	r0, r0, r6, rrx
     904:	69050405 	stmdbvs	r5, {r0, r2, sl}
     908:	0300746e 	movweq	r7, #1134	; 0x46e
     90c:	00000089 	andeq	r0, r0, r9, lsl #1
     910:	00841802 	addeq	r1, r4, r2, lsl #16
     914:	04020000 	streq	r0, [r2], #-0
     918:	00284007 	eoreq	r4, r8, r7
     91c:	00840400 	addeq	r0, r4, r0, lsl #8
     920:	08020000 	stmdaeq	r2, {}	; <UNPREDICTABLE>
     924:	0041fc05 	subeq	pc, r1, r5, lsl #24
     928:	07080200 	streq	r0, [r8, -r0, lsl #4]
     92c:	000058fe 	strdeq	r5, [r0], -lr
     930:	00804b03 	addeq	r4, r0, r3, lsl #22
     934:	6d200200 	sfmvs	f0, 4, [r0, #-0]
     938:	03000000 	movweq	r0, #0
     93c:	00000088 	andeq	r0, r0, r8, lsl #1
     940:	008b2202 	addeq	r2, fp, r2, lsl #4
     944:	04020000 	streq	r0, [r2], #-0
     948:	00648d04 	rsbeq	r8, r4, r4, lsl #26
     94c:	04080200 	streq	r0, [r8], #-512	; 0xfffffe00
     950:	0000418b 	andeq	r4, r0, fp, lsl #3
     954:	7c032806 	stcvc	8, cr2, [r3], {6}
     958:	00000156 	andeq	r0, r0, r6, asr r1
     95c:	00524307 	subseq	r4, r2, r7, lsl #6
     960:	00a97d03 	adceq	r7, r9, r3, lsl #26
     964:	23020000 	movwcs	r0, #8192	; 0x2000
     968:	98ae0800 	stmials	lr!, {fp}
     96c:	7e030000 	cdpvc	0, 0, cr0, cr3, cr0, {0}
     970:	000000a9 	andeq	r0, r0, r9, lsr #1
     974:	07042302 	streq	r2, [r4, -r2, lsl #6]
     978:	00524943 	subseq	r4, r2, r3, asr #18
     97c:	00a97f03 	adceq	r7, r9, r3, lsl #30
     980:	23020000 	movwcs	r0, #8192	; 0x2000
     984:	6a2f0808 	bvs	bc29ac <_Min_Stack_Size+0xbc25ac>
     988:	80030000 	andhi	r0, r3, r0
     98c:	000000a9 	andeq	r0, r0, r9, lsr #1
     990:	080c2302 	stmdaeq	ip, {r1, r8, r9, sp}
     994:	00006a48 	andeq	r6, r0, r8, asr #20
     998:	00a98103 	adceq	r8, r9, r3, lsl #2
     99c:	23020000 	movwcs	r0, #8192	; 0x2000
     9a0:	6a380810 	bvs	e029e8 <_Min_Stack_Size+0xe025e8>
     9a4:	82030000 	andhi	r0, r3, #0
     9a8:	000000a9 	andeq	r0, r0, r9, lsr #1
     9ac:	08142302 	ldmdaeq	r4, {r1, r8, r9, sp}
     9b0:	00006af3 	strdeq	r6, [r0], -r3
     9b4:	00a98303 	adceq	r8, r9, r3, lsl #6
     9b8:	23020000 	movwcs	r0, #8192	; 0x2000
     9bc:	6a0b0818 	bvs	2c2a24 <_Min_Stack_Size+0x2c2624>
     9c0:	84030000 	strhi	r0, [r3], #-0
     9c4:	000000a9 	andeq	r0, r0, r9, lsr #1
     9c8:	081c2302 	ldmdaeq	ip, {r1, r8, r9, sp}
     9cc:	00006a06 	andeq	r6, r0, r6, lsl #20
     9d0:	00a98503 	adceq	r8, r9, r3, lsl #10
     9d4:	23020000 	movwcs	r0, #8192	; 0x2000
     9d8:	53430720 	movtpl	r0, #14112	; 0x3720
     9dc:	86030052 			; <UNDEFINED> instruction: 0x86030052
     9e0:	000000a9 	andeq	r0, r0, r9, lsr #1
     9e4:	00242302 	eoreq	r2, r4, r2, lsl #6
     9e8:	006a2303 	rsbeq	r2, sl, r3, lsl #6
     9ec:	c2870300 	addgt	r0, r7, #0, 6
     9f0:	09000000 	stmdbeq	r0, {}	; <UNPREDICTABLE>
     9f4:	000000a9 	andeq	r0, r0, r9, lsr #1
     9f8:	00000171 	andeq	r0, r0, r1, ror r1
     9fc:	0000840a 	andeq	r8, r0, sl, lsl #8
     a00:	04000300 	streq	r0, [r0], #-768	; 0xfffffd00
     a04:	00000161 	andeq	r0, r0, r1, ror #2
     a08:	a0031c06 	andge	r1, r3, r6, lsl #24
     a0c:	000001e1 	andeq	r0, r0, r1, ror #3
     a10:	4c524307 	mrrcmi	3, 0, r4, r2, cr7
     a14:	a9a10300 	stmibge	r1!, {r8, r9}
     a18:	02000000 	andeq	r0, r0, #0
     a1c:	43070023 	movwmi	r0, #28707	; 0x7023
     a20:	03004852 	movweq	r4, #2130	; 0x852
     a24:	0000a9a2 	andeq	sl, r0, r2, lsr #19
     a28:	04230200 	strteq	r0, [r3], #-512	; 0xfffffe00
     a2c:	52444907 	subpl	r4, r4, #114688	; 0x1c000
     a30:	a9a30300 	stmibge	r3!, {r8, r9}
     a34:	02000000 	andeq	r0, r0, #0
     a38:	4f070823 	svcmi	0x00070823
     a3c:	03005244 	movweq	r5, #580	; 0x244
     a40:	0000a9a4 	andeq	sl, r0, r4, lsr #19
     a44:	0c230200 	sfmeq	f0, 4, [r3], #-0
     a48:	005d9c08 	subseq	r9, sp, r8, lsl #24
     a4c:	a9a50300 	stmibge	r5!, {r8, r9}
     a50:	02000000 	andeq	r0, r0, #0
     a54:	42071023 	andmi	r1, r7, #35	; 0x23
     a58:	03005252 	movweq	r5, #594	; 0x252
     a5c:	0000a9a6 	andeq	sl, r0, r6, lsr #19
     a60:	14230200 	strtne	r0, [r3], #-512	; 0xfffffe00
     a64:	003b1b08 	eorseq	r1, fp, r8, lsl #22
     a68:	a9a70300 	stmibge	r7!, {r8, r9}
     a6c:	02000000 	andeq	r0, r0, #0
     a70:	03001823 	movweq	r1, #2083	; 0x823
     a74:	00003043 	andeq	r3, r0, r3, asr #32
     a78:	0176a803 	cmneq	r6, r3, lsl #16
     a7c:	50060000 	andpl	r0, r6, r0
     a80:	02d4ac03 	sbcseq	sl, r4, #768	; 0x300
     a84:	43070000 	movwmi	r0, #28672	; 0x7000
     a88:	03003152 	movweq	r3, #338	; 0x152
     a8c:	0000a9ad 	andeq	sl, r0, sp, lsr #19
     a90:	00230200 	eoreq	r0, r3, r0, lsl #4
     a94:	32524307 	subscc	r4, r2, #469762048	; 0x1c000000
     a98:	a9ae0300 	stmibge	lr!, {r8, r9}
     a9c:	02000000 	andeq	r0, r0, #0
     aa0:	35080423 	strcc	r0, [r8, #-1059]	; 0xfffffbdd
     aa4:	03000082 	movweq	r0, #130	; 0x82
     aa8:	0000a9af 	andeq	sl, r0, pc, lsr #19
     aac:	08230200 	stmdaeq	r3!, {r9}
     ab0:	0078b908 	rsbseq	fp, r8, r8, lsl #18
     ab4:	a9b00300 	ldmibge	r0!, {r8, r9}
     ab8:	02000000 	andeq	r0, r0, #0
     abc:	53070c23 	movwpl	r0, #31779	; 0x7c23
     ac0:	b1030052 	qaddlt	r0, r2, r3
     ac4:	000000a9 	andeq	r0, r0, r9, lsr #1
     ac8:	07102302 	ldreq	r2, [r0, -r2, lsl #6]
     acc:	00524745 	subseq	r4, r2, r5, asr #14
     ad0:	00a9b203 	adceq	fp, r9, r3, lsl #4
     ad4:	23020000 	movwcs	r0, #8192	; 0x2000
     ad8:	6dae0814 	stcvs	8, cr0, [lr, #80]!	; 0x50
     adc:	b3030000 	movwlt	r0, #12288	; 0x3000
     ae0:	000002e4 	andeq	r0, r0, r4, ror #5
     ae4:	08182302 	ldmdaeq	r8, {r1, r8, r9, sp}
     ae8:	00006da4 	andeq	r6, r0, r4, lsr #27
     aec:	00a9b403 	adceq	fp, r9, r3, lsl #8
     af0:	23020000 	movwcs	r0, #8192	; 0x2000
     af4:	4e430720 	cdpmi	7, 4, cr0, cr3, cr0, {1}
     af8:	b5030054 	strlt	r0, [r3, #-84]	; 0xffffffac
     afc:	000000a9 	andeq	r0, r0, r9, lsr #1
     b00:	07242302 	streq	r2, [r4, -r2, lsl #6]!
     b04:	00435350 	subeq	r5, r3, r0, asr r3
     b08:	00a9b603 	adceq	fp, r9, r3, lsl #12
     b0c:	23020000 	movwcs	r0, #8192	; 0x2000
     b10:	52410728 	subpl	r0, r1, #40, 14	; 0xa00000
     b14:	b7030052 	smlsdlt	r3, r2, r0, r0
     b18:	000000a9 	andeq	r0, r0, r9, lsr #1
     b1c:	082c2302 	stmdaeq	ip!, {r1, r8, r9, sp}
     b20:	000089d1 	ldrdeq	r8, [r0], -r1
     b24:	00a9b803 	adceq	fp, r9, r3, lsl #16
     b28:	23020000 	movwcs	r0, #8192	; 0x2000
     b2c:	43430730 	movtmi	r0, #14128	; 0x3730
     b30:	b9030052 	stmdblt	r3, {r1, r4, r6}
     b34:	00000171 	andeq	r0, r0, r1, ror r1
     b38:	08342302 	ldmdaeq	r4!, {r1, r8, r9, sp}
     b3c:	000089e4 	andeq	r8, r0, r4, ror #19
     b40:	00a9ba03 	adceq	fp, r9, r3, lsl #20
     b44:	23020000 	movwcs	r0, #8192	; 0x2000
     b48:	43440744 	movtmi	r0, #18244	; 0x4744
     b4c:	bb030052 	bllt	c0c9c <_Min_Stack_Size+0xc089c>
     b50:	000000a9 	andeq	r0, r0, r9, lsr #1
     b54:	08482302 	stmdaeq	r8, {r1, r8, r9, sp}^
     b58:	00006d9a 	muleq	r0, sl, sp
     b5c:	00a9bc03 	adceq	fp, r9, r3, lsl #24
     b60:	23020000 	movwcs	r0, #8192	; 0x2000
     b64:	a909004c 	stmdbge	r9, {r2, r3, r6}
     b68:	e4000000 	str	r0, [r0], #-0
     b6c:	0a000002 	beq	b7c <_Min_Stack_Size+0x77c>
     b70:	00000084 	andeq	r0, r0, r4, lsl #1
     b74:	d4040001 	strle	r0, [r4], #-1
     b78:	03000002 	movweq	r0, #2
     b7c:	000078be 			; <UNDEFINED> instruction: 0x000078be
     b80:	01ecbd03 	mvneq	fp, r3, lsl #26
     b84:	08060000 	stmdaeq	r6, {}	; <UNPREDICTABLE>
     b88:	03355f04 	teqeq	r5, #4, 30
     b8c:	dd080000 	stcle	0, cr0, [r8, #-0]
     b90:	04000051 	streq	r0, [r0], #-81	; 0xffffffaf
     b94:	00033560 	andeq	r3, r3, r0, ror #10
     b98:	00230200 	eoreq	r0, r3, r0, lsl #4
     b9c:	003aee08 	eorseq	lr, sl, r8, lsl #28
     ba0:	5b630400 	blpl	18c1ba8 <_Min_Stack_Size+0x18c17a8>
     ba4:	02000000 	andeq	r0, r0, #0
     ba8:	dc080423 	cfstrsle	mvf0, [r8], {35}	; 0x23
     bac:	04000052 	streq	r0, [r0], #-82	; 0xffffffae
     bb0:	00004266 	andeq	r4, r0, r6, ror #4
     bb4:	06230200 	strteq	r0, [r3], -r0, lsl #4
     bb8:	00014508 	andeq	r4, r1, r8, lsl #10
     bbc:	42690400 	rsbmi	r0, r9, #0, 8
     bc0:	02000000 	andeq	r0, r0, #0
     bc4:	0b000723 	bleq	2858 <_Min_Stack_Size+0x2458>
     bc8:	0001e104 	andeq	lr, r1, r4, lsl #2
     bcc:	2e1e0300 	cdpcs	3, 1, cr0, cr14, cr0, {0}
     bd0:	6d040000 	stcvs	0, cr0, [r4, #-0]
     bd4:	000002f4 	strdeq	r0, [r0], -r4
     bd8:	33050806 	movwcc	r0, #22534	; 0x5806
     bdc:	00000387 	andeq	r0, r0, r7, lsl #7
     be0:	006d2308 	rsbeq	r2, sp, r8, lsl #6
     be4:	5b350500 	blpl	d41fec <_Min_Stack_Size+0xd41bec>
     be8:	02000000 	andeq	r0, r0, #0
     bec:	2b080023 	blcs	200c80 <_Min_Stack_Size+0x200880>
     bf0:	05000077 	streq	r0, [r0, #-119]	; 0xffffff89
     bf4:	00005b36 	andeq	r5, r0, r6, lsr fp
     bf8:	02230200 	eoreq	r0, r3, #0, 4
     bfc:	006cdb08 	rsbeq	sp, ip, r8, lsl #22
     c00:	5b370500 	blpl	dc2008 <_Min_Stack_Size+0xdc1c08>
     c04:	02000000 	andeq	r0, r0, #0
     c08:	58080423 	stmdapl	r8, {r0, r1, r5, sl}
     c0c:	0500007b 	streq	r0, [r0, #-123]	; 0xffffff85
     c10:	00005b38 	andeq	r5, r0, r8, lsr fp
     c14:	06230200 	strteq	r0, [r3], -r0, lsl #4
     c18:	72700300 	rsbsvc	r0, r0, #0, 6
     c1c:	3a050000 	bcc	140c24 <_Min_Stack_Size+0x140824>
     c20:	00000346 	andeq	r0, r0, r6, asr #6
     c24:	3c050c06 	stccc	12, cr0, [r5], {6}
     c28:	000003ef 	andeq	r0, r0, pc, ror #7
     c2c:	0076e008 	rsbseq	lr, r6, r8
     c30:	423e0500 	eorsmi	r0, lr, #0, 10
     c34:	02000000 	andeq	r0, r0, #0
     c38:	1e080023 	cdpne	0, 0, cr0, cr8, cr3, {1}
     c3c:	05000077 	streq	r0, [r0, #-119]	; 0xffffff89
     c40:	00005b3f 	andeq	r5, r0, pc, lsr fp
     c44:	02230200 	eoreq	r0, r3, #0, 4
     c48:	006db308 	rsbeq	fp, sp, r8, lsl #6
     c4c:	5b400500 	blpl	1002054 <_Min_Stack_Size+0x1001c54>
     c50:	02000000 	andeq	r0, r0, #0
     c54:	23080423 	movwcs	r0, #33827	; 0x8423
     c58:	05000076 	streq	r0, [r0, #-118]	; 0xffffff8a
     c5c:	00005b41 	andeq	r5, r0, r1, asr #22
     c60:	06230200 	strteq	r0, [r3], -r0, lsl #4
     c64:	007a6108 	rsbseq	r6, sl, r8, lsl #2
     c68:	5b420500 	blpl	1082070 <_Min_Stack_Size+0x1081c70>
     c6c:	02000000 	andeq	r0, r0, #0
     c70:	68080823 	stmdavs	r8, {r0, r1, r5, fp}
     c74:	0500007d 	streq	r0, [r0, #-125]	; 0xffffff83
     c78:	00005b43 	andeq	r5, r0, r3, asr #22
     c7c:	0a230200 	beq	8c1484 <_Min_Stack_Size+0x8c1084>
     c80:	73b30300 			; <UNDEFINED> instruction: 0x73b30300
     c84:	45050000 	strmi	r0, [r5, #-0]
     c88:	00000392 	muleq	r0, r2, r3
     c8c:	47051006 	strmi	r1, [r5, -r6]
     c90:	00000473 	andeq	r0, r0, r3, ror r4
     c94:	0076e008 	rsbseq	lr, r6, r8
     c98:	42490500 	submi	r0, r9, #0, 10
     c9c:	02000000 	andeq	r0, r0, #0
     ca0:	1e080023 	cdpne	0, 0, cr0, cr8, cr3, {1}
     ca4:	05000077 	streq	r0, [r0, #-119]	; 0xffffff89
     ca8:	00005b4a 	andeq	r5, r0, sl, asr #22
     cac:	02230200 	eoreq	r0, r3, #0, 4
     cb0:	006f3a08 	rsbeq	r3, pc, r8, lsl #20
     cb4:	5b4b0500 	blpl	12c20bc <_Min_Stack_Size+0x12c1cbc>
     cb8:	02000000 	andeq	r0, r0, #0
     cbc:	77080423 	strvc	r0, [r8, -r3, lsr #8]
     cc0:	05000074 	streq	r0, [r0, #-116]	; 0xffffff8c
     cc4:	00005b4c 	andeq	r5, r0, ip, asr #22
     cc8:	06230200 	strteq	r0, [r3], -r0, lsl #4
     ccc:	006c9108 	rsbeq	r9, ip, r8, lsl #2
     cd0:	5b4d0500 	blpl	13420d8 <_Min_Stack_Size+0x1341cd8>
     cd4:	02000000 	andeq	r0, r0, #0
     cd8:	cf080823 	svcgt	0x00080823
     cdc:	05000073 	streq	r0, [r0, #-115]	; 0xffffff8d
     ce0:	00005b4e 	andeq	r5, r0, lr, asr #22
     ce4:	0a230200 	beq	8c14ec <_Min_Stack_Size+0x8c10ec>
     ce8:	007bfa08 	rsbseq	pc, fp, r8, lsl #20
     cec:	5b4f0500 	blpl	13c20f4 <_Min_Stack_Size+0x13c1cf4>
     cf0:	02000000 	andeq	r0, r0, #0
     cf4:	16080c23 	strne	r0, [r8], -r3, lsr #24
     cf8:	0500006d 	streq	r0, [r0, #-109]	; 0xffffff93
     cfc:	00005b50 	andeq	r5, r0, r0, asr fp
     d00:	0e230200 	cdpeq	2, 2, cr0, cr3, cr0, {0}
     d04:	6d440300 	stclvs	3, cr0, [r4, #-0]
     d08:	52050000 	andpl	r0, r5, #0
     d0c:	000003fa 	strdeq	r0, [r0], -sl
     d10:	59059006 	stmdbpl	r5, {r1, r2, ip, pc}
     d14:	00000544 	andeq	r0, r0, r4, asr #10
     d18:	00802808 	addeq	r2, r0, r8, lsl #16
     d1c:	445b0500 	ldrbmi	r0, [fp], #-1280	; 0xfffffb00
     d20:	02000005 	andeq	r0, r0, #5
     d24:	1b080023 	blne	200db8 <_Min_Stack_Size+0x2009b8>
     d28:	05000082 	streq	r0, [r0, #-130]	; 0xffffff7e
     d2c:	0003875f 	andeq	r8, r3, pc, asr r7
     d30:	04230200 	strteq	r0, [r3], #-512	; 0xfffffe00
     d34:	00780008 	rsbseq	r0, r8, r8
     d38:	4a620500 	bmi	1882140 <_Min_Stack_Size+0x1881d40>
     d3c:	02000005 	andeq	r0, r0, #5
     d40:	d7080c23 	strle	r0, [r8, -r3, lsr #24]
     d44:	05000075 	streq	r0, [r0, #-117]	; 0xffffff8b
     d48:	00055a65 	andeq	r5, r5, r5, ror #20
     d4c:	3c230200 	sfmcc	f0, 4, [r3], #-0
     d50:	006fb508 	rsbeq	fp, pc, r8, lsl #10
     d54:	5b680500 	blpl	1a0215c <_Min_Stack_Size+0x1a01d5c>
     d58:	02000000 	andeq	r0, r0, #0
     d5c:	4e087c23 	cdpmi	12, 0, cr7, cr8, cr3, {1}
     d60:	05000082 	streq	r0, [r0, #-130]	; 0xffffff7e
     d64:	00005b6b 	andeq	r5, r0, fp, ror #22
     d68:	7e230200 	cdpvc	2, 2, cr0, cr3, cr0, {0}
     d6c:	00793608 	rsbseq	r3, r9, r8, lsl #12
     d70:	5b6e0500 	blpl	1b82178 <_Min_Stack_Size+0x1b81d78>
     d74:	03000000 	movweq	r0, #0
     d78:	08018023 	stmdaeq	r1, {r0, r1, r5, pc}
     d7c:	00007adf 	ldrdeq	r7, [r0], -pc	; <UNPREDICTABLE>
     d80:	005b7105 	subseq	r7, fp, r5, lsl #2
     d84:	23030000 	movwcs	r0, #12288	; 0x3000
     d88:	3a080182 	bcc	201398 <_Min_Stack_Size+0x200f98>
     d8c:	05000082 	streq	r0, [r0, #-130]	; 0xffffff7e
     d90:	00005b74 	andeq	r5, r0, r4, ror fp
     d94:	84230300 	strthi	r0, [r3], #-768	; 0xfffffd00
     d98:	777d0801 	ldrbvc	r0, [sp, -r1, lsl #16]!
     d9c:	77050000 	strvc	r0, [r5, -r0]
     da0:	0000005b 	andeq	r0, r0, fp, asr r0
     da4:	01862303 	orreq	r2, r6, r3, lsl #6
     da8:	00834908 	addeq	r4, r3, r8, lsl #18
     dac:	5b7a0500 	blpl	1e821b4 <_Min_Stack_Size+0x1e81db4>
     db0:	03000000 	movweq	r0, #0
     db4:	08018823 	stmdaeq	r1, {r0, r1, r5, fp, pc}
     db8:	00006dc2 	andeq	r6, r0, r2, asr #27
     dbc:	005b7d05 	subseq	r7, fp, r5, lsl #26
     dc0:	23030000 	movwcs	r0, #12288	; 0x3000
     dc4:	fc08018a 	stc2	1, cr0, [r8], {138}	; 0x8a
     dc8:	05000048 	streq	r0, [r0, #-72]	; 0xffffffb8
     dcc:	00056c80 	andeq	r6, r5, r0, lsl #25
     dd0:	8c230300 	stchi	3, cr0, [r3], #-0
     dd4:	040b0001 	streq	r0, [fp], #-1
     dd8:	000002e9 	andeq	r0, r0, r9, ror #5
     ddc:	0003ef09 	andeq	lr, r3, r9, lsl #30
     de0:	00055a00 	andeq	r5, r5, r0, lsl #20
     de4:	00840a00 	addeq	r0, r4, r0, lsl #20
     de8:	00030000 	andeq	r0, r3, r0
     dec:	00047309 	andeq	r7, r4, r9, lsl #6
     df0:	00056a00 	andeq	r6, r5, r0, lsl #20
     df4:	00840a00 	addeq	r0, r4, r0, lsl #20
     df8:	00030000 	andeq	r0, r3, r0
     dfc:	040b010c 	streq	r0, [fp], #-268	; 0xfffffef4
     e00:	0000056a 	andeq	r0, r0, sl, ror #10
     e04:	0072d603 	rsbseq	sp, r2, r3, lsl #12
     e08:	7e830500 	cdpvc	5, 8, cr0, cr3, cr0, {0}
     e0c:	09000004 	stmdbeq	r0, {r2}
     e10:	0000056c 	andeq	r0, r0, ip, ror #10
     e14:	0000058d 	andeq	r0, r0, sp, lsl #11
     e18:	0000840a 	andeq	r8, r0, sl, lsl #8
     e1c:	0d000200 	sfmeq	f0, 4, [r0, #-0]
     e20:	000048fa 	strdeq	r4, [r0], -sl
     e24:	057d1701 	ldrbeq	r1, [sp, #-1793]!	; 0xfffff8ff
     e28:	03050000 	movweq	r0, #20480	; 0x5000
     e2c:	20000060 	andcs	r0, r0, r0, rrx
     e30:	73a3010e 			; <UNDEFINED> instruction: 0x73a3010e
     e34:	13010000 	movwne	r0, #4096	; 0x1000
     e38:	0af80102 	beq	ffe01248 <_estack+0xdfdfc248>
     e3c:	0b500800 	bleq	1402e44 <_Min_Stack_Size+0x1402a44>
     e40:	060c0800 	streq	r0, [ip], -r0, lsl #16
     e44:	0e010000 	cdpeq	0, 0, cr0, cr1, cr0, {0}
     e48:	006d8a01 	rsbeq	r8, sp, r1, lsl #20
     e4c:	01f40100 	mvnseq	r0, r0, lsl #2
     e50:	000aa001 	andeq	sl, sl, r1
     e54:	000af808 	andeq	pc, sl, r8, lsl #16
     e58:	00063808 	andeq	r3, r6, r8, lsl #16
     e5c:	010e0100 	mrseq	r0, (UNDEF: 30)
     e60:	0000773d 	andeq	r7, r0, sp, lsr r7
     e64:	0101d501 	tsteq	r1, r1, lsl #10
     e68:	08000a3c 	stmdaeq	r0, {r2, r3, r4, r5, r9, fp}
     e6c:	08000aa0 	stmdaeq	r0, {r5, r7, r9, fp}
     e70:	00000664 	andeq	r0, r0, r4, ror #12
     e74:	32010f01 	andcc	r0, r1, #1, 30
     e78:	0100006d 	tsteq	r0, sp, rrx
     e7c:	5b0101cf 	blpl	415c0 <_Min_Stack_Size+0x411c0>
	...
     e88:	90000000 	andls	r0, r0, r0
     e8c:	01000006 	tsteq	r0, r6
     e90:	00000621 	andeq	r0, r0, r1, lsr #12
     e94:	00719a10 	rsbseq	r9, r1, r0, lsl sl
     e98:	01cf0100 	biceq	r0, pc, r0, lsl #2
     e9c:	00000544 	andeq	r0, r0, r4, asr #10
     ea0:	10749102 	rsbsne	r9, r4, r2, lsl #2
     ea4:	00006c99 	muleq	r0, r9, ip
     ea8:	4201cf01 	andmi	ip, r1, #1, 30
     eac:	02000000 	andeq	r0, r0, #0
     eb0:	11007391 			; <UNDEFINED> instruction: 0x11007391
     eb4:	00847e01 	addeq	r7, r4, r1, lsl #28
     eb8:	01ca0100 	biceq	r0, sl, r0, lsl #2
     ebc:	00000001 	andeq	r0, r0, r1
     ec0:	00000000 	andeq	r0, r0, r0
     ec4:	0006ec00 	andeq	lr, r6, r0, lsl #24
     ec8:	066a0100 	strbteq	r0, [sl], -r0, lsl #2
     ecc:	9a100000 	bls	400ed4 <_Min_Stack_Size+0x400ad4>
     ed0:	01000071 	tsteq	r0, r1, ror r0
     ed4:	054401ca 	strbeq	r0, [r4, #-458]	; 0xfffffe36
     ed8:	91020000 	mrsls	r0, (UNDEF: 2)
     edc:	6c991074 	ldcvs	0, cr1, [r9], {116}	; 0x74
     ee0:	ca010000 	bgt	40ee8 <_Min_Stack_Size+0x40ae8>
     ee4:	00004201 	andeq	r4, r0, r1, lsl #4
     ee8:	73910200 	orrsvc	r0, r1, #0, 4
     eec:	007a3710 	rsbseq	r3, sl, r0, lsl r7
     ef0:	01ca0100 	biceq	r0, sl, r0, lsl #2
     ef4:	0000005b 	andeq	r0, r0, fp, asr r0
     ef8:	00709102 	rsbseq	r9, r0, r2, lsl #2
     efc:	7aa8010f 	bvc	fea01340 <_estack+0xde9fc340>
     f00:	c5010000 	strgt	r0, [r1, #-0]
     f04:	005b0101 	subseq	r0, fp, r1, lsl #2
	...
     f10:	07480000 	strbeq	r0, [r8, -r0]
     f14:	a8010000 	stmdage	r1, {}	; <UNPREDICTABLE>
     f18:	10000006 	andne	r0, r0, r6
     f1c:	0000719a 	muleq	r0, sl, r1
     f20:	4401c501 	strmi	ip, [r1], #-1281	; 0xfffffaff
     f24:	02000005 	andeq	r0, r0, #5
     f28:	70126c91 	mulsvc	r2, r1, ip
     f2c:	0100008d 	smlabbeq	r0, sp, r0, r0
     f30:	007901c6 	rsbseq	r0, r9, r6, asr #3
     f34:	91020000 	mrsls	r0, (UNDEF: 2)
     f38:	01110074 	tsteq	r1, r4, ror r0
     f3c:	0000738c 	andeq	r7, r0, ip, lsl #7
     f40:	0101c201 	tsteq	r1, r1, lsl #4
	...
     f4c:	000007a4 	andeq	r0, r0, r4, lsr #15
     f50:	0006e201 	andeq	lr, r6, r1, lsl #4
     f54:	719a1000 	orrsvc	r1, sl, r0
     f58:	c2010000 	andgt	r0, r1, #0
     f5c:	00054401 	andeq	r4, r5, r1, lsl #8
     f60:	74910200 	ldrvc	r0, [r1], #512	; 0x200
     f64:	008d7010 	addeq	r7, sp, r0, lsl r0
     f68:	01c20100 	biceq	r0, r2, r0, lsl #2
     f6c:	0000005b 	andeq	r0, r0, fp, asr r0
     f70:	00729102 	rsbseq	r9, r2, r2, lsl #2
     f74:	72be010f 	adcsvc	r0, lr, #-1073741821	; 0xc0000003
     f78:	bd010000 	stclt	0, cr0, [r1, #-0]
     f7c:	005b0101 	subseq	r0, fp, r1, lsl #2
	...
     f88:	08000000 	stmdaeq	r0, {}	; <UNPREDICTABLE>
     f8c:	20010000 	andcs	r0, r1, r0
     f90:	10000007 	andne	r0, r0, r7
     f94:	0000719a 	muleq	r0, sl, r1
     f98:	4401bd01 	strmi	fp, [r1], #-3329	; 0xfffff2ff
     f9c:	02000005 	andeq	r0, r0, #5
     fa0:	70126c91 	mulsvc	r2, r1, ip
     fa4:	0100008d 	smlabbeq	r0, sp, r0, r0
     fa8:	007901be 	ldrhteq	r0, [r9], #-30	; 0xffffffe2
     fac:	91020000 	mrsls	r0, (UNDEF: 2)
     fb0:	01110074 	tsteq	r1, r4, ror r0
     fb4:	00007bb1 			; <UNDEFINED> instruction: 0x00007bb1
     fb8:	0101ba01 	tsteq	r1, r1, lsl #20
	...
     fc4:	0000085c 	andeq	r0, r0, ip, asr r8
     fc8:	00075a01 	andeq	r5, r7, r1, lsl #20
     fcc:	719a1000 	orrsvc	r1, sl, r0
     fd0:	ba010000 	blt	40fd8 <_Min_Stack_Size+0x40bd8>
     fd4:	00054401 	andeq	r4, r5, r1, lsl #8
     fd8:	74910200 	ldrvc	r0, [r1], #512	; 0x200
     fdc:	008d7010 	addeq	r7, sp, r0, lsl r0
     fe0:	01ba0100 			; <UNDEFINED> instruction: 0x01ba0100
     fe4:	0000005b 	andeq	r0, r0, fp, asr r0
     fe8:	00729102 	rsbseq	r9, r2, r2, lsl #2
     fec:	802d0111 	eorhi	r0, sp, r1, lsl r1
     ff0:	b3010000 	movwlt	r0, #4096	; 0x1000
     ff4:	00000101 	andeq	r0, r0, r1, lsl #2
     ff8:	00000000 	andeq	r0, r0, r0
     ffc:	08b80000 	ldmeq	r8!, {}	; <UNPREDICTABLE>
    1000:	85010000 	strhi	r0, [r1, #-0]
    1004:	10000007 	andne	r0, r0, r7
    1008:	0000719a 	muleq	r0, sl, r1
    100c:	4401b301 	strmi	fp, [r1], #-769	; 0xfffffcff
    1010:	02000005 	andeq	r0, r0, #5
