mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    1014:	11007491 			; <UNDEFINED> instruction: 0x11007491
    1018:	007dd101 	rsbseq	sp, sp, r1, lsl #2
    101c:	01ac0100 			; <UNDEFINED> instruction: 0x01ac0100
    1020:	00000001 	andeq	r0, r0, r1
    1024:	00000000 	andeq	r0, r0, r0
    1028:	00091400 	andeq	r1, r9, r0, lsl #8
    102c:	07b00100 	ldreq	r0, [r0, r0, lsl #2]!
    1030:	9a100000 	bls	401038 <_Min_Stack_Size+0x400c38>
    1034:	01000071 	tsteq	r0, r1, ror r0
    1038:	054401ac 	strbeq	r0, [r4, #-428]	; 0xfffffe54
    103c:	91020000 	mrsls	r0, (UNDEF: 2)
    1040:	01130074 	tsteq	r3, r4, ror r0
    1044:	00007c71 	andeq	r7, r0, r1, ror ip
    1048:	01012e01 	tsteq	r1, r1, lsl #28
	...
    1054:	00000970 	andeq	r0, r0, r0, ror r9
    1058:	000a0501 	andeq	r0, sl, r1, lsl #10
    105c:	835a1000 	cmphi	sl, #0
    1060:	2e010000 	cdpcs	0, 0, cr0, cr1, cr0, {0}
    1064:	000a0501 	andeq	r0, sl, r1, lsl #10
    1068:	dc910300 	ldcle	3, cr0, [r1], {0}
    106c:	0000147e 	andeq	r1, r0, lr, ror r4
    1070:	00000000 	andeq	r0, r0, r0
    1074:	082c0000 	stmdaeq	ip!, {}	; <UNPREDICTABLE>
    1078:	69150000 	ldmdbvs	r5, {}	; <UNPREDICTABLE>
    107c:	01330100 	teqeq	r3, r0, lsl #2
    1080:	00000042 	andeq	r0, r0, r2, asr #32
    1084:	14779102 	ldrbtne	r9, [r7], #-258	; 0xfffffefe
	...
    1090:	00000812 	andeq	r0, r0, r2, lsl r8
    1094:	007af012 	rsbseq	pc, sl, r2, lsl r0	; <UNPREDICTABLE>
    1098:	01380100 	teqeq	r8, r0, lsl #2
    109c:	0000033b 	andeq	r0, r0, fp, lsr r3
    10a0:	006c9102 	rsbeq	r9, ip, r2, lsl #2
    10a4:	00000016 	andeq	r0, r0, r6, lsl r0
    10a8:	00000000 	andeq	r0, r0, r0
    10ac:	7af01200 	bvc	ffc058b4 <_estack+0xdfc008b4>
    10b0:	3d010000 	stccc	0, cr0, [r1, #-0]
    10b4:	00033b01 	andeq	r3, r3, r1, lsl #22
    10b8:	64910200 	ldrvs	r0, [r1], #512	; 0x200
    10bc:	00140000 	andseq	r0, r4, r0
    10c0:	00000000 	andeq	r0, r0, r0
    10c4:	49000000 	stmdbmi	r0, {}	; <UNPREDICTABLE>
    10c8:	12000008 	andne	r0, r0, #8
    10cc:	00008087 	andeq	r8, r0, r7, lsl #1
    10d0:	3b014901 	blcc	534dc <_Min_Stack_Size+0x530dc>
    10d4:	02000003 	andeq	r0, r0, #3
    10d8:	14005c91 	strne	r5, [r0], #-3217	; 0xfffff36f
	...
    10e4:	00000866 	andeq	r0, r0, r6, ror #16
    10e8:	00808712 	addeq	r8, r0, r2, lsl r7
    10ec:	014e0100 	mrseq	r0, (UNDEF: 94)
    10f0:	0000033b 	andeq	r0, r0, fp, lsr r3
    10f4:	00549102 	subseq	r9, r4, r2, lsl #2
    10f8:	00000014 	andeq	r0, r0, r4, lsl r0
    10fc:	00000000 	andeq	r0, r0, r0
    1100:	00088300 	andeq	r8, r8, r0, lsl #6
    1104:	80941200 	addshi	r1, r4, r0, lsl #4
    1108:	55010000 	strpl	r0, [r1, #-0]
    110c:	00033b01 	andeq	r3, r3, r1, lsl #22
    1110:	4c910200 	lfmmi	f0, 4, [r1], {0}
    1114:	00001400 	andeq	r1, r0, r0, lsl #8
    1118:	00000000 	andeq	r0, r0, r0
    111c:	08a00000 	stmiaeq	r0!, {}	; <UNPREDICTABLE>
    1120:	94120000 	ldrls	r0, [r2], #-0
    1124:	01000080 	smlabbeq	r0, r0, r0, r0
    1128:	033b015a 	teqeq	fp, #-2147483626	; 0x80000016
    112c:	91020000 	mrsls	r0, (UNDEF: 2)
    1130:	00140044 	andseq	r0, r4, r4, asr #32
    1134:	00000000 	andeq	r0, r0, r0
    1138:	be000000 	cdplt	0, 0, cr0, cr0, cr0, {0}
    113c:	12000008 	andne	r0, r0, #8
    1140:	000080a1 	andeq	r8, r0, r1, lsr #1
    1144:	3b016101 	blcc	59550 <_Min_Stack_Size+0x59150>
    1148:	03000003 	movweq	r0, #3
    114c:	007fbc91 			; <UNDEFINED> instruction: 0x007fbc91
    1150:	00000014 	andeq	r0, r0, r4, lsl r0
    1154:	00000000 	andeq	r0, r0, r0
    1158:	0008dc00 	andeq	sp, r8, r0, lsl #24
    115c:	80a11200 	adchi	r1, r1, r0, lsl #4
    1160:	66010000 	strvs	r0, [r1], -r0
    1164:	00033b01 	andeq	r3, r3, r1, lsl #22
    1168:	b4910300 	ldrlt	r0, [r1], #768	; 0x300
    116c:	0014007f 	andseq	r0, r4, pc, ror r0
    1170:	00000000 	andeq	r0, r0, r0
    1174:	fa000000 	blx	117c <_Min_Stack_Size+0xd7c>
    1178:	12000008 	andne	r0, r0, #8
    117c:	000080ae 	andeq	r8, r0, lr, lsr #1
    1180:	3b016d01 	blcc	5c58c <_Min_Stack_Size+0x5c18c>
    1184:	03000003 	movweq	r0, #3
    1188:	007fac91 			; <UNDEFINED> instruction: 0x007fac91
    118c:	00000014 	andeq	r0, r0, r4, lsl r0
    1190:	00000000 	andeq	r0, r0, r0
    1194:	00091800 	andeq	r1, r9, r0, lsl #16
    1198:	80ae1200 	adchi	r1, lr, r0, lsl #4
    119c:	72010000 	andvc	r0, r1, #0
    11a0:	00033b01 	andeq	r3, r3, r1, lsl #22
    11a4:	a4910300 	ldrge	r0, [r1], #768	; 0x300
    11a8:	0014007f 	andseq	r0, r4, pc, ror r0
    11ac:	00000000 	andeq	r0, r0, r0
    11b0:	36000000 	strcc	r0, [r0], -r0
    11b4:	12000009 	andne	r0, r0, #9
    11b8:	00006c53 	andeq	r6, r0, r3, asr ip
    11bc:	3b017c01 	blcc	601c8 <_Min_Stack_Size+0x5fdc8>
    11c0:	03000003 	movweq	r0, #3
    11c4:	007f9c91 			; <UNDEFINED> instruction: 0x007f9c91
    11c8:	00000014 	andeq	r0, r0, r4, lsl r0
    11cc:	00000000 	andeq	r0, r0, r0
    11d0:	00095400 	andeq	r5, r9, r0, lsl #8
    11d4:	6c531200 	lfmvs	f1, 2, [r3], {-0}
    11d8:	81010000 	mrshi	r0, (UNDEF: 1)
    11dc:	00033b01 	andeq	r3, r3, r1, lsl #22
    11e0:	94910300 	ldrls	r0, [r1], #768	; 0x300
    11e4:	0014007f 	andseq	r0, r4, pc, ror r0
    11e8:	00000000 	andeq	r0, r0, r0
    11ec:	72000000 	andvc	r0, r0, #0
    11f0:	12000009 	andne	r0, r0, #9
    11f4:	00006bce 	andeq	r6, r0, lr, asr #23
    11f8:	3b018801 	blcc	63204 <_Min_Stack_Size+0x62e04>
    11fc:	03000003 	movweq	r0, #3
    1200:	007f8c91 			; <UNDEFINED> instruction: 0x007f8c91
    1204:	00000014 	andeq	r0, r0, r4, lsl r0
    1208:	00000000 	andeq	r0, r0, r0
    120c:	00099000 	andeq	r9, r9, r0
    1210:	6bce1200 	blvs	ff385a18 <_estack+0xdf380a18>
    1214:	8d010000 	stchi	0, cr0, [r1, #-0]
    1218:	00033b01 	andeq	r3, r3, r1, lsl #22
    121c:	84910300 	ldrhi	r0, [r1], #768	; 0x300
    1220:	0014007f 	andseq	r0, r4, pc, ror r0
    1224:	00000000 	andeq	r0, r0, r0
    1228:	ae000000 	cdpge	0, 0, cr0, cr0, cr0, {0}
    122c:	12000009 	andne	r0, r0, #9
    1230:	00006c84 	andeq	r6, r0, r4, lsl #25
    1234:	3b019401 	blcc	66240 <_Min_Stack_Size+0x65e40>
    1238:	03000003 	movweq	r0, #3
    123c:	007efc91 			; <UNDEFINED> instruction: 0x007efc91
    1240:	00000014 	andeq	r0, r0, r4, lsl r0
    1244:	00000000 	andeq	r0, r0, r0
    1248:	0009cc00 	andeq	ip, r9, r0, lsl #24
    124c:	6c841200 	sfmvs	f1, 4, [r4], {0}
    1250:	99010000 	stmdbls	r1, {}	; <UNPREDICTABLE>
    1254:	00033b01 	andeq	r3, r3, r1, lsl #22
    1258:	f4910300 			; <UNDEFINED> instruction: 0xf4910300
    125c:	0014007e 	andseq	r0, r4, lr, ror r0
    1260:	00000000 	andeq	r0, r0, r0
    1264:	ea000000 	b	126c <_Min_Stack_Size+0xe6c>
    1268:	12000009 	andne	r0, r0, #9
    126c:	00006c15 	andeq	r6, r0, r5, lsl ip
    1270:	3b01a001 	blcc	6927c <_Min_Stack_Size+0x68e7c>
    1274:	03000003 	movweq	r0, #3
    1278:	007eec91 			; <UNDEFINED> instruction: 0x007eec91
    127c:	00000016 	andeq	r0, r0, r6, lsl r0
    1280:	00000000 	andeq	r0, r0, r0
    1284:	6c151200 	lfmvs	f1, 4, [r5], {-0}
    1288:	a5010000 	strge	r0, [r1, #-0]
    128c:	00033b01 	andeq	r3, r3, r1, lsl #22
    1290:	e4910300 	ldr	r0, [r1], #768	; 0x300
    1294:	0b00007e 	bleq	1494 <_Min_Stack_Size+0x1094>
    1298:	00057204 	andeq	r7, r5, r4, lsl #4
    129c:	c3011100 	movwgt	r1, #4352	; 0x1100
    12a0:	0100006e 	tsteq	r0, lr, rrx
    12a4:	0001010b 	andeq	r0, r1, fp, lsl #2
    12a8:	00000000 	andeq	r0, r0, r0
    12ac:	c2000000 	andgt	r0, r0, #0
    12b0:	01000009 	tsteq	r0, r9
    12b4:	00000a36 	andeq	r0, r0, r6, lsr sl
    12b8:	00835a10 	addeq	r5, r3, r0, lsl sl
    12bc:	010b0100 	mrseq	r0, (UNDEF: 27)
    12c0:	00000a05 	andeq	r0, r0, r5, lsl #20
    12c4:	00749102 	rsbseq	r9, r4, r2, lsl #2
    12c8:	72af0117 	adcvc	r0, pc, #-1073741819	; 0xc0000005
    12cc:	34010000 	strcc	r0, [r1], #-0
    12d0:	00000001 	andeq	r0, r0, r1
    12d4:	00000000 	andeq	r0, r0, r0
    12d8:	000a1e00 	andeq	r1, sl, r0, lsl #28
    12dc:	0b180100 	bleq	6016e4 <_Min_Stack_Size+0x6012e4>
    12e0:	5a180000 	bpl	6012e8 <_Min_Stack_Size+0x600ee8>
    12e4:	01000083 	smlabbeq	r0, r3, r0, r0
    12e8:	000a0534 	andeq	r0, sl, r4, lsr r5
    12ec:	5c910200 	lfmpl	f0, 4, [r1], {0}
    12f0:	006d040d 	rsbeq	r0, sp, sp, lsl #8
    12f4:	9e370100 	rsflss	f0, f7, f0
    12f8:	02000000 	andeq	r0, r0, #0
    12fc:	0d0d7091 	stceq	0, cr7, [sp, #-580]	; 0xfffffdbc
    1300:	0100006d 	tsteq	r0, sp, rrx
    1304:	00009e38 	andeq	r9, r0, r8, lsr lr
    1308:	6e910200 	cdpvs	2, 9, cr0, cr1, cr0, {0}
    130c:	0082300d 	addeq	r3, r2, sp
    1310:	9e390100 	rsflse	f0, f1, f0
    1314:	02000000 	andeq	r0, r0, #0
    1318:	b40d6c91 	strlt	r6, [sp], #-3217	; 0xfffff36f
    131c:	01000078 	tsteq	r0, r8, ror r0
    1320:	00009e3a 	andeq	r9, r0, sl, lsr lr
    1324:	6a910200 	bvs	fe441b2c <_estack+0xde43cb2c>
    1328:	006da90d 	rsbeq	sl, sp, sp, lsl #18
    132c:	283b0100 	ldmdacs	fp!, {r8}
    1330:	0200000b 	andeq	r0, r0, #11
    1334:	9f0d6491 	svcls	0x000d6491
    1338:	0100006d 	tsteq	r0, sp, rrx
    133c:	00009e3c 	andeq	r9, r0, ip, lsr lr
    1340:	62910200 	addsvs	r0, r1, #0, 4
    1344:	0070d50d 	rsbseq	sp, r0, sp, lsl #10
    1348:	423f0100 	eorsmi	r0, pc, #0, 2
    134c:	02000000 	andeq	r0, r0, #0
    1350:	4c0d7791 	stcmi	7, cr7, [sp], {145}	; 0x91
    1354:	01000079 	tsteq	r0, r9, ror r0
    1358:	00004240 	andeq	r4, r0, r0, asr #4
    135c:	76910200 	ldrvc	r0, [r1], r0, lsl #4
    1360:	00833b19 	addeq	r3, r3, r9, lsl fp
    1364:	42410100 	submi	r0, r1, #0, 2
    1368:	0d000000 	stceq	0, cr0, [r0, #-0]
    136c:	00007321 	andeq	r7, r0, r1, lsr #6
    1370:	00424201 	subeq	r4, r2, r1, lsl #4
    1374:	91020000 	mrsls	r0, (UNDEF: 2)
    1378:	00001475 	andeq	r1, r0, r5, ror r4
    137c:	00000000 	andeq	r0, r0, r0
    1380:	0b010000 	bleq	41388 <_Min_Stack_Size+0x40f88>
    1384:	691a0000 	ldmdbvs	sl, {}	; <UNPREDICTABLE>
    1388:	426b0100 	rsbmi	r0, fp, #0, 2
    138c:	02000000 	andeq	r0, r0, #0
    1390:	16007491 			; <UNDEFINED> instruction: 0x16007491
	...
    139c:	0100691a 	tsteq	r0, sl, lsl r9
    13a0:	0000429e 	muleq	r0, lr, r2
    13a4:	73910200 	orrsvc	r0, r1, #0, 4
    13a8:	9e090000 	cdpls	0, 0, cr0, cr9, cr0, {0}
    13ac:	28000000 	stmdacs	r0, {}	; <UNPREDICTABLE>
    13b0:	0a00000b 	beq	13e4 <_Min_Stack_Size+0xfe4>
    13b4:	00000084 	andeq	r0, r0, r4, lsl #1
    13b8:	18040001 	stmdane	r4, {r0}
    13bc:	0000000b 	andeq	r0, r0, fp
    13c0:	00000cb1 			; <UNDEFINED> instruction: 0x00000cb1
    13c4:	04690002 	strbteq	r0, [r9], #-2
    13c8:	01040000 	mrseq	r0, (UNDEF: 4)
    13cc:	00006576 	andeq	r6, r0, r6, ror r5
    13d0:	00869e0c 	addeq	r9, r6, ip, lsl #28
    13d4:	004d0800 	subeq	r0, sp, r0, lsl #16
    13d8:	00013000 	andeq	r3, r1, r0
	...
    13e4:	00073900 	andeq	r3, r7, r0, lsl #18
    13e8:	00039e00 	andeq	r9, r3, r0, lsl #28
    13ec:	02010200 	andeq	r0, r1, #0, 4
    13f0:	00002a74 	andeq	r2, r0, r4, ror sl
    13f4:	e1080102 	tst	r8, r2, lsl #2
    13f8:	02000004 	andeq	r0, r0, #4
    13fc:	04da0601 	ldrbeq	r0, [sl], #1537	; 0x601
    1400:	e1030000 	mrs	r0, (UNDEF: 3)
    1404:	0200004f 	andeq	r0, r0, #79	; 0x4f
    1408:	00004d14 	andeq	r4, r0, r4, lsl sp
    140c:	08010200 	stmdaeq	r1, {r9}
    1410:	000048ac 	andeq	r4, r0, ip, lsr #17
    1414:	0d050202 	sfmeq	f0, 4, [r5, #-8]
    1418:	03000006 	movweq	r0, #6
    141c:	0000804c 	andeq	r8, r0, ip, asr #32
    1420:	00661602 	rsbeq	r1, r6, r2, lsl #12
    1424:	02020000 	andeq	r0, r2, #0
    1428:	0051ca07 	subseq	ip, r1, r7, lsl #20
    142c:	05040400 	streq	r0, [r4, #-1024]	; 0xfffffc00
    1430:	00746e69 	rsbseq	r6, r4, r9, ror #28
    1434:	00008903 	andeq	r8, r0, r3, lsl #18
    1438:	7f180200 	svcvc	0x00180200
    143c:	02000000 	andeq	r0, r0, #0
    1440:	28400704 	stmdacs	r0, {r2, r8, r9, sl}^
    1444:	7f050000 	svcvc	0x00050000
    1448:	02000000 	andeq	r0, r0, #0
    144c:	41fc0508 	mvnsmi	r0, r8, lsl #10
    1450:	08020000 	stmdaeq	r2, {}	; <UNPREDICTABLE>
    1454:	0058fe07 	subseq	pc, r8, r7, lsl #28
    1458:	00880300 	addeq	r0, r8, r0, lsl #6
    145c:	22020000 	andcs	r0, r2, #0
    1460:	00000086 	andeq	r0, r0, r6, lsl #1
    1464:	8d040402 	cfstrshi	mvf0, [r4, #-8]
    1468:	02000064 	andeq	r0, r0, #100	; 0x64
    146c:	418b0408 	orrmi	r0, fp, r8, lsl #8
    1470:	28060000 	stmdacs	r6, {}	; <UNPREDICTABLE>
    1474:	01467c03 	cmpeq	r6, r3, lsl #24
    1478:	43070000 	movwmi	r0, #28672	; 0x7000
    147c:	7d030052 	stcvc	0, cr0, [r3, #-328]	; 0xfffffeb8
    1480:	00000099 	muleq	r0, r9, r0
    1484:	08002302 	stmdaeq	r0, {r1, r8, r9, sp}
    1488:	000098ae 	andeq	r9, r0, lr, lsr #17
    148c:	00997e03 	addseq	r7, r9, r3, lsl #28
    1490:	23020000 	movwcs	r0, #8192	; 0x2000
    1494:	49430704 	stmdbmi	r3, {r2, r8, r9, sl}^
    1498:	7f030052 	svcvc	0x00030052
    149c:	00000099 	muleq	r0, r9, r0
    14a0:	08082302 	stmdaeq	r8, {r1, r8, r9, sp}
    14a4:	00006a2f 	andeq	r6, r0, pc, lsr #20
    14a8:	00998003 	addseq	r8, r9, r3
    14ac:	23020000 	movwcs	r0, #8192	; 0x2000
    14b0:	6a48080c 	bvs	12034e8 <_Min_Stack_Size+0x12030e8>
    14b4:	81030000 	mrshi	r0, (UNDEF: 3)
    14b8:	00000099 	muleq	r0, r9, r0
    14bc:	08102302 	ldmdaeq	r0, {r1, r8, r9, sp}
    14c0:	00006a38 	andeq	r6, r0, r8, lsr sl
    14c4:	00998203 	addseq	r8, r9, r3, lsl #4
    14c8:	23020000 	movwcs	r0, #8192	; 0x2000
    14cc:	6af30814 	bvs	ffcc3524 <_estack+0xdfcbe524>
    14d0:	83030000 	movwhi	r0, #12288	; 0x3000
    14d4:	00000099 	muleq	r0, r9, r0
    14d8:	08182302 	ldmdaeq	r8, {r1, r8, r9, sp}
    14dc:	00006a0b 	andeq	r6, r0, fp, lsl #20
    14e0:	00998403 	addseq	r8, r9, r3, lsl #8
    14e4:	23020000 	movwcs	r0, #8192	; 0x2000
    14e8:	6a06081c 	bvs	183560 <_Min_Stack_Size+0x183160>
    14ec:	85030000 	strhi	r0, [r3, #-0]
    14f0:	00000099 	muleq	r0, r9, r0
    14f4:	07202302 	streq	r2, [r0, -r2, lsl #6]!
    14f8:	00525343 	subseq	r5, r2, r3, asr #6
    14fc:	00998603 	addseq	r8, r9, r3, lsl #12
    1500:	23020000 	movwcs	r0, #8192	; 0x2000
    1504:	23030024 	movwcs	r0, #12324	; 0x3024
    1508:	0300006a 	movweq	r0, #106	; 0x6a
    150c:	0000b287 	andeq	fp, r0, r7, lsl #5
    1510:	031c0600 	tsteq	ip, #0, 12
    1514:	0001bca0 	andeq	fp, r1, r0, lsr #25
    1518:	52430700 	subpl	r0, r3, #0, 14
    151c:	a103004c 	tstge	r3, ip, asr #32
    1520:	00000099 	muleq	r0, r9, r0
    1524:	07002302 	streq	r2, [r0, -r2, lsl #6]
    1528:	00485243 	subeq	r5, r8, r3, asr #4
    152c:	0099a203 	addseq	sl, r9, r3, lsl #4
    1530:	23020000 	movwcs	r0, #8192	; 0x2000
    1534:	44490704 	strbmi	r0, [r9], #-1796	; 0xfffff8fc
    1538:	a3030052 	movwge	r0, #12370	; 0x3052
    153c:	00000099 	muleq	r0, r9, r0
    1540:	07082302 	streq	r2, [r8, -r2, lsl #6]
    1544:	0052444f 	subseq	r4, r2, pc, asr #8
    1548:	0099a403 	addseq	sl, r9, r3, lsl #8
    154c:	23020000 	movwcs	r0, #8192	; 0x2000
    1550:	5d9c080c 	ldcpl	8, cr0, [ip, #48]	; 0x30
    1554:	a5030000 	strge	r0, [r3, #-0]
    1558:	00000099 	muleq	r0, r9, r0
    155c:	07102302 	ldreq	r2, [r0, -r2, lsl #6]
    1560:	00525242 	subseq	r5, r2, r2, asr #4
    1564:	0099a603 	addseq	sl, r9, r3, lsl #12
    1568:	23020000 	movwcs	r0, #8192	; 0x2000
    156c:	3b1b0814 	blcc	6c35c4 <_Min_Stack_Size+0x6c31c4>
    1570:	a7030000 	strge	r0, [r3, -r0]
    1574:	00000099 	muleq	r0, r9, r0
    1578:	00182302 	andseq	r2, r8, r2, lsl #6
    157c:	00304303 	eorseq	r4, r0, r3, lsl #6
    1580:	51a80300 			; <UNDEFINED> instruction: 0x51a80300
    1584:	06000001 	streq	r0, [r0], -r1
    1588:	4ddc0324 	ldclmi	3, cr0, [ip, #144]	; 0x90
    158c:	07000002 	streq	r0, [r0, -r2]
    1590:	00315243 	eorseq	r5, r1, r3, asr #4
    1594:	0099dd03 	addseq	sp, r9, r3, lsl #26
    1598:	23020000 	movwcs	r0, #8192	; 0x2000
    159c:	52430700 	subpl	r0, r3, #0, 14
    15a0:	de030032 	mcrle	0, 0, r0, cr3, cr2, {1}
    15a4:	00000099 	muleq	r0, r9, r0
    15a8:	08042302 	stmdaeq	r4, {r1, r8, r9, sp}
    15ac:	00009000 	andeq	r9, r0, r0
    15b0:	0099df03 	addseq	sp, r9, r3, lsl #30
    15b4:	23020000 	movwcs	r0, #8192	; 0x2000
    15b8:	90050808 	andls	r0, r5, r8, lsl #16
    15bc:	e0030000 	and	r0, r3, r0
    15c0:	00000099 	muleq	r0, r9, r0
    15c4:	070c2302 	streq	r2, [ip, -r2, lsl #6]
    15c8:	03005244 	movweq	r5, #580	; 0x244
    15cc:	000099e1 	andeq	r9, r0, r1, ror #19
    15d0:	10230200 	eorne	r0, r3, r0, lsl #4
    15d4:	31525307 	cmpcc	r2, r7, lsl #6
    15d8:	99e20300 	stmibls	r2!, {r8, r9}^
    15dc:	02000000 	andeq	r0, r0, #0
    15e0:	53071423 	movwpl	r1, #29731	; 0x7423
    15e4:	03003252 	movweq	r3, #594	; 0x252
    15e8:	000099e3 	andeq	r9, r0, r3, ror #19
    15ec:	18230200 	stmdane	r3!, {r9}
    15f0:	52434307 	subpl	r4, r3, #469762048	; 0x1c000000
    15f4:	99e40300 	stmibls	r4!, {r8, r9}^
    15f8:	02000000 	andeq	r0, r0, #0
    15fc:	b0081c23 	andlt	r1, r8, r3, lsr #24
    1600:	03000085 	movweq	r0, #133	; 0x85
    1604:	000099e5 	andeq	r9, r0, r5, ror #19
    1608:	20230200 	eorcs	r0, r3, r0, lsl #4
    160c:	87260300 	strhi	r0, [r6, -r0, lsl #6]!
    1610:	e6030000 	str	r0, [r3], -r0
    1614:	000001c7 	andeq	r0, r0, r7, asr #3
    1618:	5f040806 	svcpl	0x00040806
    161c:	00000299 	muleq	r0, r9, r2
    1620:	0051dd08 	subseq	sp, r1, r8, lsl #26
    1624:	99600400 	stmdbls	r0!, {sl}^
    1628:	02000002 	andeq	r0, r0, #2
    162c:	ee080023 	cdp	0, 0, cr0, cr8, cr3, {1}
    1630:	0400003a 	streq	r0, [r0], #-58	; 0xffffffc6
    1634:	00005b63 	andeq	r5, r0, r3, ror #22
    1638:	04230200 	strteq	r0, [r3], #-512	; 0xfffffe00
    163c:	0052dc08 	subseq	sp, r2, r8, lsl #24
    1640:	42660400 	rsbmi	r0, r6, #0, 8
    1644:	02000000 	andeq	r0, r0, #0
    1648:	45080623 	strmi	r0, [r8, #-1571]	; 0xfffff9dd
    164c:	04000001 	streq	r0, [r0], #-1
    1650:	00004269 	andeq	r4, r0, r9, ror #4
    1654:	07230200 	streq	r0, [r3, -r0, lsl #4]!
    1658:	bc040900 			; <UNDEFINED> instruction: 0xbc040900
    165c:	03000001 	movweq	r0, #1
    1660:	00002e1e 	andeq	r2, r0, lr, lsl lr
    1664:	02586d04 	subseq	r6, r8, #4, 26	; 0x100
    1668:	02060000 	andeq	r0, r6, #0
    166c:	02cf2505 	sbceq	r2, pc, #20971520	; 0x1400000
    1670:	aa080000 	bge	201678 <_Min_Stack_Size+0x201278>
    1674:	0500008f 	streq	r0, [r0, #-143]	; 0xffffff71
    1678:	00004226 	andeq	r4, r0, r6, lsr #4
    167c:	00230200 	eoreq	r0, r3, r0, lsl #4
    1680:	008bf008 	addeq	pc, fp, r8
    1684:	42270500 	eormi	r0, r7, #0, 10
    1688:	02000000 	andeq	r0, r0, #0
    168c:	03000123 	movweq	r0, #291	; 0x123
    1690:	00008701 	andeq	r8, r0, r1, lsl #14
    1694:	02aa2805 	adceq	r2, sl, #327680	; 0x50000
    1698:	070a0000 	streq	r0, [sl, -r0]
    169c:	00004d01 	andeq	r4, r0, r1, lsl #26
    16a0:	f42a0500 	vld3.8	{d0,d2,d4}, [sl], r0
    16a4:	0b000002 	bleq	16b4 <_Min_Stack_Size+0x12b4>
    16a8:	00008c1b 	andeq	r8, r0, fp, lsl ip
    16ac:	8bbb0b00 	blhi	feec42b4 <_estack+0xdeebf2b4>
    16b0:	00010000 	andeq	r0, r1, r0
    16b4:	008eb503 	addeq	fp, lr, r3, lsl #10
    16b8:	da2d0500 	ble	b42ac0 <_Min_Stack_Size+0xb426c0>
    16bc:	0a000002 	beq	16cc <_Min_Stack_Size+0x12cc>
    16c0:	004d0107 	subeq	r0, sp, r7, lsl #2
    16c4:	2f050000 	svccs	0x00050000
    16c8:	00000319 	andeq	r0, r0, r9, lsl r3
    16cc:	0086f70b 	addeq	pc, r6, fp, lsl #14
    16d0:	ce0b0000 	cdpgt	0, 0, cr0, cr11, cr0, {0}
    16d4:	01000092 	swpeq	r0, r2, [r0]	; <UNPREDICTABLE>
    16d8:	8b830300 	blhi	fe0c22e0 <_estack+0xde0bd2e0>
    16dc:	32050000 	andcc	r0, r5, #0
    16e0:	000002ff 	strdeq	r0, [r0], -pc	; <UNPREDICTABLE>
    16e4:	4d01070a 	stcmi	7, cr0, [r1, #-40]	; 0xffffffd8
    16e8:	05000000 	streq	r0, [r0, #-0]
    16ec:	00033e34 	andeq	r3, r3, r4, lsr lr
    16f0:	8e230b00 	vmulhi.f64	d0, d3, d0
    16f4:	0b000000 	bleq	16fc <_Min_Stack_Size+0x12fc>
    16f8:	0000906a 	andeq	r9, r0, sl, rrx
    16fc:	ac030001 	stcge	0, cr0, [r3], {1}
    1700:	0500008a 	streq	r0, [r0, #-138]	; 0xffffff76
    1704:	00032437 	andeq	r2, r3, r7, lsr r4
    1708:	01070a00 	tsteq	r7, r0, lsl #20
    170c:	0000004d 	andeq	r0, r0, sp, asr #32
    1710:	03633905 	cmneq	r3, #81920	; 0x14000
    1714:	990b0000 	stmdbls	fp, {}	; <UNPREDICTABLE>
    1718:	0000008b 	andeq	r0, r0, fp, lsl #1
    171c:	008ea50b 	addeq	sl, lr, fp, lsl #10
    1720:	03000100 	movweq	r0, #256	; 0x100
    1724:	00008f0e 	andeq	r8, r0, lr, lsl #30
    1728:	03493c05 	movteq	r3, #39941	; 0x9c05
    172c:	070a0000 	streq	r0, [sl, -r0]
    1730:	00004d01 	andeq	r4, r0, r1, lsl #26
    1734:	883e0500 	ldmdahi	lr!, {r8, sl}
    1738:	0b000003 	bleq	174c <_Min_Stack_Size+0x134c>
    173c:	00009171 	andeq	r9, r0, r1, ror r1
    1740:	85a10b00 	strhi	r0, [r1, #2816]!	; 0xb00
    1744:	00010000 	andeq	r0, r1, r0
    1748:	0084fa03 	addeq	pc, r4, r3, lsl #20
    174c:	6e410500 	cdpvs	5, 4, cr0, cr1, cr0, {0}
    1750:	0a000003 	beq	1764 <_Min_Stack_Size+0x1364>
    1754:	004d0107 	subeq	r0, sp, r7, lsl #2
    1758:	43050000 	movwmi	r0, #20480	; 0x5000
    175c:	0000042b 	andeq	r0, r0, fp, lsr #8
    1760:	008cc30b 	addeq	ip, ip, fp, lsl #6
    1764:	bf0b0000 	svclt	0x000b0000
    1768:	0100008a 	smlabbeq	r0, sl, r0, r0
    176c:	0085170b 	addeq	r1, r5, fp, lsl #14
    1770:	140b0200 	strne	r0, [fp], #-512	; 0xfffffe00
    1774:	0300008e 	movweq	r0, #142	; 0x8e
    1778:	008b1f0b 	addeq	r1, fp, fp, lsl #30
    177c:	c80b0400 	stmdagt	fp, {sl}
    1780:	05000089 	streq	r0, [r0, #-137]	; 0xffffff77
    1784:	008a110b 	addeq	r1, sl, fp, lsl #2
    1788:	5f0b0600 	svcpl	0x000b0600
    178c:	0700008d 	streq	r0, [r0, -sp, lsl #1]
    1790:	008cf00b 	addeq	pc, ip, fp
    1794:	e20b0800 	and	r0, fp, #0, 16
    1798:	0900008b 	stmdbeq	r0, {r0, r1, r3, r7}
    179c:	0092f30b 	addseq	pc, r2, fp, lsl #6
    17a0:	f30b0a00 	vpmax.u8	d0, d11, d0
    17a4:	0b00008e 	bleq	19e4 <_Min_Stack_Size+0x15e4>
    17a8:	0087a90b 	addeq	sl, r7, fp, lsl #18
    17ac:	db0b0c00 	blle	2c47b4 <_Min_Stack_Size+0x2c43b4>
    17b0:	0d000089 	stceq	0, cr0, [r0, #-548]	; 0xfffffddc
    17b4:	0087df0b 	addeq	sp, r7, fp, lsl #30
    17b8:	160b0e00 	strne	r0, [fp], -r0, lsl #28
    17bc:	0f000092 	svceq	0x00000092
    17c0:	00911b0b 	addseq	r1, r1, fp, lsl #22
    17c4:	be0b1000 	cdplt	0, 0, cr1, cr11, cr0, {0}
    17c8:	11000090 	swpne	r0, r0, [r0]	; <UNPREDICTABLE>
    17cc:	008d150b 	addeq	r1, sp, fp, lsl #10
    17d0:	150b1200 	strne	r1, [fp, #-512]	; 0xfffffe00
    17d4:	13000087 	movwne	r0, #135	; 0x87
    17d8:	008e350b 	addeq	r3, lr, fp, lsl #10
    17dc:	8d0b1400 	cfstrshi	mvf1, [fp, #-0]
    17e0:	15000086 	strne	r0, [r0, #-134]	; 0xffffff7a
    17e4:	0091810b 	addseq	r8, r1, fp, lsl #2
    17e8:	03001600 	movweq	r1, #1536	; 0x600
    17ec:	0000850b 	andeq	r8, r0, fp, lsl #10
    17f0:	03935d05 	orrseq	r5, r3, #320	; 0x140
    17f4:	070a0000 	streq	r0, [sl, -r0]
    17f8:	00004d01 	andeq	r4, r0, r1, lsl #26
    17fc:	505f0500 	subspl	r0, pc, r0, lsl #10
    1800:	0b000004 	bleq	1818 <_Min_Stack_Size+0x1418>
    1804:	00008f62 	andeq	r8, r0, r2, ror #30
    1808:	8e8d0b00 	vdivhi.f64	d0, d13, d0
    180c:	00010000 	andeq	r0, r1, r0
    1810:	00924a03 	addseq	r4, r2, r3, lsl #20
    1814:	36620500 	strbtcc	r0, [r2], -r0, lsl #10
    1818:	0a000004 	beq	1830 <_Min_Stack_Size+0x1430>
    181c:	004d0107 	subeq	r0, sp, r7, lsl #2
    1820:	64050000 	strvs	r0, [r5], #-0
    1824:	00000493 	muleq	r0, r3, r4
    1828:	0085b60b 	addeq	fp, r5, fp, lsl #12
    182c:	fe0b0000 	cdp2	0, 0, cr0, cr11, cr0, {0}
    1830:	0100008c 	smlabbeq	r0, ip, r0, r0
    1834:	0085560b 	addeq	r5, r5, fp, lsl #12
    1838:	470b0200 	strmi	r0, [fp, -r0, lsl #4]
    183c:	0300008d 	movweq	r0, #141	; 0x8d
    1840:	0087320b 	addeq	r3, r7, fp, lsl #4
    1844:	b70b0400 	strlt	r0, [fp, -r0, lsl #8]
    1848:	05000092 	streq	r0, [r0, #-146]	; 0xffffff6e
    184c:	0090a80b 	addseq	sl, r0, fp, lsl #16
    1850:	03000600 	movweq	r0, #1536	; 0x600
    1854:	00008db9 			; <UNDEFINED> instruction: 0x00008db9
    1858:	045b7005 	ldrbeq	r7, [fp], #-5
    185c:	070a0000 	streq	r0, [sl, -r0]
    1860:	00004d01 	andeq	r4, r0, r1, lsl #26
    1864:	d6720500 	ldrbtle	r0, [r2], -r0, lsl #10
    1868:	0b000004 	bleq	1880 <_Min_Stack_Size+0x1480>
    186c:	00008990 	muleq	r0, r0, r9
    1870:	88130b00 	ldmdahi	r3, {r8, r9, fp}
    1874:	0b010000 	bleq	4187c <_Min_Stack_Size+0x4147c>
    1878:	000084de 	ldrdeq	r8, [r0], -lr
