mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    187c:	8a960b02 	bhi	fe58448c <_estack+0xde57f48c>
    1880:	0b030000 	bleq	c1888 <_Min_Stack_Size+0xc1488>
    1884:	00008b3d 	andeq	r8, r0, sp, lsr fp
    1888:	852f0b04 	strhi	r0, [pc, #-2820]!	; d8c <_Min_Stack_Size+0x98c>
    188c:	0b050000 	bleq	141894 <_Min_Stack_Size+0x141494>
    1890:	000088b0 			; <UNDEFINED> instruction: 0x000088b0
    1894:	cb030006 	blgt	c18b4 <_Min_Stack_Size+0xc14b4>
    1898:	05000085 	streq	r0, [r0, #-133]	; 0xffffff7b
    189c:	00049e7c 	andeq	r9, r4, ip, ror lr
    18a0:	01070a00 	tsteq	r7, r0, lsl #20
    18a4:	0000004d 	andeq	r0, r0, sp, asr #32
    18a8:	04fb7e05 	ldrbteq	r7, [fp], #3589	; 0xe05
    18ac:	6c0b0000 	stcvs	0, cr0, [fp], {-0}
    18b0:	00000085 	andeq	r0, r0, r5, lsl #1
    18b4:	0087960b 	addeq	r9, r7, fp, lsl #12
    18b8:	03000100 	movweq	r0, #256	; 0x100
    18bc:	00009138 	andeq	r9, r0, r8, lsr r1
    18c0:	04e18105 	strbteq	r8, [r1], #261	; 0x105
    18c4:	070a0000 	streq	r0, [sl, -r0]
    18c8:	00004d01 	andeq	r4, r0, r1, lsl #26
    18cc:	20830500 	addcs	r0, r3, r0, lsl #10
    18d0:	0b000005 	bleq	18ec <_Min_Stack_Size+0x14ec>
    18d4:	00008ae0 	andeq	r8, r0, r0, ror #21
    18d8:	8ff10b00 	svchi	0x00f10b00
    18dc:	00010000 	andeq	r0, r1, r0
    18e0:	00909803 	addseq	r9, r0, r3, lsl #16
    18e4:	06860500 	streq	r0, [r6], r0, lsl #10
    18e8:	0c000005 	stceq	0, cr0, [r0], {5}
    18ec:	013b0503 	teqeq	fp, r3, lsl #10
    18f0:	00000562 	andeq	r0, r0, r2, ror #10
    18f4:	008eca0d 	addeq	ip, lr, sp, lsl #20
    18f8:	013d0500 	teqeq	sp, r0, lsl #10
    18fc:	00000388 	andeq	r0, r0, r8, lsl #7
    1900:	0d002302 	stceq	3, cr2, [r0, #-8]
    1904:	000086ac 	andeq	r8, r0, ip, lsr #13
    1908:	88013e05 	stmdahi	r1, {r0, r2, r9, sl, fp, ip, sp}
    190c:	02000003 	andeq	r0, r0, #3
    1910:	7d0d0123 	stfvcs	f0, [sp, #-140]	; 0xffffff74
    1914:	05000088 	streq	r0, [r0, #-136]	; 0xffffff78
    1918:	0388013f 	orreq	r0, r8, #-1073741809	; 0xc000000f
    191c:	23020000 	movwcs	r0, #8192	; 0x2000
    1920:	490e0002 	stmdbmi	lr, {r1}
    1924:	05000085 	streq	r0, [r0, #-133]	; 0xffffff7b
    1928:	052b0141 	streq	r0, [fp, #-321]!	; 0xfffffebf
    192c:	240c0000 	strcs	r0, [ip], #-0
    1930:	2c014305 	stccs	3, cr4, [r1], {5}
    1934:	0d000006 	stceq	0, cr0, [r0, #-24]	; 0xffffffe8
    1938:	0000884b 	andeq	r8, r0, fp, asr #16
    193c:	2c014505 	cfstr32cs	mvfx4, [r1], {5}
    1940:	02000006 	andeq	r0, r0, #6
    1944:	050d0023 	streq	r0, [sp, #-35]	; 0xffffffdd
    1948:	05000089 	streq	r0, [r0, #-137]	; 0xffffff77
    194c:	005b0148 	subseq	r0, fp, r8, asr #2
    1950:	23020000 	movwcs	r0, #8192	; 0x2000
    1954:	8a820d04 	bhi	fe084d6c <_estack+0xde07fd6c>
    1958:	4b050000 	blmi	141960 <_Min_Stack_Size+0x141560>
    195c:	00005b01 	andeq	r5, r0, r1, lsl #22
    1960:	06230200 	strteq	r0, [r3], -r0, lsl #4
    1964:	008da00d 	addeq	sl, sp, sp
    1968:	014e0500 	cmpeq	lr, r0, lsl #10
    196c:	00000074 	andeq	r0, r0, r4, ror r0
    1970:	0d082302 	stceq	3, cr2, [r8, #-8]
    1974:	00008da9 	andeq	r8, r0, r9, lsr #27
    1978:	5b015105 	blpl	55d94 <_Min_Stack_Size+0x55994>
    197c:	02000000 	andeq	r0, r0, #0
    1980:	550d0c23 	strpl	r0, [sp, #-3107]	; 0xfffff3dd
    1984:	0500008e 	streq	r0, [r0, #-142]	; 0xffffff72
    1988:	005b0154 	subseq	r0, fp, r4, asr r1
    198c:	23020000 	movwcs	r0, #8192	; 0x2000
    1990:	87770d0e 	ldrbhi	r0, [r7, -lr, lsl #26]!
    1994:	57050000 	strpl	r0, [r5, -r0]
    1998:	0002cf01 	andeq	ip, r2, r1, lsl #30
    199c:	10230200 	eorne	r0, r3, r0, lsl #4
    19a0:	008cb30d 	addeq	fp, ip, sp, lsl #6
    19a4:	015a0500 	cmpeq	sl, r0, lsl #10
    19a8:	0000005b 	andeq	r0, r0, fp, asr r0
    19ac:	0d122302 	ldceq	3, cr2, [r2, #-8]
    19b0:	00008f93 	muleq	r0, r3, pc	; <UNPREDICTABLE>
    19b4:	5b015d05 	blpl	58dd0 <_Min_Stack_Size+0x589d0>
    19b8:	02000000 	andeq	r0, r0, #0
    19bc:	3f0d1423 	svccc	0x000d1423
    19c0:	05000092 	streq	r0, [r0, #-146]	; 0xffffff6e
    19c4:	05620160 	strbeq	r0, [r2, #-352]!	; 0xfffffea0
    19c8:	23020000 	movwcs	r0, #8192	; 0x2000
    19cc:	91900d16 	orrsls	r0, r0, r6, lsl sp
    19d0:	63050000 	movwvs	r0, #20480	; 0x5000
    19d4:	00063e01 	andeq	r3, r6, r1, lsl #28
    19d8:	1c230200 	sfmne	f0, 4, [r3], #-0
    19dc:	0087f80d 	addeq	pc, r7, sp, lsl #16
    19e0:	01670500 	cmneq	r7, r0, lsl #10
    19e4:	00000650 	andeq	r0, r0, r0, asr r6
    19e8:	00202302 	eoreq	r2, r0, r2, lsl #6
    19ec:	024d0409 	subeq	r0, sp, #150994944	; 0x9000000
    19f0:	010f0000 	mrseq	r0, CPSR
    19f4:	0000063e 	andeq	r0, r0, lr, lsr r6
    19f8:	00049310 	andeq	r9, r4, r0, lsl r3
    19fc:	04090000 	streq	r0, [r9], #-0
    1a00:	00000632 	andeq	r0, r0, r2, lsr r6
    1a04:	0650010f 	ldrbeq	r0, [r0], -pc, lsl #2
    1a08:	d6100000 	ldrle	r0, [r0], -r0
    1a0c:	00000004 	andeq	r0, r0, r4
    1a10:	06440409 	strbeq	r0, [r4], -r9, lsl #8
    1a14:	f80e0000 			; <UNDEFINED> instruction: 0xf80e0000
    1a18:	05000088 	streq	r0, [r0, #-136]	; 0xffffff78
    1a1c:	056e0169 	strbeq	r0, [lr, #-361]!	; 0xfffffe97
    1a20:	71110000 	tstvc	r1, r0
    1a24:	0100008f 	smlabbeq	r0, pc, r0, r0	; <UNPREDICTABLE>
    1a28:	00063e13 	andeq	r3, r6, r3, lsl lr
    1a2c:	6c030500 	cfstr32vs	mvfx0, [r3], {-0}
    1a30:	11200000 			; <UNDEFINED> instruction: 0x11200000
    1a34:	0000894c 	andeq	r8, r0, ip, asr #18
    1a38:	063e1401 	ldrteq	r1, [lr], -r1, lsl #8
    1a3c:	03050000 	movweq	r0, #20480	; 0x5000
    1a40:	20000070 	andcs	r0, r0, r0, ror r0
    1a44:	00896e11 	addeq	r6, r9, r1, lsl lr
    1a48:	50150100 	andspl	r0, r5, r0, lsl #2
    1a4c:	05000006 	streq	r0, [r0, #-6]
    1a50:	00007403 	andeq	r7, r0, r3, lsl #8
    1a54:	914f1120 	cmpls	pc, r0, lsr #2
    1a58:	16010000 	strne	r0, [r1], -r0
    1a5c:	00000650 	andeq	r0, r0, r0, asr r6
    1a60:	00780305 	rsbseq	r0, r8, r5, lsl #6
    1a64:	01122000 	tsteq	r2, r0
    1a68:	00008acd 	andeq	r8, r0, sp, asr #21
    1a6c:	0103e301 	tsteq	r3, r1, lsl #6
    1a70:	08000e38 	stmdaeq	r0, {r3, r4, r5, r9, sl, fp}
    1a74:	08000f30 	stmdaeq	r0, {r4, r5, r8, r9, sl, fp}
    1a78:	00000a7a 	andeq	r0, r0, sl, ror sl
    1a7c:	0006e001 	andeq	lr, r6, r1
    1a80:	8d3b1300 	ldchi	3, cr1, [fp, #-0]
    1a84:	e5010000 	str	r0, [r1, #-0]
    1a88:	00007403 	andeq	r7, r0, r3, lsl #8
    1a8c:	70910200 	addsvc	r0, r1, r0, lsl #4
    1a90:	008d4113 	addeq	r4, sp, r3, lsl r1
    1a94:	03e50100 	mvneq	r0, #0, 2
    1a98:	00000074 	andeq	r0, r0, r4, ror r0
    1a9c:	00749102 	rsbseq	r9, r4, r2, lsl #2
    1aa0:	90420112 	subls	r0, r2, r2, lsl r1
    1aa4:	84010000 	strhi	r0, [r1], #-0
    1aa8:	0d3c0103 	ldfeqs	f0, [ip, #-12]!
    1aac:	0e380800 	cdpeq	8, 3, cr0, cr8, cr0, {0}
    1ab0:	0aca0800 	beq	ff283ab8 <_estack+0xdf27eab8>
    1ab4:	38010000 	stmdacc	r1, {}	; <UNPREDICTABLE>
    1ab8:	13000007 	movwne	r0, #7
    1abc:	0000900a 	andeq	r9, r0, sl
    1ac0:	99038801 	stmdbls	r3, {r0, fp, pc}
    1ac4:	02000000 	andeq	r0, r0, #0
    1ac8:	05136891 	ldreq	r6, [r3, #-2193]	; 0xfffff76f
    1acc:	01000092 	swpeq	r0, r2, [r0]	; <UNPREDICTABLE>
    1ad0:	0074038b 	rsbseq	r0, r4, fp, lsl #7
    1ad4:	91020000 	mrsls	r0, (UNDEF: 2)
    1ad8:	8f001374 	svchi	0x00001374
    1adc:	8b010000 	blhi	41ae4 <_Min_Stack_Size+0x416e4>
    1ae0:	00007403 	andeq	r7, r0, r3, lsl #8
    1ae4:	70910200 	addsvc	r0, r1, r0, lsl #4
    1ae8:	008f0713 	addeq	r0, pc, r3, lsl r7	; <UNPREDICTABLE>
    1aec:	038b0100 	orreq	r0, fp, #0, 2
    1af0:	00000074 	andeq	r0, r0, r4, ror r0
    1af4:	006c9102 	rsbeq	r9, ip, r2, lsl #2
    1af8:	91d20112 	bicsls	r0, r2, r2, lsl r1
    1afc:	37010000 	strcc	r0, [r1, -r0]
    1b00:	0c480103 	stfeqe	f0, [r8], {3}
    1b04:	0d3c0800 	ldceq	8, cr0, [ip, #-0]
    1b08:	0b1a0800 	bleq	683b10 <_Min_Stack_Size+0x683710>
    1b0c:	72010000 	andvc	r0, r1, #0
    1b10:	13000007 	movwne	r0, #7
    1b14:	00008d3b 	andeq	r8, r0, fp, lsr sp
    1b18:	74033901 	strvc	r3, [r3], #-2305	; 0xfffff6ff
    1b1c:	02000000 	andeq	r0, r0, #0
    1b20:	41137091 			; <UNDEFINED> instruction: 0x41137091
    1b24:	0100008d 	smlabbeq	r0, sp, r0, r0
    1b28:	00740339 	rsbseq	r0, r4, r9, lsr r3
    1b2c:	91020000 	mrsls	r0, (UNDEF: 2)
    1b30:	01120074 	tsteq	r2, r4, ror r0
    1b34:	00008939 	andeq	r8, r0, r9, lsr r9
    1b38:	0102da01 	tsteq	r2, r1, lsl #20
    1b3c:	08000b50 	stmdaeq	r0, {r4, r6, r8, r9, fp}
    1b40:	08000c48 	stmdaeq	r0, {r3, r6, sl, fp}
    1b44:	00000b6a 	andeq	r0, r0, sl, ror #22
    1b48:	0007ca01 	andeq	ip, r7, r1, lsl #20
    1b4c:	900a1300 	andls	r1, sl, r0, lsl #6
    1b50:	dd010000 	stcle	0, cr0, [r1, #-0]
    1b54:	00009902 	andeq	r9, r0, r2, lsl #18
    1b58:	68910200 	ldmvs	r1, {r9}
    1b5c:	00920513 	addseq	r0, r2, r3, lsl r5
    1b60:	02e00100 	rsceq	r0, r0, #0, 2
    1b64:	00000074 	andeq	r0, r0, r4, ror r0
    1b68:	13749102 	cmnne	r4, #-2147483648	; 0x80000000
    1b6c:	00008f00 	andeq	r8, r0, r0, lsl #30
    1b70:	7402e001 	strvc	lr, [r2], #-1
    1b74:	02000000 	andeq	r0, r0, #0
    1b78:	07137091 			; <UNDEFINED> instruction: 0x07137091
    1b7c:	0100008f 	smlabbeq	r0, pc, r0, r0	; <UNPREDICTABLE>
    1b80:	007402e0 	rsbseq	r0, r4, r0, ror #5
    1b84:	91020000 	mrsls	r0, (UNDEF: 2)
    1b88:	0114006c 	tsteq	r4, ip, rrx
    1b8c:	00008b11 	andeq	r8, r0, r1, lsl fp
    1b90:	0102c601 	tsteq	r2, r1, lsl #12
	...
    1b9c:	00000bba 			; <UNDEFINED> instruction: 0x00000bba
    1ba0:	00080401 	andeq	r0, r8, r1, lsl #8
    1ba4:	92281500 	eorls	r1, r8, #0, 10
    1ba8:	c6010000 	strgt	r0, [r1], -r0
    1bac:	00080402 	andeq	r0, r8, r2, lsl #8
    1bb0:	74910200 	ldrvc	r0, [r1], #512	; 0x200
    1bb4:	00926715 	addseq	r6, r2, r5, lsl r7
    1bb8:	02c60100 	sbceq	r0, r6, #0, 2
    1bbc:	00000520 	andeq	r0, r0, r0, lsr #10
    1bc0:	00739102 	rsbseq	r9, r3, r2, lsl #2
    1bc4:	06560409 	ldrbeq	r0, [r6], -r9, lsl #8
    1bc8:	01160000 	tsteq	r6, r0
    1bcc:	000091e5 	andeq	r9, r0, r5, ror #3
    1bd0:	0102c101 	tsteq	r2, r1, lsl #2
    1bd4:	00000042 	andeq	r0, r0, r2, asr #32
	...
    1be0:	00000c16 	andeq	r0, r0, r6, lsl ip
    1be4:	00083901 	andeq	r3, r8, r1, lsl #18
    1be8:	92281500 	eorls	r1, r8, #0, 10
    1bec:	c1010000 	mrsgt	r0, (UNDEF: 1)
    1bf0:	00080402 	andeq	r0, r8, r2, lsl #8
    1bf4:	74910200 	ldrvc	r0, [r1], #512	; 0x200
    1bf8:	e1011400 	tst	r1, r0, lsl #8
    1bfc:	01000092 	swpeq	r0, r2, [r0]	; <UNPREDICTABLE>
    1c00:	000102ae 	andeq	r0, r1, lr, lsr #5
    1c04:	00000000 	andeq	r0, r0, r0
    1c08:	72000000 	andvc	r0, r0, #0
    1c0c:	0100000c 	tsteq	r0, ip
    1c10:	00000873 	andeq	r0, r0, r3, ror r8
    1c14:	00922815 	addseq	r2, r2, r5, lsl r8
    1c18:	02ae0100 	adceq	r0, lr, #0, 2
    1c1c:	00000804 	andeq	r0, r0, r4, lsl #16
    1c20:	15749102 	ldrbne	r9, [r4, #-258]!	; 0xfffffefe
    1c24:	00009299 	muleq	r0, r9, r2
    1c28:	4202ae01 	andmi	sl, r2, #1, 28
    1c2c:	02000000 	andeq	r0, r0, #0
    1c30:	12007391 	andne	r7, r0, #1140850690	; 0x44000002
    1c34:	0086de01 	addeq	sp, r6, r1, lsl #28
    1c38:	02810100 	addeq	r0, r1, #0, 2
    1c3c:	00000001 	andeq	r0, r0, r1
    1c40:	00000000 	andeq	r0, r0, r0
    1c44:	000cce00 	andeq	ip, ip, r0, lsl #28
    1c48:	08f80100 	ldmeq	r8!, {r8}^
    1c4c:	28150000 	ldmdacs	r5, {}	; <UNPREDICTABLE>
    1c50:	01000092 	swpeq	r0, r2, [r0]	; <UNPREDICTABLE>
    1c54:	08040281 	stmdaeq	r4, {r0, r7, r9}
    1c58:	91020000 	mrsls	r0, (UNDEF: 2)
    1c5c:	8e9a156c 	cdphi	5, 9, cr1, cr10, cr12, {3}
    1c60:	81010000 	mrshi	r0, (UNDEF: 1)
    1c64:	00005b02 	andeq	r5, r0, r2, lsl #22
    1c68:	6a910200 	bvs	fe442470 <_estack+0xde43d470>
    1c6c:	008c1115 	addeq	r1, ip, r5, lsl r1
    1c70:	02810100 	addeq	r0, r1, #0, 2
    1c74:	000008f8 	strdeq	r0, [r0], -r8
    1c78:	15649102 	strbne	r9, [r4, #-258]!	; 0xfffffefe
    1c7c:	0000925c 	andeq	r9, r0, ip, asr r2
    1c80:	74028201 	strvc	r8, [r2], #-513	; 0xfffffdff
    1c84:	02000000 	andeq	r0, r0, #0
    1c88:	2e156091 	mrccs	0, 0, r6, cr5, cr1, {4}
    1c8c:	0100008b 	smlabbeq	r0, fp, r0, r0
    1c90:	03190282 	tsteq	r9, #536870920	; 0x20000008
    1c94:	91020000 	mrsls	r0, (UNDEF: 2)
    1c98:	87881500 	strhi	r1, [r8, r0, lsl #10]
    1c9c:	82010000 	andhi	r0, r1, #0
    1ca0:	0002f402 	andeq	pc, r2, r2, lsl #8
    1ca4:	04910200 	ldreq	r0, [r1], #512	; 0x200
    1ca8:	0087f013 	addeq	pc, r7, r3, lsl r0	; <UNPREDICTABLE>
    1cac:	02850100 	addeq	r0, r5, #0, 2
    1cb0:	00000099 	muleq	r0, r9, r0
    1cb4:	00749102 	rsbseq	r9, r4, r2, lsl #2
    1cb8:	00420409 	subeq	r0, r2, r9, lsl #8
    1cbc:	01120000 	tsteq	r2, r0
    1cc0:	00008d22 	andeq	r8, r0, r2, lsr #26
    1cc4:	01022301 	tsteq	r2, r1, lsl #6
	...
    1cd0:	00000d1e 	andeq	r0, r0, lr, lsl sp
    1cd4:	00098301 	andeq	r8, r9, r1, lsl #6
    1cd8:	92281500 	eorls	r1, r8, #0, 10
    1cdc:	23010000 	movwcs	r0, #4096	; 0x1000
    1ce0:	00080402 	andeq	r0, r8, r2, lsl #8
    1ce4:	6c910200 	lfmvs	f0, 4, [r1], {0}
    1ce8:	008e9a15 	addeq	r9, lr, r5, lsl sl
    1cec:	02230100 	eoreq	r0, r3, #0, 2
    1cf0:	0000005b 	andeq	r0, r0, fp, asr r0
    1cf4:	156a9102 	strbne	r9, [sl, #-258]!	; 0xfffffefe
    1cf8:	00009038 	andeq	r9, r0, r8, lsr r0
    1cfc:	f8022301 			; <UNDEFINED> instruction: 0xf8022301
    1d00:	02000008 	andeq	r0, r0, #8
    1d04:	5c156491 	cfldrspl	mvf6, [r5], {145}	; 0x91
    1d08:	01000092 	swpeq	r0, r2, [r0]	; <UNPREDICTABLE>
    1d0c:	00740224 	rsbseq	r0, r4, r4, lsr #4
    1d10:	91020000 	mrsls	r0, (UNDEF: 2)
    1d14:	8b2e1560 	blhi	b8729c <_Min_Stack_Size+0xb86e9c>
    1d18:	24010000 	strcs	r0, [r1], #-0
    1d1c:	00031902 	andeq	r1, r3, r2, lsl #18
    1d20:	00910200 	addseq	r0, r1, r0, lsl #4
    1d24:	00878815 	addeq	r8, r7, r5, lsl r8
    1d28:	02240100 	eoreq	r0, r4, #0, 2
    1d2c:	000002f4 	strdeq	r0, [r0], -r4
    1d30:	13049102 	movwne	r9, #16642	; 0x4102
    1d34:	000087f0 	strdeq	r8, [r0], -r0
    1d38:	99022701 	stmdbls	r2, {r0, r8, r9, sl, sp}
    1d3c:	02000000 	andeq	r0, r0, #0
    1d40:	12007491 	andne	r7, r0, #-1862270976	; 0x91000000
    1d44:	008bc401 	addeq	ip, fp, r1, lsl #8
    1d48:	01d40100 	bicseq	r0, r4, r0, lsl #2
    1d4c:	00000001 	andeq	r0, r0, r1
    1d50:	00000000 	andeq	r0, r0, r0
    1d54:	000d6e00 	andeq	r6, sp, r0, lsl #28
    1d58:	0a010100 	beq	42160 <_Min_Stack_Size+0x41d60>
    1d5c:	28150000 	ldmdacs	r5, {}	; <UNPREDICTABLE>
    1d60:	01000092 	swpeq	r0, r2, [r0]	; <UNPREDICTABLE>
    1d64:	080401d4 	stmdaeq	r4, {r2, r4, r6, r7, r8}
    1d68:	91020000 	mrsls	r0, (UNDEF: 2)
    1d6c:	8c11156c 	cfldr32hi	mvfx1, [r1], {108}	; 0x6c
    1d70:	d4010000 	strle	r0, [r1], #-0
    1d74:	0008f801 	andeq	pc, r8, r1, lsl #16
    1d78:	68910200 	ldmvs	r1, {r9}
    1d7c:	00925c15 	addseq	r5, r2, r5, lsl ip
    1d80:	01d40100 	bicseq	r0, r4, r0, lsl #2
    1d84:	00000074 	andeq	r0, r0, r4, ror r0
    1d88:	15649102 	strbne	r9, [r4, #-258]!	; 0xfffffefe
    1d8c:	00008788 	andeq	r8, r0, r8, lsl #15
    1d90:	f401d501 	vst3.8	{d13,d15,d17}, [r1], r1
    1d94:	02000002 	andeq	r0, r0, #2
    1d98:	f0136391 			; <UNDEFINED> instruction: 0xf0136391
    1d9c:	01000087 	smlabbeq	r0, r7, r0, r0
    1da0:	009901d7 			; <UNDEFINED> instruction: 0x009901d7
    1da4:	91020000 	mrsls	r0, (UNDEF: 2)
    1da8:	00001770 	andeq	r1, r0, r0, ror r7
    1dac:	00000000 	andeq	r0, r0, r0
    1db0:	69180000 	ldmdbvs	r8, {}	; <UNPREDICTABLE>
    1db4:	01df0100 	bicseq	r0, pc, r0, lsl #2
    1db8:	0000006d 	andeq	r0, r0, sp, rrx
    1dbc:	00749102 	rsbseq	r9, r4, r2, lsl #2
    1dc0:	cd011200 	sfmgt	f1, 4, [r1, #-0]
    1dc4:	0100008d 	smlabbeq	r0, sp, r0, r0
    1dc8:	000101ca 	andeq	r0, r1, sl, asr #3
    1dcc:	00000000 	andeq	r0, r0, r0
    1dd0:	be000000 	cdplt	0, 0, cr0, cr0, cr0, {0}
    1dd4:	0100000d 	tsteq	r0, sp
    1dd8:	00000a61 	andeq	r0, r0, r1, ror #20
    1ddc:	00922815 	addseq	r2, r2, r5, lsl r8
    1de0:	01ca0100 	biceq	r0, sl, r0, lsl #2
    1de4:	00000804 	andeq	r0, r0, r4, lsl #16
    1de8:	156c9102 	strbne	r9, [ip, #-258]!	; 0xfffffefe
    1dec:	00009038 	andeq	r9, r0, r8, lsr r0
    1df0:	f801ca01 			; <UNDEFINED> instruction: 0xf801ca01
    1df4:	02000008 	andeq	r0, r0, #8
    1df8:	5c156891 	ldcpl	8, cr6, [r5], {145}	; 0x91
    1dfc:	01000092 	swpeq	r0, r2, [r0]	; <UNPREDICTABLE>
    1e00:	007401ca 	rsbseq	r0, r4, sl, asr #3
    1e04:	91020000 	mrsls	r0, (UNDEF: 2)
    1e08:	00001764 	andeq	r1, r0, r4, ror #14
    1e0c:	00000000 	andeq	r0, r0, r0
    1e10:	69180000 	ldmdbvs	r8, {}	; <UNPREDICTABLE>
    1e14:	01cc0100 	biceq	r0, ip, r0, lsl #2
    1e18:	0000006d 	andeq	r0, r0, sp, rrx
    1e1c:	00749102 	rsbseq	r9, r4, r2, lsl #2
    1e20:	c9011400 	stmdbgt	r1, {sl, ip}
    1e24:	01000084 	smlabbeq	r0, r4, r0, r0
    1e28:	000101be 			; <UNDEFINED> instruction: 0x000101be
    1e2c:	00000000 	andeq	r0, r0, r0
    1e30:	0e000000 	cdpeq	0, 0, cr0, cr0, cr0, {0}
    1e34:	0100000e 	tsteq	r0, lr
    1e38:	00000aaa 	andeq	r0, r0, sl, lsr #21
    1e3c:	00922815 	addseq	r2, r2, r5, lsl r8
    1e40:	01be0100 			; <UNDEFINED> instruction: 0x01be0100
    1e44:	00000804 	andeq	r0, r0, r4, lsl #16
    1e48:	15749102 	ldrbne	r9, [r4, #-258]!	; 0xfffffefe
    1e4c:	00008e9a 	muleq	r0, sl, lr
    1e50:	5b01be01 	blpl	7165c <_Min_Stack_Size+0x7125c>
    1e54:	02000000 	andeq	r0, r0, #0
    1e58:	44197291 	ldrmi	r7, [r9], #-657	; 0xfffffd6f
    1e5c:	01007269 	tsteq	r0, r9, ror #4
    1e60:	04fb01be 	ldrbteq	r0, [fp], #446	; 0x1be
    1e64:	91020000 	mrsls	r0, (UNDEF: 2)
    1e68:	01140071 	tsteq	r4, r1, ror r0
    1e6c:	00008afb 	strdeq	r8, [r0], -fp
    1e70:	0101a401 	tsteq	r1, r1, lsl #8
	...
    1e7c:	00000e6a 	andeq	r0, r0, sl, ror #28
    1e80:	000ae401 	andeq	lr, sl, r1, lsl #8
    1e84:	92281500 	eorls	r1, r8, #0, 10
    1e88:	a4010000 	strge	r0, [r1], #-0
    1e8c:	00080401 	andeq	r0, r8, r1, lsl #8
    1e90:	74910200 	ldrvc	r0, [r1], #512	; 0x200
    1e94:	008af015 	addeq	pc, sl, r5, lsl r0	; <UNPREDICTABLE>
    1e98:	01a40100 			; <UNDEFINED> instruction: 0x01a40100
    1e9c:	00000363 	andeq	r0, r0, r3, ror #6
    1ea0:	00739102 	rsbseq	r9, r3, r2, lsl #2
    1ea4:	92a00112 	adcls	r0, r0, #-2147483644	; 0x80000004
    1ea8:	7e010000 	cdpvc	0, 0, cr0, cr1, cr0, {0}
    1eac:	00000101 	andeq	r0, r0, r1, lsl #2
    1eb0:	00000000 	andeq	r0, r0, r0
    1eb4:	0ec60000 	cdpeq	0, 12, cr0, cr6, cr0, {0}
    1eb8:	2d010000 	stccs	0, cr0, [r1, #-0]
    1ebc:	1500000b 	strne	r0, [r0, #-11]
    1ec0:	00009228 	andeq	r9, r0, r8, lsr #4
    1ec4:	04017e01 	streq	r7, [r1], #-3585	; 0xfffff1ff
    1ec8:	02000008 	andeq	r0, r0, #8
    1ecc:	49157491 	ldmdbmi	r5, {r0, r4, r7, sl, ip, sp, lr}
    1ed0:	0100008e 	smlabbeq	r0, lr, r0, r0
    1ed4:	033e017e 	teqeq	lr, #-2147483617	; 0x8000001f
    1ed8:	91020000 	mrsls	r0, (UNDEF: 2)
    1edc:	8b2e1573 	blhi	b874b0 <_Min_Stack_Size+0xb870b0>
    1ee0:	7f010000 	svcvc	0x00010000
    1ee4:	00031901 	andeq	r1, r3, r1, lsl #18
    1ee8:	72910200 	addsvc	r0, r1, #0, 4
    1eec:	82011600 	andhi	r1, r1, #0, 12
    1ef0:	01000092 	swpeq	r0, r2, [r0]	; <UNPREDICTABLE>
    1ef4:	50010157 	andpl	r0, r1, r7, asr r1
    1ef8:	00000004 	andeq	r0, r0, r4
    1efc:	00000000 	andeq	r0, r0, r0
    1f00:	16000000 	strne	r0, [r0], -r0
    1f04:	0100000f 	tsteq	r0, pc
    1f08:	00000b7a 	andeq	r0, r0, sl, ror fp
    1f0c:	00922815 	addseq	r2, r2, r5, lsl r8
    1f10:	01570100 	cmpeq	r7, r0, lsl #2
    1f14:	00000804 	andeq	r0, r0, r4, lsl #16
    1f18:	156c9102 	strbne	r9, [ip, #-258]!	; 0xfffffefe
    1f1c:	00008636 	andeq	r8, r0, r6, lsr r6
    1f20:	2b015701 	blcs	57b2c <_Min_Stack_Size+0x5772c>
    1f24:	02000004 	andeq	r0, r0, #4
    1f28:	24136b91 	ldrcs	r6, [r3], #-2961	; 0xfffff46f
    1f2c:	01000085 	smlabbeq	r0, r5, r0, r0
    1f30:	04500159 	ldrbeq	r0, [r0], #-345	; 0xfffffea7
    1f34:	91020000 	mrsls	r0, (UNDEF: 2)
    1f38:	011a0077 	tsteq	sl, r7, ror r0
    1f3c:	00009236 	andeq	r9, r0, r6, lsr r2
    1f40:	0001f301 	andeq	pc, r1, r1, lsl #6
    1f44:	00000000 	andeq	r0, r0, r0
    1f48:	72000000 	andvc	r0, r0, #0
    1f4c:	0100000f 	tsteq	r0, pc
    1f50:	00000ba3 	andeq	r0, r0, r3, lsr #23
    1f54:	0092281b 	addseq	r2, r2, fp, lsl r8
    1f58:	04f30100 	ldrbteq	r0, [r3], #256	; 0x100
    1f5c:	02000008 	andeq	r0, r0, #8
    1f60:	1c007491 	cfstrsne	mvf7, [r0], {145}	; 0x91
    1f64:	00912801 	addseq	r2, r1, r1, lsl #16
    1f68:	01d50100 	bicseq	r0, r5, r0, lsl #2
	...
    1f74:	00000fc2 	andeq	r0, r0, r2, asr #31
    1f78:	000bcc01 	andeq	ip, fp, r1, lsl #24
    1f7c:	92281b00 	eorls	r1, r8, #0, 22
    1f80:	d5010000 	strle	r0, [r1, #-0]
    1f84:	00000804 	andeq	r0, r0, r4, lsl #16
    1f88:	00749102 	rsbseq	r9, r4, r2, lsl #2
    1f8c:	91f7011a 	mvnsls	r0, sl, lsl r1
    1f90:	6f010000 	svcvs	0x00010000
    1f94:	00000001 	andeq	r0, r0, r1
    1f98:	00000000 	andeq	r0, r0, r0
    1f9c:	00101e00 	andseq	r1, r0, r0, lsl #28
    1fa0:	0c290100 	stfeqs	f0, [r9], #-0
    1fa4:	281b0000 	ldmdacs	fp, {}	; <UNPREDICTABLE>
    1fa8:	01000092 	swpeq	r0, r2, [r0]	; <UNPREDICTABLE>
    1fac:	0008046f 	andeq	r0, r8, pc, ror #8
    1fb0:	5c910200 	lfmpl	f0, 4, [r1], {0}
    1fb4:	00920c11 	addseq	r0, r2, r1, lsl ip
    1fb8:	29720100 	ldmdbcs	r2!, {r8}^
    1fbc:	0200000c 	andeq	r0, r0, #12
    1fc0:	6d116491 	cfldrsvs	mvf6, [r1, #-580]	; 0xfffffdbc
    1fc4:	01000092 	swpeq	r0, r2, [r0]	; <UNPREDICTABLE>
    1fc8:	00007474 	andeq	r7, r0, r4, ror r4
    1fcc:	74910200 	ldrvc	r0, [r1], #512	; 0x200
    1fd0:	00000017 	andeq	r0, r0, r7, lsl r0
    1fd4:	00000000 	andeq	r0, r0, r0
    1fd8:	8d6c1100 	stfhie	f1, [ip, #-0]
    1fdc:	97010000 	strls	r0, [r1, -r0]
    1fe0:	00000074 	andeq	r0, r0, r4, ror r0
    1fe4:	00709102 	rsbseq	r9, r0, r2, lsl #2
    1fe8:	005b1d00 	subseq	r1, fp, r0, lsl #26
    1fec:	0c390000 	ldceq	0, cr0, [r9], #-0
    1ff0:	7f1e0000 	svcvc	0x001e0000
    1ff4:	05000000 	streq	r0, [r0, #-0]
    1ff8:	55011f00 	strpl	r1, [r1, #-3840]	; 0xfffff100
    1ffc:	01000090 	swpeq	r0, r0, [r0]	; <UNPREDICTABLE>
    2000:	00420146 	subeq	r0, r2, r6, asr #2
	...
    200c:	106e0000 	rsbne	r0, lr, r0
    2010:	74010000 	strvc	r0, [r1], #-0
    2014:	1b00000c 	blne	204c <_Min_Stack_Size+0x1c4c>
    2018:	000084f3 	strdeq	r8, [r0], -r3
    201c:	00424601 	subeq	r4, r2, r1, lsl #12
    2020:	91020000 	mrsls	r0, (UNDEF: 2)
    2024:	9148116f 	cmpls	r8, pc, ror #2
    2028:	48010000 	stmdami	r1, {}	; <UNPREDICTABLE>
    202c:	00000042 	andeq	r0, r0, r2, asr #32
    2030:	00779102 	rsbseq	r9, r7, r2, lsl #2
    2034:	008baa20 	addeq	sl, fp, r0, lsr #20
    2038:	01200100 			; <UNDEFINED> instruction: 0x01200100
	...
    2044:	000010ca 	andeq	r1, r0, sl, asr #1
    2048:	92281b01 	eorls	r1, r8, #1024	; 0x400
    204c:	20010000 	andcs	r0, r1, r0
    2050:	00000804 	andeq	r0, r0, r4, lsl #16
    2054:	21649102 	cmncs	r4, r2, lsl #2
    2058:	00414453 	subeq	r4, r1, r3, asr r4
    205c:	029f2201 	addseq	r2, pc, #268435456	; 0x10000000
    2060:	91020000 	mrsls	r0, (UNDEF: 2)
    2064:	43532170 	cmpmi	r3, #112, 2
    2068:	2201004c 	andcs	r0, r1, #76	; 0x4c
    206c:	0000029f 	muleq	r0, pc, r2	; <UNPREDICTABLE>
    2070:	00689102 	rsbeq	r9, r8, r2, lsl #2
    2074:	00065900 	andeq	r5, r6, r0, lsl #18
    2078:	6d000200 	sfmvs	f0, 4, [r0, #-0]
    207c:	04000006 	streq	r0, [r0], #-6
    2080:	00657601 	rsbeq	r7, r5, r1, lsl #12
    2084:	97900c00 	ldrls	r0, [r0, r0, lsl #24]
    2088:	4d080000 	stcmi	0, cr0, [r8, #-0]
    208c:	01d80000 	bicseq	r0, r8, r0
	...
    2098:	0ba10000 	bleq	fe8420a0 <_estack+0xde83d0a0>
    209c:	03f50000 	mvnseq	r0, #0
    20a0:	01020000 	mrseq	r0, (UNDEF: 2)
    20a4:	002a7402 	eoreq	r7, sl, r2, lsl #8
    20a8:	08010200 	stmdaeq	r1, {r9}
    20ac:	000004e1 	andeq	r0, r0, r1, ror #9
    20b0:	da060102 	ble	1824c0 <_Min_Stack_Size+0x1820c0>
    20b4:	03000004 	movweq	r0, #4
    20b8:	00004fe1 	andeq	r4, r0, r1, ror #31
    20bc:	004d1402 	subeq	r1, sp, r2, lsl #8
    20c0:	01020000 	mrseq	r0, (UNDEF: 2)
    20c4:	0048ac08 	subeq	sl, r8, r8, lsl #24
    20c8:	05020200 	streq	r0, [r2, #-512]	; 0xfffffe00
    20cc:	0000060d 	andeq	r0, r0, sp, lsl #12
    20d0:	00804c03 	addeq	r4, r0, r3, lsl #24
    20d4:	66160200 	ldrvs	r0, [r6], -r0, lsl #4
    20d8:	02000000 	andeq	r0, r0, #0
    20dc:	51ca0702 	bicpl	r0, sl, r2, lsl #14
