mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    20e0:	04040000 	streq	r0, [r4], #-0
    20e4:	746e6905 	strbtvc	r6, [lr], #-2309	; 0xfffff6fb
    20e8:	07040200 	streq	r0, [r4, -r0, lsl #4]
    20ec:	00002840 	andeq	r2, r0, r0, asr #16
    20f0:	00007405 	andeq	r7, r0, r5, lsl #8
    20f4:	05080200 	streq	r0, [r8, #-512]	; 0xfffffe00
    20f8:	000041fc 	strdeq	r4, [r0], -ip
    20fc:	fe070802 	vcmla.f16	d0, d7, d2[0], #0
    2100:	03000058 	movweq	r0, #88	; 0x58
    2104:	00000088 	andeq	r0, r0, r8, lsl #1
    2108:	007b2202 	rsbseq	r2, fp, r2, lsl #4
    210c:	04020000 	streq	r0, [r2], #-0
    2110:	00648d04 	rsbeq	r8, r4, r4, lsl #26
    2114:	04080200 	streq	r0, [r8], #-512	; 0xfffffe00
    2118:	0000418b 	andeq	r4, r0, fp, lsl #3
    211c:	7c032806 	stcvc	8, cr2, [r3], {6}
    2120:	0000013b 	andeq	r0, r0, fp, lsr r1
    2124:	00524307 	subseq	r4, r2, r7, lsl #6
    2128:	008e7d03 	addeq	r7, lr, r3, lsl #26
    212c:	23020000 	movwcs	r0, #8192	; 0x2000
    2130:	98ae0800 	stmials	lr!, {fp}
    2134:	7e030000 	cdpvc	0, 0, cr0, cr3, cr0, {0}
    2138:	0000008e 	andeq	r0, r0, lr, lsl #1
    213c:	07042302 	streq	r2, [r4, -r2, lsl #6]
    2140:	00524943 	subseq	r4, r2, r3, asr #18
    2144:	008e7f03 	addeq	r7, lr, r3, lsl #30
    2148:	23020000 	movwcs	r0, #8192	; 0x2000
    214c:	6a2f0808 	bvs	bc4174 <_Min_Stack_Size+0xbc3d74>
    2150:	80030000 	andhi	r0, r3, r0
    2154:	0000008e 	andeq	r0, r0, lr, lsl #1
    2158:	080c2302 	stmdaeq	ip, {r1, r8, r9, sp}
    215c:	00006a48 	andeq	r6, r0, r8, asr #20
    2160:	008e8103 	addeq	r8, lr, r3, lsl #2
    2164:	23020000 	movwcs	r0, #8192	; 0x2000
    2168:	6a380810 	bvs	e041b0 <_Min_Stack_Size+0xe03db0>
    216c:	82030000 	andhi	r0, r3, #0
    2170:	0000008e 	andeq	r0, r0, lr, lsl #1
    2174:	08142302 	ldmdaeq	r4, {r1, r8, r9, sp}
    2178:	00006af3 	strdeq	r6, [r0], -r3
    217c:	008e8303 	addeq	r8, lr, r3, lsl #6
    2180:	23020000 	movwcs	r0, #8192	; 0x2000
    2184:	6a0b0818 	bvs	2c41ec <_Min_Stack_Size+0x2c3dec>
    2188:	84030000 	strhi	r0, [r3], #-0
    218c:	0000008e 	andeq	r0, r0, lr, lsl #1
    2190:	081c2302 	ldmdaeq	ip, {r1, r8, r9, sp}
    2194:	00006a06 	andeq	r6, r0, r6, lsl #20
    2198:	008e8503 	addeq	r8, lr, r3, lsl #10
    219c:	23020000 	movwcs	r0, #8192	; 0x2000
    21a0:	53430720 	movtpl	r0, #14112	; 0x3720
    21a4:	86030052 			; <UNDEFINED> instruction: 0x86030052
    21a8:	0000008e 	andeq	r0, r0, lr, lsl #1
    21ac:	00242302 	eoreq	r2, r4, r2, lsl #6
    21b0:	006a2303 	rsbeq	r2, sl, r3, lsl #6
    21b4:	a7870300 	strge	r0, [r7, r0, lsl #6]
    21b8:	06000000 	streq	r0, [r0], -r0
    21bc:	b1a0031c 	lsllt	r0, ip, r3
    21c0:	07000001 	streq	r0, [r0, -r1]
    21c4:	004c5243 	subeq	r5, ip, r3, asr #4
    21c8:	008ea103 	addeq	sl, lr, r3, lsl #2
    21cc:	23020000 	movwcs	r0, #8192	; 0x2000
    21d0:	52430700 	subpl	r0, r3, #0, 14
    21d4:	a2030048 	andge	r0, r3, #72	; 0x48
    21d8:	0000008e 	andeq	r0, r0, lr, lsl #1
    21dc:	07042302 	streq	r2, [r4, -r2, lsl #6]
    21e0:	00524449 	subseq	r4, r2, r9, asr #8
    21e4:	008ea303 	addeq	sl, lr, r3, lsl #6
    21e8:	23020000 	movwcs	r0, #8192	; 0x2000
    21ec:	444f0708 	strbmi	r0, [pc], #-1800	; 21f4 <_Min_Stack_Size+0x1df4>
    21f0:	a4030052 	strge	r0, [r3], #-82	; 0xffffffae
    21f4:	0000008e 	andeq	r0, r0, lr, lsl #1
    21f8:	080c2302 	stmdaeq	ip, {r1, r8, r9, sp}
    21fc:	00005d9c 	muleq	r0, ip, sp
    2200:	008ea503 	addeq	sl, lr, r3, lsl #10
    2204:	23020000 	movwcs	r0, #8192	; 0x2000
    2208:	52420710 	subpl	r0, r2, #16, 14	; 0x400000
    220c:	a6030052 			; <UNDEFINED> instruction: 0xa6030052
    2210:	0000008e 	andeq	r0, r0, lr, lsl #1
    2214:	08142302 	ldmdaeq	r4, {r1, r8, r9, sp}
    2218:	00003b1b 	andeq	r3, r0, fp, lsl fp
    221c:	008ea703 	addeq	sl, lr, r3, lsl #14
    2220:	23020000 	movwcs	r0, #8192	; 0x2000
    2224:	43030018 	movwmi	r0, #12312	; 0x3018
    2228:	03000030 	movweq	r0, #48	; 0x30
    222c:	000146a8 	andeq	r4, r1, r8, lsr #13
    2230:	03240600 			; <UNDEFINED> instruction: 0x03240600
    2234:	000241ce 	andeq	r4, r2, lr, asr #3
    2238:	52430700 	subpl	r0, r3, #0, 14
    223c:	cf030031 	svcgt	0x00030031
    2240:	0000008e 	andeq	r0, r0, lr, lsl #1
    2244:	07002302 	streq	r2, [r0, -r2, lsl #6]
    2248:	00325243 	eorseq	r5, r2, r3, asr #4
    224c:	008ed003 	addeq	sp, lr, r3
    2250:	23020000 	movwcs	r0, #8192	; 0x2000
    2254:	52530704 	subspl	r0, r3, #4, 14	; 0x100000
    2258:	8ed10300 	cdphi	3, 13, cr0, cr1, cr0, {0}
    225c:	02000000 	andeq	r0, r0, #0
    2260:	44070823 	strmi	r0, [r7], #-2083	; 0xfffff7dd
    2264:	d2030052 	andle	r0, r3, #82	; 0x52
    2268:	0000008e 	andeq	r0, r0, lr, lsl #1
    226c:	080c2302 	stmdaeq	ip, {r1, r8, r9, sp}
    2270:	00009974 	andeq	r9, r0, r4, ror r9
    2274:	008ed303 	addeq	sp, lr, r3, lsl #6
    2278:	23020000 	movwcs	r0, #8192	; 0x2000
    227c:	93c10810 	bicls	r0, r1, #16, 16	; 0x100000
    2280:	d4030000 	strle	r0, [r3], #-0
    2284:	0000008e 	andeq	r0, r0, lr, lsl #1
    2288:	08142302 	ldmdaeq	r4, {r1, r8, r9, sp}
    228c:	000096c5 	andeq	r9, r0, r5, asr #13
    2290:	008ed503 	addeq	sp, lr, r3, lsl #10
    2294:	23020000 	movwcs	r0, #8192	; 0x2000
    2298:	98ab0818 	stmials	fp!, {r3, r4, fp}
    229c:	d6030000 	strle	r0, [r3], -r0
    22a0:	0000008e 	andeq	r0, r0, lr, lsl #1
    22a4:	081c2302 	ldmdaeq	ip, {r1, r8, r9, sp}
    22a8:	0000983d 	andeq	r9, r0, sp, lsr r8
    22ac:	008ed703 	addeq	sp, lr, r3, lsl #14
    22b0:	23020000 	movwcs	r0, #8192	; 0x2000
    22b4:	04030020 	streq	r0, [r3], #-32	; 0xffffffe0
    22b8:	03000098 	movweq	r0, #152	; 0x98
    22bc:	0001bcd8 	ldrdeq	fp, [r1], -r8
    22c0:	04080600 	streq	r0, [r8], #-1536	; 0xfffffa00
    22c4:	00028d5f 	andeq	r8, r2, pc, asr sp
    22c8:	51dd0800 	bicspl	r0, sp, r0, lsl #16
    22cc:	60040000 	andvs	r0, r4, r0
    22d0:	0000028d 	andeq	r0, r0, sp, lsl #5
    22d4:	08002302 	stmdaeq	r0, {r1, r8, r9, sp}
    22d8:	00003aee 	andeq	r3, r0, lr, ror #21
    22dc:	005b6304 	subseq	r6, fp, r4, lsl #6
    22e0:	23020000 	movwcs	r0, #8192	; 0x2000
    22e4:	52dc0804 	sbcspl	r0, ip, #4, 16	; 0x40000
    22e8:	66040000 	strvs	r0, [r4], -r0
    22ec:	00000042 	andeq	r0, r0, r2, asr #32
    22f0:	08062302 	stmdaeq	r6, {r1, r8, r9, sp}
    22f4:	00000145 	andeq	r0, r0, r5, asr #2
    22f8:	00426904 	subeq	r6, r2, r4, lsl #18
    22fc:	23020000 	movwcs	r0, #8192	; 0x2000
    2300:	04090007 	streq	r0, [r9], #-7
    2304:	000001b1 			; <UNDEFINED> instruction: 0x000001b1
    2308:	002e1e03 	eoreq	r1, lr, r3, lsl #28
    230c:	4c6d0400 	cfstrdmi	mvd0, [sp], #-0
    2310:	06000002 	streq	r0, [r0], -r2
    2314:	419a051c 	orrsmi	r0, sl, ip, lsl r5
    2318:	08000003 	stmdaeq	r0, {r0, r1}
    231c:	000093b1 			; <UNDEFINED> instruction: 0x000093b1
    2320:	03419c05 	movteq	r9, #7173	; 0x1c05
    2324:	23020000 	movwcs	r0, #8192	; 0x2000
    2328:	973f0800 	ldrls	r0, [pc, -r0, lsl #16]!
    232c:	9f050000 	svcls	0x00050000
    2330:	0000005b 	andeq	r0, r0, fp, asr r0
    2334:	08042302 	stmdaeq	r4, {r1, r8, r9, sp}
    2338:	00009714 	andeq	r9, r0, r4, lsl r7
    233c:	005ba205 	subseq	sl, fp, r5, lsl #4
    2340:	23020000 	movwcs	r0, #8192	; 0x2000
    2344:	997f0806 	ldmdbls	pc!, {r1, r2, fp}^	; <UNPREDICTABLE>
    2348:	a5050000 	strge	r0, [r5, #-0]
    234c:	0000005b 	andeq	r0, r0, fp, asr r0
    2350:	08082302 	stmdaeq	r8, {r1, r8, r9, sp}
    2354:	00009a1c 	andeq	r9, r0, ip, lsl sl
    2358:	005ba805 	subseq	sl, fp, r5, lsl #16
    235c:	23020000 	movwcs	r0, #8192	; 0x2000
    2360:	95b0080a 	ldrls	r0, [r0, #2058]!	; 0x80a
    2364:	ab050000 	blge	14236c <_Min_Stack_Size+0x141f6c>
    2368:	0000005b 	andeq	r0, r0, fp, asr r0
    236c:	080c2302 	stmdaeq	ip, {r1, r8, r9, sp}
    2370:	00009892 	muleq	r0, r2, r8
    2374:	005bae05 	subseq	sl, fp, r5, lsl #28
    2378:	23020000 	movwcs	r0, #8192	; 0x2000
    237c:	9646080e 	strbls	r0, [r6], -lr, lsl #16
    2380:	b1050000 	mrslt	r0, (UNDEF: 5)
    2384:	0000005b 	andeq	r0, r0, fp, asr r0
    2388:	08102302 	ldmdaeq	r0, {r1, r8, r9, sp}
    238c:	00009843 	andeq	r9, r0, r3, asr #16
    2390:	005bb405 	subseq	fp, fp, r5, lsl #8
    2394:	23020000 	movwcs	r0, #8192	; 0x2000
    2398:	93b60812 			; <UNDEFINED> instruction: 0x93b60812
    239c:	b7050000 	strlt	r0, [r5, -r0]
    23a0:	0000005b 	andeq	r0, r0, fp, asr r0
    23a4:	08142302 	ldmdaeq	r4, {r1, r8, r9, sp}
    23a8:	000048fc 	strdeq	r4, [r0], -ip
    23ac:	0349ba05 	movteq	fp, #39429	; 0x9a05
    23b0:	23020000 	movwcs	r0, #8192	; 0x2000
    23b4:	04090018 	streq	r0, [r9], #-24	; 0xffffffe8
    23b8:	00000241 	andeq	r0, r0, r1, asr #4
    23bc:	0409010a 	streq	r0, [r9], #-266	; 0xfffffef6
    23c0:	00000347 	andeq	r0, r0, r7, asr #6
    23c4:	0094a503 	addseq	sl, r4, r3, lsl #10
    23c8:	9ebd0500 	cdpls	5, 11, cr0, cr13, cr0, {0}
    23cc:	0b000002 	bleq	23dc <_Min_Stack_Size+0x1fdc>
    23d0:	004d0107 	subeq	r0, sp, r7, lsl #2
    23d4:	c1050000 	mrsgt	r0, (UNDEF: 5)
    23d8:	00000374 	andeq	r0, r0, r4, ror r3
    23dc:	0094910c 	addseq	r9, r4, ip, lsl #2
    23e0:	6a0c0000 	bvs	3023e8 <_Min_Stack_Size+0x301fe8>
    23e4:	01000093 	swpeq	r0, r3, [r0]	; <UNPREDICTABLE>
    23e8:	97730300 	ldrbls	r0, [r3, -r0, lsl #6]!
    23ec:	c4050000 	strgt	r0, [r5], #-0
    23f0:	0000035a 	andeq	r0, r0, sl, asr r3
    23f4:	0003490d 	andeq	r4, r3, sp, lsl #18
    23f8:	00038f00 	andeq	r8, r3, r0, lsl #30
    23fc:	00740e00 	rsbseq	r0, r4, r0, lsl #28
    2400:	00030000 	andeq	r0, r3, r0
    2404:	0048fa0f 	subeq	pc, r8, pc, lsl #20
    2408:	7f130100 	svcvc	0x00130100
    240c:	05000003 	streq	r0, [r0, #-3]
    2410:	00007c03 	andeq	r7, r0, r3, lsl #24
    2414:	f2011020 	vhadd.s8	d1, d1, d16
    2418:	01000099 	swpeq	r0, r9, [r0]	; <UNPREDICTABLE>
    241c:	440101ed 	strmi	r0, [r1], #-493	; 0xfffffe13
    2420:	5808000f 	stmdapl	r8, {r0, r1, r2, r3}
    2424:	1a08000f 	bne	202468 <_Min_Stack_Size+0x202068>
    2428:	01000011 	tsteq	r0, r1, lsl r0
    242c:	97c40110 	bfils	r0, r0, #2, #3
    2430:	e7010000 	str	r0, [r1, -r0]
    2434:	0f300101 	svceq	0x00300101
    2438:	0f440800 	svceq	0x00440800
    243c:	11460800 	cmpne	r6, r0, lsl #16
    2440:	11010000 	mrsne	r0, (UNDEF: 1)
    2444:	00947a01 	addseq	r7, r4, r1, lsl #20
    2448:	01d30100 	bicseq	r0, r3, r0, lsl #2
    244c:	00000001 	andeq	r0, r0, r1
    2450:	00000000 	andeq	r0, r0, r0
    2454:	00117200 	andseq	r7, r1, r0, lsl #4
    2458:	04340100 	ldrteq	r0, [r4], #-256	; 0xffffff00
    245c:	38120000 	ldmdacc	r2, {}	; <UNPREDICTABLE>
    2460:	01000096 	swpeq	r0, r6, [r0]	; <UNPREDICTABLE>
    2464:	043401d3 	ldrteq	r0, [r4], #-467	; 0xfffffe2d
    2468:	91020000 	mrsls	r0, (UNDEF: 2)
    246c:	7453136c 	ldrbvc	r1, [r3], #-876	; 0xfffffc94
    2470:	d3010072 	movwle	r0, #4210	; 0x1072
    2474:	00043a01 	andeq	r3, r4, r1, lsl #20
    2478:	68910200 	ldmvs	r1, {r9}
    247c:	01006914 	tsteq	r0, r4, lsl r9
    2480:	004201d6 	ldrdeq	r0, [r2], #-22	; 0xffffffea
    2484:	91020000 	mrsls	r0, (UNDEF: 2)
    2488:	987b1577 	ldmdals	fp!, {r0, r1, r2, r4, r5, r6, r8, sl, ip}^
    248c:	d7010000 	strle	r0, [r1, -r0]
    2490:	00005b01 	andeq	r5, r0, r1, lsl #22
    2494:	74910200 	ldrvc	r0, [r1], #512	; 0x200
    2498:	935b0116 	cmpls	fp, #-2147483643	; 0x80000005
    249c:	bd010000 	stclt	0, cr0, [r1, #-0]
    24a0:	00006d01 	andeq	r6, r0, r1, lsl #26
    24a4:	00170100 	andseq	r0, r7, r0, lsl #2
    24a8:	4f040900 	svcmi	0x00040900
    24ac:	09000003 	stmdbeq	r0, {r0, r1}
    24b0:	00004204 	andeq	r4, r0, r4, lsl #4
    24b4:	6c011100 	stfvss	f1, [r1], {-0}
    24b8:	01000096 	swpeq	r0, r6, [r0]	; <UNPREDICTABLE>
    24bc:	000101b5 			; <UNDEFINED> instruction: 0x000101b5
    24c0:	00000000 	andeq	r0, r0, r0
    24c4:	c2000000 	andgt	r0, r0, #0
    24c8:	01000011 	tsteq	r0, r1, lsl r0
    24cc:	000004b0 			; <UNDEFINED> instruction: 0x000004b0
    24d0:	00963812 	addseq	r3, r6, r2, lsl r8
    24d4:	01b50100 			; <UNDEFINED> instruction: 0x01b50100
    24d8:	00000434 	andeq	r0, r0, r4, lsr r4
    24dc:	136c9102 	cmnne	ip, #-2147483648	; 0x80000000
    24e0:	00727453 	rsbseq	r7, r2, r3, asr r4
    24e4:	3a01b501 	bcc	6f8f0 <_Min_Stack_Size+0x6f4f0>
    24e8:	02000004 	andeq	r0, r0, #4
    24ec:	69146891 	ldmdbvs	r4, {r0, r4, r7, fp, sp, lr}
    24f0:	01b80100 			; <UNDEFINED> instruction: 0x01b80100
    24f4:	00000042 	andeq	r0, r0, r2, asr #32
    24f8:	15779102 	ldrbne	r9, [r7, #-258]!	; 0xfffffefe
    24fc:	0000987b 	andeq	r9, r0, fp, ror r8
    2500:	5b01b901 	blpl	7090c <_Min_Stack_Size+0x7050c>
    2504:	02000000 	andeq	r0, r0, #0
    2508:	00187491 	mulseq	r8, r1, r4
    250c:	00000000 	andeq	r0, r0, r0
    2510:	16000000 	strne	r0, [r0], -r0
    2514:	00935b01 	addseq	r5, r3, r1, lsl #22
    2518:	01bd0100 			; <UNDEFINED> instruction: 0x01bd0100
    251c:	0000006d 	andeq	r0, r0, sp, rrx
    2520:	00001701 	andeq	r1, r0, r1, lsl #14
    2524:	02011100 	andeq	r1, r1, #0, 2
    2528:	0100009a 	swpeq	r0, sl, [r0]	; <UNPREDICTABLE>
    252c:	0001019d 	muleq	r1, sp, r1
    2530:	00000000 	andeq	r0, r0, r0
    2534:	12000000 	andne	r0, r0, #0
    2538:	01000012 	tsteq	r0, r2, lsl r0
    253c:	000004f9 	strdeq	r0, [r0], -r9
    2540:	00963812 	addseq	r3, r6, r2, lsl r8
    2544:	019d0100 	orrseq	r0, sp, r0, lsl #2
    2548:	00000434 	andeq	r0, r0, r4, lsr r4
    254c:	12749102 	rsbsne	r9, r4, #-2147483648	; 0x80000000
    2550:	00009038 	andeq	r9, r0, r8, lsr r0
    2554:	f9019d01 			; <UNDEFINED> instruction: 0xf9019d01
    2558:	02000004 	andeq	r0, r0, #4
    255c:	05127091 	ldreq	r7, [r2, #-145]	; 0xffffff6f
    2560:	01000097 	swpeq	r0, r7, [r0]	; <UNPREDICTABLE>
    2564:	0374019d 	cmneq	r4, #1073741863	; 0x40000027
    2568:	91020000 	mrsls	r0, (UNDEF: 2)
    256c:	0409006f 	streq	r0, [r9], #-111	; 0xffffff91
    2570:	0000005b 	andeq	r0, r0, fp, asr r0
    2574:	94240119 	strtls	r0, [r4], #-281	; 0xfffffee7
    2578:	84010000 	strhi	r0, [r1], #-0
    257c:	00000101 	andeq	r0, r0, r1, lsl #2
    2580:	00000000 	andeq	r0, r0, r0
    2584:	12620000 	rsbne	r0, r2, #0
    2588:	48010000 	stmdami	r1, {}	; <UNPREDICTABLE>
    258c:	12000005 	andne	r0, r0, #5
    2590:	00009638 	andeq	r9, r0, r8, lsr r6
    2594:	34018401 	strcc	r8, [r1], #-1025	; 0xfffffbff
    2598:	02000004 	andeq	r0, r0, #4
    259c:	38127491 	ldmdacc	r2, {r0, r4, r7, sl, ip, sp, lr}
    25a0:	01000090 	swpeq	r0, r0, [r0]	; <UNPREDICTABLE>
    25a4:	04f90184 	ldrbteq	r0, [r9], #388	; 0x184
    25a8:	91020000 	mrsls	r0, (UNDEF: 2)
    25ac:	97051270 	smlsdxls	r5, r0, r2, r1
    25b0:	84010000 	strhi	r0, [r1], #-0
    25b4:	00037401 	andeq	r7, r3, r1, lsl #8
    25b8:	6f910200 	svcvs	0x00910200
    25bc:	f3011900 	vmls.i8	d1, d1, d0
    25c0:	01000096 	swpeq	r0, r6, [r0]	; <UNPREDICTABLE>
    25c4:	00010164 	andeq	r0, r1, r4, ror #2
    25c8:	00000000 	andeq	r0, r0, r0
    25cc:	be000000 	cdplt	0, 0, cr0, cr0, cr0, {0}
    25d0:	01000012 	tsteq	r0, r2, lsl r0
    25d4:	00000591 	muleq	r0, r1, r5
    25d8:	00963812 	addseq	r3, r6, r2, lsl r8
    25dc:	01640100 	cmneq	r4, r0, lsl #2
    25e0:	00000434 	andeq	r0, r0, r4, lsr r4
    25e4:	12749102 	rsbsne	r9, r4, #-2147483648	; 0x80000000
    25e8:	00009038 	andeq	r9, r0, r8, lsr r0
    25ec:	f9016401 			; <UNDEFINED> instruction: 0xf9016401
    25f0:	02000004 	andeq	r0, r0, #4
    25f4:	05127091 	ldreq	r7, [r2, #-145]	; 0xffffff6f
    25f8:	01000097 	swpeq	r0, r7, [r0]	; <UNPREDICTABLE>
    25fc:	03740164 	cmneq	r4, #100, 2
    2600:	91020000 	mrsls	r0, (UNDEF: 2)
    2604:	011a006f 	tsteq	sl, pc, rrx
    2608:	00009656 	andeq	r9, r0, r6, asr r6
    260c:	0001b301 	andeq	fp, r1, r1, lsl #6
    2610:	00000000 	andeq	r0, r0, r0
    2614:	1a000000 	bne	261c <_Min_Stack_Size+0x221c>
    2618:	01000013 	tsteq	r0, r3, lsl r0
    261c:	000005f2 	strdeq	r0, [r0], -r2
    2620:	0096381b 	addseq	r3, r6, fp, lsl r8
    2624:	34b30100 	ldrtcc	r0, [r3], #256	; 0x100
    2628:	02000004 	andeq	r0, r0, #4
    262c:	7a0f5491 	bvc	3d7878 <_Min_Stack_Size+0x3d7478>
    2630:	01000099 	swpeq	r0, r9, [r0]	; <UNPREDICTABLE>
    2634:	000293b5 			; <UNDEFINED> instruction: 0x000293b5
    2638:	70910200 	addsvc	r0, r1, r0, lsl #4
    263c:	00978b0f 	addseq	r8, r7, pc, lsl #22
    2640:	93b50100 			; <UNDEFINED> instruction: 0x93b50100
    2644:	02000002 	andeq	r0, r0, #2
    2648:	531c6891 	tstpl	ip, #9502720	; 0x910000
    264c:	01004b43 	tsteq	r0, r3, asr #22
    2650:	000293b5 			; <UNDEFINED> instruction: 0x000293b5
    2654:	60910200 	addsvs	r0, r1, r0, lsl #4
    2658:	53534e1c 	cmppl	r3, #28, 28	; 0x1c0
    265c:	93b50100 			; <UNDEFINED> instruction: 0x93b50100
    2660:	02000002 	andeq	r0, r0, #2
    2664:	1d005891 	stcne	8, cr5, [r0, #-580]	; 0xfffffdbc
    2668:	00972101 	addseq	r2, r7, r1, lsl #2
    266c:	01870100 	orreq	r0, r7, r0, lsl #2
	...
    2678:	0000136a 	andeq	r1, r0, sl, ror #6
    267c:	00061b01 	andeq	r1, r6, r1, lsl #22
    2680:	96381b00 	ldrtls	r1, [r8], -r0, lsl #22
    2684:	87010000 	strhi	r0, [r1, -r0]
    2688:	00000434 	andeq	r0, r0, r4, lsr r4
    268c:	00749102 	rsbseq	r9, r4, r2, lsl #2
    2690:	9884011e 	stmls	r4, {r1, r2, r3, r4, r8}
    2694:	26010000 	strcs	r0, [r1], -r0
    2698:	00000001 	andeq	r0, r0, r1
    269c:	00000000 	andeq	r0, r0, r0
    26a0:	0013c600 	andseq	ip, r3, r0, lsl #12
    26a4:	381b0100 	ldmdacc	fp, {r8}
    26a8:	01000096 	swpeq	r0, r6, [r0]	; <UNPREDICTABLE>
    26ac:	00043426 	andeq	r3, r4, r6, lsr #8
    26b0:	6c910200 	lfmvs	f0, 4, [r1], {0}
    26b4:	0097310f 	addseq	r3, r7, pc, lsl #2
    26b8:	5b290100 	blpl	a42ac0 <_Min_Stack_Size+0xa426c0>
    26bc:	02000000 	andeq	r0, r0, #0
    26c0:	7d0f7691 	stcvc	6, cr7, [pc, #-580]	; 2484 <_Min_Stack_Size+0x2084>
    26c4:	01000093 	swpeq	r0, r3, [r0]	; <UNPREDICTABLE>
    26c8:	00005b2a 	andeq	r5, r0, sl, lsr #22
    26cc:	74910200 	ldrvc	r0, [r1], #512	; 0x200
    26d0:	06920000 	ldreq	r0, [r2], r0
    26d4:	00020000 	andeq	r0, r2, r0
    26d8:	00000837 	andeq	r0, r0, r7, lsr r8
    26dc:	65760104 	ldrbvs	r0, [r6, #-260]!	; 0xfffffefc
    26e0:	9f0c0000 	svcls	0x000c0000
    26e4:	0800009a 	stmdaeq	r0, {r1, r3, r4, r7}
    26e8:	3000004d 	andcc	r0, r0, sp, asr #32
    26ec:	00000002 	andeq	r0, r0, r2
    26f0:	00000000 	andeq	r0, r0, r0
    26f4:	a4000000 	strge	r0, [r0], #-0
    26f8:	1700000d 	strne	r0, [r0, -sp]
    26fc:	02000005 	andeq	r0, r0, #5
    2700:	2a740201 	bcs	1d02f0c <_Min_Stack_Size+0x1d02b0c>
    2704:	01020000 	mrseq	r0, (UNDEF: 2)
    2708:	0004e108 	andeq	lr, r4, r8, lsl #2
    270c:	06010200 	streq	r0, [r1], -r0, lsl #4
    2710:	000004da 	ldrdeq	r0, [r0], -sl
    2714:	004fe103 	subeq	lr, pc, r3, lsl #2
    2718:	4d140200 	lfmmi	f0, 4, [r4, #-0]
    271c:	02000000 	andeq	r0, r0, #0
    2720:	48ac0801 	stmiami	ip!, {r0, fp}
    2724:	02020000 	andeq	r0, r2, #0
    2728:	00060d05 	andeq	r0, r6, r5, lsl #26
    272c:	804c0300 	subhi	r0, ip, r0, lsl #6
    2730:	16020000 	strne	r0, [r2], -r0
    2734:	00000066 	andeq	r0, r0, r6, rrx
    2738:	ca070202 	bgt	1c2f48 <_Min_Stack_Size+0x1c2b48>
    273c:	04000051 	streq	r0, [r0], #-81	; 0xffffffaf
    2740:	6e690504 	cdpvs	5, 6, cr0, cr9, cr4, {0}
    2744:	89030074 	stmdbhi	r3, {r2, r4, r5, r6}
    2748:	02000000 	andeq	r0, r0, #0
    274c:	00007f18 	andeq	r7, r0, r8, lsl pc
    2750:	07040200 	streq	r0, [r4, -r0, lsl #4]
    2754:	00002840 	andeq	r2, r0, r0, asr #16
    2758:	00007f05 	andeq	r7, r0, r5, lsl #30
    275c:	05080200 	streq	r0, [r8, #-512]	; 0xfffffe00
    2760:	000041fc 	strdeq	r4, [r0], -ip
    2764:	fe070802 	vcmla.f16	d0, d7, d2[0], #0
    2768:	03000058 	movweq	r0, #88	; 0x58
    276c:	00000088 	andeq	r0, r0, r8, lsl #1
    2770:	00862202 	addeq	r2, r6, r2, lsl #4
    2774:	04020000 	streq	r0, [r2], #-0
    2778:	00648d04 	rsbeq	r8, r4, r4, lsl #26
    277c:	04080200 	streq	r0, [r8], #-512	; 0xfffffe00
    2780:	0000418b 	andeq	r4, r0, fp, lsl #3
    2784:	7c032806 	stcvc	8, cr2, [r3], {6}
    2788:	00000146 	andeq	r0, r0, r6, asr #2
    278c:	00524307 	subseq	r4, r2, r7, lsl #6
    2790:	00997d03 	addseq	r7, r9, r3, lsl #26
    2794:	23020000 	movwcs	r0, #8192	; 0x2000
    2798:	98ae0800 	stmials	lr!, {fp}
    279c:	7e030000 	cdpvc	0, 0, cr0, cr3, cr0, {0}
    27a0:	00000099 	muleq	r0, r9, r0
    27a4:	07042302 	streq	r2, [r4, -r2, lsl #6]
    27a8:	00524943 	subseq	r4, r2, r3, asr #18
    27ac:	00997f03 	addseq	r7, r9, r3, lsl #30
    27b0:	23020000 	movwcs	r0, #8192	; 0x2000
    27b4:	6a2f0808 	bvs	bc47dc <_Min_Stack_Size+0xbc43dc>
    27b8:	80030000 	andhi	r0, r3, r0
    27bc:	00000099 	muleq	r0, r9, r0
    27c0:	080c2302 	stmdaeq	ip, {r1, r8, r9, sp}
    27c4:	00006a48 	andeq	r6, r0, r8, asr #20
    27c8:	00998103 	addseq	r8, r9, r3, lsl #2
    27cc:	23020000 	movwcs	r0, #8192	; 0x2000
    27d0:	6a380810 	bvs	e04818 <_Min_Stack_Size+0xe04418>
    27d4:	82030000 	andhi	r0, r3, #0
    27d8:	00000099 	muleq	r0, r9, r0
    27dc:	08142302 	ldmdaeq	r4, {r1, r8, r9, sp}
    27e0:	00006af3 	strdeq	r6, [r0], -r3
    27e4:	00998303 	addseq	r8, r9, r3, lsl #6
    27e8:	23020000 	movwcs	r0, #8192	; 0x2000
    27ec:	6a0b0818 	bvs	2c4854 <_Min_Stack_Size+0x2c4454>
    27f0:	84030000 	strhi	r0, [r3], #-0
    27f4:	00000099 	muleq	r0, r9, r0
    27f8:	081c2302 	ldmdaeq	ip, {r1, r8, r9, sp}
    27fc:	00006a06 	andeq	r6, r0, r6, lsl #20
    2800:	00998503 	addseq	r8, r9, r3, lsl #10
    2804:	23020000 	movwcs	r0, #8192	; 0x2000
    2808:	53430720 	movtpl	r0, #14112	; 0x3720
    280c:	86030052 			; <UNDEFINED> instruction: 0x86030052
    2810:	00000099 	muleq	r0, r9, r0
    2814:	00242302 	eoreq	r2, r4, r2, lsl #6
    2818:	006a2303 	rsbeq	r2, sl, r3, lsl #6
    281c:	b2870300 	addlt	r0, r7, #0, 6
    2820:	06000000 	streq	r0, [r0], -r0
    2824:	bca0031c 	stclt	3, cr0, [r0], #112	; 0x70
    2828:	07000001 	streq	r0, [r0, -r1]
    282c:	004c5243 	subeq	r5, ip, r3, asr #4
    2830:	0099a103 	addseq	sl, r9, r3, lsl #2
    2834:	23020000 	movwcs	r0, #8192	; 0x2000
    2838:	52430700 	subpl	r0, r3, #0, 14
    283c:	a2030048 	andge	r0, r3, #72	; 0x48
    2840:	00000099 	muleq	r0, r9, r0
    2844:	07042302 	streq	r2, [r4, -r2, lsl #6]
    2848:	00524449 	subseq	r4, r2, r9, asr #8
    284c:	0099a303 	addseq	sl, r9, r3, lsl #6
    2850:	23020000 	movwcs	r0, #8192	; 0x2000
    2854:	444f0708 	strbmi	r0, [pc], #-1800	; 285c <_Min_Stack_Size+0x245c>
    2858:	a4030052 	strge	r0, [r3], #-82	; 0xffffffae
    285c:	00000099 	muleq	r0, r9, r0
    2860:	080c2302 	stmdaeq	ip, {r1, r8, r9, sp}
    2864:	00005d9c 	muleq	r0, ip, sp
    2868:	0099a503 	addseq	sl, r9, r3, lsl #10
    286c:	23020000 	movwcs	r0, #8192	; 0x2000
    2870:	52420710 	subpl	r0, r2, #16, 14	; 0x400000
    2874:	a6030052 			; <UNDEFINED> instruction: 0xa6030052
    2878:	00000099 	muleq	r0, r9, r0
    287c:	08142302 	ldmdaeq	r4, {r1, r8, r9, sp}
    2880:	00003b1b 	andeq	r3, r0, fp, lsl fp
    2884:	0099a703 	addseq	sl, r9, r3, lsl #14
    2888:	23020000 	movwcs	r0, #8192	; 0x2000
    288c:	43030018 	movwmi	r0, #12312	; 0x3018
    2890:	03000030 	movweq	r0, #48	; 0x30
    2894:	000151a8 	andeq	r5, r1, r8, lsr #3
    2898:	031c0600 	tsteq	ip, #0, 12
    289c:	000230c2 	andeq	r3, r2, r2, asr #1
    28a0:	52530700 	subspl	r0, r3, #0, 14
    28a4:	99c30300 	stmibls	r3, {r8, r9}^
    28a8:	02000000 	andeq	r0, r0, #0
    28ac:	44070023 	strmi	r0, [r7], #-35	; 0xffffffdd
    28b0:	c4030052 	strgt	r0, [r3], #-82	; 0xffffffae
    28b4:	00000099 	muleq	r0, r9, r0
    28b8:	07042302 	streq	r2, [r4, -r2, lsl #6]
    28bc:	00525242 	subseq	r5, r2, r2, asr #4
    28c0:	0099c503 	addseq	ip, r9, r3, lsl #10
    28c4:	23020000 	movwcs	r0, #8192	; 0x2000
    28c8:	52430708 	subpl	r0, r3, #8, 14	; 0x200000
    28cc:	c6030031 			; <UNDEFINED> instruction: 0xc6030031
    28d0:	00000099 	muleq	r0, r9, r0
    28d4:	070c2302 	streq	r2, [ip, -r2, lsl #6]
    28d8:	00325243 	eorseq	r5, r2, r3, asr #4
    28dc:	0099c703 	addseq	ip, r9, r3, lsl #14
    28e0:	23020000 	movwcs	r0, #8192	; 0x2000
    28e4:	52430710 	subpl	r0, r3, #16, 14	; 0x400000
    28e8:	c8030033 	stmdagt	r3, {r0, r1, r4, r5}
    28ec:	00000099 	muleq	r0, r9, r0
    28f0:	08142302 	ldmdaeq	r4, {r1, r8, r9, sp}
    28f4:	00009b6b 	andeq	r9, r0, fp, ror #22
