mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    28f8:	0099c903 	addseq	ip, r9, r3, lsl #18
    28fc:	23020000 	movwcs	r0, #8192	; 0x2000
    2900:	af030018 	svcge	0x00030018
    2904:	0300009a 	movweq	r0, #154	; 0x9a
    2908:	0001c7ca 	andeq	ip, r1, sl, asr #15
    290c:	04080600 	streq	r0, [r8], #-1536	; 0xfffffa00
    2910:	00027c5f 	andeq	r7, r2, pc, asr ip
    2914:	51dd0800 	bicspl	r0, sp, r0, lsl #16
    2918:	60040000 	andvs	r0, r4, r0
    291c:	0000027c 	andeq	r0, r0, ip, ror r2
    2920:	08002302 	stmdaeq	r0, {r1, r8, r9, sp}
    2924:	00003aee 	andeq	r3, r0, lr, ror #21
    2928:	005b6304 	subseq	r6, fp, r4, lsl #6
    292c:	23020000 	movwcs	r0, #8192	; 0x2000
    2930:	52dc0804 	sbcspl	r0, ip, #4, 16	; 0x40000
    2934:	66040000 	strvs	r0, [r4], -r0
    2938:	00000042 	andeq	r0, r0, r2, asr #32
    293c:	08062302 	stmdaeq	r6, {r1, r8, r9, sp}
    2940:	00000145 	andeq	r0, r0, r5, asr #2
    2944:	00426904 	subeq	r6, r2, r4, lsl #18
    2948:	23020000 	movwcs	r0, #8192	; 0x2000
    294c:	04090007 	streq	r0, [r9], #-7
    2950:	000001bc 			; <UNDEFINED> instruction: 0x000001bc
    2954:	002e1e03 	eoreq	r1, lr, r3, lsl #28
    2958:	3b6d0400 	blcc	1b43960 <_Min_Stack_Size+0x1b43560>
    295c:	06000002 	streq	r0, [r0], -r2
    2960:	14850524 	strne	r0, [r5], #1316	; 0x524
    2964:	08000003 	stmdaeq	r0, {r0, r1}
    2968:	00009f58 	andeq	r9, r0, r8, asr pc
    296c:	03148705 	tsteq	r4, #1310720	; 0x140000
    2970:	23020000 	movwcs	r0, #8192	; 0x2000
    2974:	9e080800 	cdpls	8, 0, cr0, cr8, cr0, {0}
    2978:	8a050000 	bhi	142980 <_Min_Stack_Size+0x142580>
    297c:	00000074 	andeq	r0, r0, r4, ror r0
    2980:	08042302 	stmdaeq	r4, {r1, r8, r9, sp}
    2984:	00009b7d 	andeq	r9, r0, sp, ror fp
    2988:	00748d05 	rsbseq	r8, r4, r5, lsl #26
    298c:	23020000 	movwcs	r0, #8192	; 0x2000
    2990:	9b080808 	blls	2049b8 <_Min_Stack_Size+0x2045b8>
    2994:	90050000 	andls	r0, r5, r0
    2998:	00000074 	andeq	r0, r0, r4, ror r0
    299c:	080c2302 	stmdaeq	ip, {r1, r8, r9, sp}
    29a0:	0000a04d 	andeq	sl, r0, sp, asr #32
    29a4:	00749305 	rsbseq	r9, r4, r5, lsl #6
    29a8:	23020000 	movwcs	r0, #8192	; 0x2000
    29ac:	9b190810 	blls	6449f4 <_Min_Stack_Size+0x6445f4>
    29b0:	96050000 	strls	r0, [r5], -r0
    29b4:	00000074 	andeq	r0, r0, r4, ror r0
    29b8:	08142302 	ldmdaeq	r4, {r1, r8, r9, sp}
    29bc:	00009d4e 	andeq	r9, r0, lr, asr #26
    29c0:	00749905 	rsbseq	r9, r4, r5, lsl #18
    29c4:	23020000 	movwcs	r0, #8192	; 0x2000
    29c8:	9f940818 	svcls	0x00940818
    29cc:	9c050000 	stcls	0, cr0, [r5], {-0}
    29d0:	00000074 	andeq	r0, r0, r4, ror r0
    29d4:	081c2302 	ldmdaeq	ip, {r1, r8, r9, sp}
    29d8:	000048fc 	strdeq	r4, [r0], -ip
    29dc:	031c9f05 	tsteq	ip, #5, 30
    29e0:	23020000 	movwcs	r0, #8192	; 0x2000
    29e4:	04090020 	streq	r0, [r9], #-32	; 0xffffffe0
    29e8:	00000230 	andeq	r0, r0, r0, lsr r2
    29ec:	0409010a 	streq	r0, [r9], #-266	; 0xfffffef6
    29f0:	0000031a 	andeq	r0, r0, sl, lsl r3
    29f4:	009bb003 	addseq	fp, fp, r3
    29f8:	8da20500 	cfstr32hi	mvfx0, [r2]
    29fc:	0b000002 	bleq	2a0c <_Min_Stack_Size+0x260c>
    2a00:	004d0107 	subeq	r0, sp, r7, lsl #2
    2a04:	a6050000 	strge	r0, [r5], -r0
    2a08:	00000347 	andeq	r0, r0, r7, asr #6
    2a0c:	009c4a0c 	addseq	r4, ip, ip, lsl #20
    2a10:	c90c0000 	stmdbgt	ip, {}	; <UNPREDICTABLE>
    2a14:	0100009f 	swpeq	r0, pc, [r0]	; <UNPREDICTABLE>
    2a18:	9dee0300 	stclls	3, cr0, [lr]
    2a1c:	a9050000 	stmdbge	r5, {}	; <UNPREDICTABLE>
    2a20:	0000032d 	andeq	r0, r0, sp, lsr #6
    2a24:	00031c0d 	andeq	r1, r3, sp, lsl #24
    2a28:	00036200 	andeq	r6, r3, r0, lsl #4
    2a2c:	007f0e00 	rsbseq	r0, pc, r0, lsl #28
    2a30:	00020000 	andeq	r0, r2, r0
    2a34:	0048fa0f 	subeq	pc, r8, pc, lsl #20
    2a38:	52130100 	andspl	r0, r3, #0, 2
    2a3c:	05000003 	streq	r0, [r0, #-3]
    2a40:	00008c03 	andeq	r8, r0, r3, lsl #24
    2a44:	0f011020 	svceq	0x00011020
    2a48:	0100009c 	swpeq	r0, ip, [r0]	; <UNPREDICTABLE>
    2a4c:	800101be 			; <UNDEFINED> instruction: 0x800101be
    2a50:	9408000f 	strls	r0, [r8], #-15
    2a54:	2208000f 	andcs	r0, r8, #15
    2a58:	01000014 	tsteq	r0, r4, lsl r0
    2a5c:	a0c90110 	sbcge	r0, r9, r0, lsl r1
    2a60:	b8010000 	stmdalt	r1, {}	; <UNPREDICTABLE>
    2a64:	0f6c0101 	svceq	0x006c0101
    2a68:	0f800800 	svceq	0x00800800
    2a6c:	144e0800 	strbne	r0, [lr], #-2048	; 0xfffff800
    2a70:	10010000 	andne	r0, r1, r0
    2a74:	009f5f01 	addseq	r5, pc, r1, lsl #30
    2a78:	01b20100 			; <UNDEFINED> instruction: 0x01b20100
    2a7c:	000f5801 	andeq	r5, pc, r1, lsl #16
    2a80:	000f6c08 	andeq	r6, pc, r8, lsl #24
    2a84:	00147a08 	andseq	r7, r4, r8, lsl #20
    2a88:	01110100 	tsteq	r1, r0, lsl #2
    2a8c:	00009b9e 	muleq	r0, lr, fp
    2a90:	0101a701 	tsteq	r1, r1, lsl #14
	...
    2a9c:	000014a6 	andeq	r1, r0, r6, lsr #9
    2aa0:	0003e301 	andeq	lr, r3, r1, lsl #6
    2aa4:	9f711200 	svcls	0x00711200
    2aa8:	a7010000 	strge	r0, [r1, -r0]
    2aac:	0003e301 	andeq	lr, r3, r1, lsl #6
    2ab0:	74910200 	ldrvc	r0, [r1], #512	; 0x200
    2ab4:	22040900 	andcs	r0, r4, #0, 18
    2ab8:	11000003 	tstne	r0, r3
    2abc:	009b8c01 	addseq	r8, fp, r1, lsl #24
    2ac0:	016f0100 	cmneq	pc, r0, lsl #2
    2ac4:	00000001 	andeq	r0, r0, r1
    2ac8:	00000000 	andeq	r0, r0, r0
    2acc:	00150200 	andseq	r0, r5, r0, lsl #4
    2ad0:	04320100 	ldrteq	r0, [r2], #-256	; 0xffffff00
    2ad4:	71120000 	tstvc	r2, r0
    2ad8:	0100009f 	swpeq	r0, pc, [r0]	; <UNPREDICTABLE>
    2adc:	03e3016f 	mvneq	r0, #-1073741797	; 0xc000001b
    2ae0:	91020000 	mrsls	r0, (UNDEF: 2)
    2ae4:	90381274 	eorsls	r1, r8, r4, ror r2
    2ae8:	6f010000 	svcvs	0x00010000
    2aec:	00043201 	andeq	r3, r4, r1, lsl #4
    2af0:	70910200 	addsvc	r0, r1, r0, lsl #4
    2af4:	00970512 	addseq	r0, r7, r2, lsl r5
    2af8:	016f0100 	cmneq	pc, r0, lsl #2
    2afc:	00000347 	andeq	r0, r0, r7, asr #6
    2b00:	006f9102 	rsbeq	r9, pc, r2, lsl #2
    2b04:	005b0409 	subseq	r0, fp, r9, lsl #8
    2b08:	01110000 	tsteq	r1, r0
    2b0c:	00009e9e 	muleq	r0, lr, lr
    2b10:	01014101 	tsteq	r1, r1, lsl #2
	...
    2b1c:	0000155e 	andeq	r1, r0, lr, asr r5
    2b20:	00048101 	andeq	r8, r4, r1, lsl #2
    2b24:	9f711200 	svcls	0x00711200
    2b28:	41010000 	mrsmi	r0, (UNDEF: 1)
    2b2c:	0003e301 	andeq	lr, r3, r1, lsl #6
    2b30:	74910200 	ldrvc	r0, [r1], #512	; 0x200
    2b34:	00903812 	addseq	r3, r0, r2, lsl r8
    2b38:	01410100 	mrseq	r0, (UNDEF: 81)
    2b3c:	00000432 	andeq	r0, r0, r2, lsr r4
    2b40:	12709102 	rsbsne	r9, r0, #-2147483648	; 0x80000000
    2b44:	00009705 	andeq	r9, r0, r5, lsl #14
    2b48:	47014101 	strmi	r4, [r1, -r1, lsl #2]
    2b4c:	02000003 	andeq	r0, r0, #3
    2b50:	13006f91 	movwne	r6, #3985	; 0xf91
    2b54:	00a08101 	adceq	r8, r0, r1, lsl #2
    2b58:	01c40100 	biceq	r0, r4, r0, lsl #2
	...
    2b64:	000015ba 			; <UNDEFINED> instruction: 0x000015ba
    2b68:	00060101 	andeq	r0, r6, r1, lsl #2
    2b6c:	9f711400 	svcls	0x00711400
    2b70:	c4010000 	strgt	r0, [r1], #-0
    2b74:	000003e3 	andeq	r0, r0, r3, ror #7
    2b78:	7f949103 	svcvc	0x00949103
    2b7c:	00000015 	andeq	r0, r0, r5, lsl r0
    2b80:	00000000 	andeq	r0, r0, r0
    2b84:	0004c600 	andeq	ip, r4, r0, lsl #12
    2b88:	78541600 	ldmdavc	r4, {r9, sl, ip}^
    2b8c:	cd010031 	stcgt	0, cr0, [r1, #-196]	; 0xffffff3c
    2b90:	00000282 	andeq	r0, r0, r2, lsl #5
    2b94:	00709102 	rsbseq	r9, r0, r2, lsl #2
    2b98:	00000015 	andeq	r0, r0, r5, lsl r0
    2b9c:	00000000 	andeq	r0, r0, r0
    2ba0:	0004e200 	andeq	lr, r4, r0, lsl #4
    2ba4:	78521600 	ldmdavc	r2, {r9, sl, ip}^
    2ba8:	d4010031 	strle	r0, [r1], #-49	; 0xffffffcf
    2bac:	00000282 	andeq	r0, r0, r2, lsl #5
    2bb0:	00689102 	rsbeq	r9, r8, r2, lsl #2
    2bb4:	00000015 	andeq	r0, r0, r5, lsl r0
    2bb8:	00000000 	andeq	r0, r0, r0
    2bbc:	0004fe00 	andeq	pc, r4, r0, lsl #28
    2bc0:	9bdd0f00 	blls	ff7467c8 <_estack+0xdf7417c8>
    2bc4:	db010000 	blle	42bcc <_Min_Stack_Size+0x427cc>
    2bc8:	00000282 	andeq	r0, r0, r2, lsl #5
    2bcc:	00609102 	rsbeq	r9, r0, r2, lsl #2
    2bd0:	00000015 	andeq	r0, r0, r5, lsl r0
    2bd4:	00000000 	andeq	r0, r0, r0
    2bd8:	00051a00 	andeq	r1, r5, r0, lsl #20
    2bdc:	a03e0f00 	eorsge	r0, lr, r0, lsl #30
    2be0:	e2010000 	and	r0, r1, #0
    2be4:	00000282 	andeq	r0, r0, r2, lsl #5
    2be8:	00589102 	subseq	r9, r8, r2, lsl #2
    2bec:	00000015 	andeq	r0, r0, r5, lsl r0
    2bf0:	00000000 	andeq	r0, r0, r0
    2bf4:	00053600 	andeq	r3, r5, r0, lsl #12
    2bf8:	78541600 	ldmdavc	r4, {r9, sl, ip}^
    2bfc:	ef010032 	svc	0x00010032
    2c00:	00000282 	andeq	r0, r0, r2, lsl #5
    2c04:	00509102 	subseq	r9, r0, r2, lsl #2
    2c08:	00000015 	andeq	r0, r0, r5, lsl r0
    2c0c:	00000000 	andeq	r0, r0, r0
    2c10:	00055200 	andeq	r5, r5, r0, lsl #4
    2c14:	78521600 	ldmdavc	r2, {r9, sl, ip}^
    2c18:	f6010032 			; <UNDEFINED> instruction: 0xf6010032
    2c1c:	00000282 	andeq	r0, r0, r2, lsl #5
    2c20:	00489102 	subeq	r9, r8, r2, lsl #2
    2c24:	00000015 	andeq	r0, r0, r5, lsl r0
    2c28:	00000000 	andeq	r0, r0, r0
    2c2c:	00056e00 	andeq	r6, r5, r0, lsl #28
    2c30:	9be20f00 	blls	ff886838 <_estack+0xdf881838>
    2c34:	fd010000 	stc2	0, cr0, [r1, #-0]
    2c38:	00000282 	andeq	r0, r0, r2, lsl #5
    2c3c:	00409102 	subeq	r9, r0, r2, lsl #2
    2c40:	00000015 	andeq	r0, r0, r5, lsl r0
    2c44:	00000000 	andeq	r0, r0, r0
    2c48:	00058c00 	andeq	r8, r5, r0, lsl #24
    2c4c:	a0431700 	subge	r1, r3, r0, lsl #14
    2c50:	04010000 	streq	r0, [r1], #-0
    2c54:	00028201 	andeq	r8, r2, r1, lsl #4
    2c58:	b8910300 	ldmlt	r1, {r8, r9}
    2c5c:	0015007f 	andseq	r0, r5, pc, ror r0
    2c60:	00000000 	andeq	r0, r0, r0
    2c64:	aa000000 	bge	2c6c <_Min_Stack_Size+0x286c>
    2c68:	18000005 	stmdane	r0, {r0, r2}
    2c6c:	00337854 	eorseq	r7, r3, r4, asr r8
    2c70:	82011201 	andhi	r1, r1, #268435456	; 0x10000000
    2c74:	03000002 	movweq	r0, #2
    2c78:	007fb091 			; <UNDEFINED> instruction: 0x007fb091
    2c7c:	00000015 	andeq	r0, r0, r5, lsl r0
    2c80:	00000000 	andeq	r0, r0, r0
    2c84:	0005c800 	andeq	ip, r5, r0, lsl #16
    2c88:	78521800 	ldmdavc	r2, {fp, ip}^
    2c8c:	19010033 	stmdbne	r1, {r0, r1, r4, r5}
    2c90:	00028201 	andeq	r8, r2, r1, lsl #4
    2c94:	a8910300 	ldmge	r1, {r8, r9}
    2c98:	0015007f 	andseq	r0, r5, pc, ror r0
    2c9c:	00000000 	andeq	r0, r0, r0
    2ca0:	e6000000 	str	r0, [r0], -r0
    2ca4:	17000005 	strne	r0, [r0, -r5]
    2ca8:	00009be7 	andeq	r9, r0, r7, ror #23
    2cac:	82012001 	andhi	r2, r1, #1
    2cb0:	03000002 	movweq	r0, #2
    2cb4:	007fa091 			; <UNDEFINED> instruction: 0x007fa091
    2cb8:	00000019 	andeq	r0, r0, r9, lsl r0
    2cbc:	00000000 	andeq	r0, r0, r0
    2cc0:	a0481700 	subge	r1, r8, r0, lsl #14
    2cc4:	27010000 	strcs	r0, [r1, -r0]
    2cc8:	00028201 	andeq	r8, r2, r1, lsl #4
    2ccc:	98910300 	ldmls	r1, {r8, r9}
    2cd0:	1a00007f 	bne	2ed4 <_Min_Stack_Size+0x2ad4>
    2cd4:	009d3d01 	addseq	r3, sp, r1, lsl #26
    2cd8:	01920100 	orrseq	r0, r2, r0, lsl #2
	...
    2ce4:	0000160c 	andeq	r1, r0, ip, lsl #12
    2ce8:	00062a01 	andeq	r2, r6, r1, lsl #20
    2cec:	9f711400 	svcls	0x00711400
    2cf0:	92010000 	andls	r0, r1, #0
    2cf4:	000003e3 	andeq	r0, r0, r3, ror #7
    2cf8:	00749102 	rsbseq	r9, r4, r2, lsl #2
    2cfc:	9f12011b 	svcls	0x0012011b
    2d00:	26010000 	strcs	r0, [r1], -r0
    2d04:	00000001 	andeq	r0, r0, r1
    2d08:	00000000 	andeq	r0, r0, r0
    2d0c:	00166800 	andseq	r6, r6, r0, lsl #16
    2d10:	71140100 	tstvc	r4, r0, lsl #2
    2d14:	0100009f 	swpeq	r0, pc, [r0]	; <UNPREDICTABLE>
    2d18:	0003e326 	andeq	lr, r3, r6, lsr #6
    2d1c:	5c910200 	lfmpl	f0, 4, [r1], {0}
    2d20:	00a0980f 	adceq	r9, r0, pc, lsl #16
    2d24:	742b0100 	strtvc	r0, [fp], #-256	; 0xffffff00
    2d28:	02000000 	andeq	r0, r0, #0
    2d2c:	700f7491 	mulvc	pc, r1, r4	; <UNPREDICTABLE>
    2d30:	0100009b 	swpeq	r0, fp, [r0]	; <UNPREDICTABLE>
    2d34:	0000744e 	andeq	r7, r0, lr, asr #8
    2d38:	70910200 	addsvc	r0, r1, r0, lsl #4
    2d3c:	009ed70f 	addseq	sp, lr, pc, lsl #14
    2d40:	744f0100 	strbvc	r0, [pc], #-256	; 2d48 <_Min_Stack_Size+0x2948>
    2d44:	02000000 	andeq	r0, r0, #0
    2d48:	800f6c91 	mulhi	pc, r1, ip	; <UNPREDICTABLE>
    2d4c:	0100009f 	swpeq	r0, pc, [r0]	; <UNPREDICTABLE>
    2d50:	00007451 	andeq	r7, r0, r1, asr r4
    2d54:	68910200 	ldmvs	r1, {r9}
    2d58:	009c5f0f 	addseq	r5, ip, pc, lsl #30
    2d5c:	74520100 	ldrbvc	r0, [r2], #-256	; 0xffffff00
    2d60:	02000000 	andeq	r0, r0, #0
    2d64:	00006491 	muleq	r0, r1, r4
    2d68:	0000027e 	andeq	r0, r0, lr, ror r2
    2d6c:	09cd0002 	stmibeq	sp, {r1}^
    2d70:	01040000 	mrseq	r0, (UNDEF: 4)
    2d74:	00006576 	andeq	r6, r0, r6, ror r5
    2d78:	00a2f20c 	adceq	pc, r2, ip, lsl #4
    2d7c:	004d0800 	subeq	r0, sp, r0, lsl #16
    2d80:	00028000 	andeq	r8, r2, r0
	...
    2d8c:	000f9d00 	andeq	r9, pc, r0, lsl #26
    2d90:	00062c00 	andeq	r2, r6, r0, lsl #24
    2d94:	02010200 	andeq	r0, r1, #0, 4
    2d98:	00002a74 	andeq	r2, r0, r4, ror sl
    2d9c:	e1080102 	tst	r8, r2, lsl #2
    2da0:	02000004 	andeq	r0, r0, #4
    2da4:	04da0601 	ldrbeq	r0, [sl], #1537	; 0x601
    2da8:	e1030000 	mrs	r0, (UNDEF: 3)
    2dac:	0200004f 	andeq	r0, r0, #79	; 0x4f
    2db0:	00004d14 	andeq	r4, r0, r4, lsl sp
    2db4:	08010200 	stmdaeq	r1, {r9}
    2db8:	000048ac 	andeq	r4, r0, ip, lsr #17
    2dbc:	0d050202 	sfmeq	f0, 4, [r5, #-8]
    2dc0:	03000006 	movweq	r0, #6
    2dc4:	0000804c 	andeq	r8, r0, ip, asr #32
    2dc8:	00661602 	rsbeq	r1, r6, r2, lsl #12
    2dcc:	02020000 	andeq	r0, r2, #0
    2dd0:	0051ca07 	subseq	ip, r1, r7, lsl #20
    2dd4:	05040400 	streq	r0, [r4, #-1024]	; 0xfffffc00
    2dd8:	00746e69 	rsbseq	r6, r4, r9, ror #28
    2ddc:	00008903 	andeq	r8, r0, r3, lsl #18
    2de0:	7f180200 	svcvc	0x00180200
    2de4:	02000000 	andeq	r0, r0, #0
    2de8:	28400704 	stmdacs	r0, {r2, r8, r9, sl}^
    2dec:	7f050000 	svcvc	0x00050000
    2df0:	02000000 	andeq	r0, r0, #0
    2df4:	41fc0508 	mvnsmi	r0, r8, lsl #10
    2df8:	08020000 	stmdaeq	r2, {}	; <UNPREDICTABLE>
    2dfc:	0058fe07 	subseq	pc, r8, r7, lsl #28
    2e00:	00880300 	addeq	r0, r8, r0, lsl #6
    2e04:	22020000 	andcs	r0, r2, #0
    2e08:	00000086 	andeq	r0, r0, r6, lsl #1
    2e0c:	8d040402 	cfstrshi	mvf0, [r4, #-8]
    2e10:	02000064 	andeq	r0, r0, #100	; 0x64
    2e14:	418b0408 	orrmi	r0, fp, r8, lsl #8
    2e18:	1c060000 	stcne	0, cr0, [r6], {-0}
    2e1c:	011da003 	tsteq	sp, r3
    2e20:	43070000 	movwmi	r0, #28672	; 0x7000
    2e24:	03004c52 	movweq	r4, #3154	; 0xc52
    2e28:	000099a1 	andeq	r9, r0, r1, lsr #19
    2e2c:	00230200 	eoreq	r0, r3, r0, lsl #4
    2e30:	48524307 	ldmdami	r2, {r0, r1, r2, r8, r9, lr}^
    2e34:	99a20300 	stmibls	r2!, {r8, r9}
    2e38:	02000000 	andeq	r0, r0, #0
    2e3c:	49070423 	stmdbmi	r7, {r0, r1, r5, sl}
    2e40:	03005244 	movweq	r5, #580	; 0x244
    2e44:	000099a3 	andeq	r9, r0, r3, lsr #19
    2e48:	08230200 	stmdaeq	r3!, {r9}
    2e4c:	52444f07 	subpl	r4, r4, #7, 30
    2e50:	99a40300 	stmibls	r4!, {r8, r9}
    2e54:	02000000 	andeq	r0, r0, #0
    2e58:	9c080c23 	stcls	12, cr0, [r8], {35}	; 0x23
    2e5c:	0300005d 	movweq	r0, #93	; 0x5d
    2e60:	000099a5 	andeq	r9, r0, r5, lsr #19
    2e64:	10230200 	eorne	r0, r3, r0, lsl #4
    2e68:	52524207 	subspl	r4, r2, #1879048192	; 0x70000000
    2e6c:	99a60300 	stmibls	r6!, {r8, r9}
    2e70:	02000000 	andeq	r0, r0, #0
    2e74:	1b081423 	blne	207f08 <_Min_Stack_Size+0x207b08>
    2e78:	0300003b 	movweq	r0, #59	; 0x3b
    2e7c:	000099a7 	andeq	r9, r0, r7, lsr #19
    2e80:	18230200 	stmdane	r3!, {r9}
    2e84:	30430300 	subcc	r0, r3, r0, lsl #6
    2e88:	a8030000 	stmdage	r3, {}	; <UNPREDICTABLE>
    2e8c:	000000b2 	strheq	r0, [r0], -r2
    2e90:	5f040806 	svcpl	0x00040806
    2e94:	00000169 	andeq	r0, r0, r9, ror #2
    2e98:	0051dd08 	subseq	sp, r1, r8, lsl #26
    2e9c:	69600400 	stmdbvs	r0!, {sl}^
    2ea0:	02000001 	andeq	r0, r0, #1
    2ea4:	ee080023 	cdp	0, 0, cr0, cr8, cr3, {1}
    2ea8:	0400003a 	streq	r0, [r0], #-58	; 0xffffffc6
    2eac:	00005b63 	andeq	r5, r0, r3, ror #22
    2eb0:	04230200 	strteq	r0, [r3], #-512	; 0xfffffe00
    2eb4:	0052dc08 	subseq	sp, r2, r8, lsl #24
    2eb8:	42660400 	rsbmi	r0, r6, #0, 8
    2ebc:	02000000 	andeq	r0, r0, #0
    2ec0:	45080623 	strmi	r0, [r8, #-1571]	; 0xfffff9dd
    2ec4:	04000001 	streq	r0, [r0], #-1
    2ec8:	00004269 	andeq	r4, r0, r9, ror #4
    2ecc:	07230200 	streq	r0, [r3, -r0, lsl #4]!
    2ed0:	1d040900 	vstrne.16	s0, [r4, #-0]	; <UNPREDICTABLE>
    2ed4:	03000001 	movweq	r0, #1
    2ed8:	00002e1e 	andeq	r2, r0, lr, lsl lr
    2edc:	01286d04 			; <UNDEFINED> instruction: 0x01286d04
    2ee0:	0c0a0000 	stceq	0, cr0, [sl], {-0}
    2ee4:	a2010205 	andge	r0, r1, #1342177280	; 0x50000000
    2ee8:	0b000001 	bleq	2ef4 <_Min_Stack_Size+0x2af4>
    2eec:	00004e27 	andeq	r4, r0, r7, lsr #28
    2ef0:	42010405 	andmi	r0, r1, #83886080	; 0x5000000
    2ef4:	02000000 	andeq	r0, r0, #0
    2ef8:	890b0023 	stmdbhi	fp, {r0, r1, r5}
    2efc:	05000048 	streq	r0, [r0, #-72]	; 0xffffffb8
    2f00:	016f0105 	cmneq	pc, r5, lsl #2
    2f04:	23020000 	movwcs	r0, #8192	; 0x2000
    2f08:	810c0004 	tsthi	ip, r4
    2f0c:	05000068 	streq	r0, [r0, #-104]	; 0xffffff98
    2f10:	017a0107 	cmneq	sl, r7, lsl #2
    2f14:	140a0000 	strne	r0, [sl], #-0
    2f18:	f4010905 	vst2.8	{d0,d2}, [r1], r5
    2f1c:	0b000001 	bleq	2f28 <_Min_Stack_Size+0x2b28>
    2f20:	00004853 	andeq	r4, r0, r3, asr r8
    2f24:	a2010b05 	andge	r0, r1, #5120	; 0x1400
    2f28:	02000001 	andeq	r0, r0, #1
    2f2c:	e10b0023 	tst	fp, r3, lsr #32
    2f30:	05000034 	streq	r0, [r0, #-52]	; 0xffffffcc
    2f34:	0042010e 	subeq	r0, r2, lr, lsl #2
    2f38:	23020000 	movwcs	r0, #8192	; 0x2000
    2f3c:	685c0b0c 	ldmdavs	ip, {r2, r3, r8, r9, fp}^
    2f40:	11050000 	mrsne	r0, (UNDEF: 5)
    2f44:	00004201 	andeq	r4, r0, r1, lsl #4
    2f48:	0d230200 	sfmeq	f0, 4, [r3, #-0]
    2f4c:	0048fc0b 	subeq	pc, r8, fp, lsl #24
    2f50:	01150500 	tsteq	r5, r0, lsl #10
    2f54:	000001f6 	strdeq	r0, [r0], -r6
    2f58:	00102302 	andseq	r2, r0, r2, lsl #6
    2f5c:	0409010d 	streq	r0, [r9], #-269	; 0xfffffef3
    2f60:	000001f4 	strdeq	r0, [r0], -r4
    2f64:	002ec40c 	eoreq	ip, lr, ip, lsl #8
    2f68:	01170500 	tsteq	r7, r0, lsl #10
    2f6c:	000001ae 	andeq	r0, r0, lr, lsr #3
    2f70:	00a2e90e 	adceq	lr, r2, lr, lsl #18
    2f74:	42230100 	eormi	r0, r3, #0, 2
    2f78:	01000000 	mrseq	r0, (UNDEF: 0)
    2f7c:	00980305 	addseq	r0, r8, r5, lsl #6
    2f80:	7f0e2000 	svcvc	0x000e2000
    2f84:	010000a8 	smlatbeq	r0, r8, r0, r0
    2f88:	00007425 	andeq	r7, r0, r5, lsr #8
    2f8c:	03050100 	movweq	r0, #20736	; 0x5100
    2f90:	2000009c 	mulcs	r0, ip, r0
    2f94:	00a6cb0e 	adceq	ip, r6, lr, lsl #22
    2f98:	74260100 	strtvc	r0, [r6], #-256	; 0xffffff00
    2f9c:	01000000 	mrseq	r0, (UNDEF: 0)
    2fa0:	00a00305 	adceq	r0, r0, r5, lsl #6
    2fa4:	010f2000 	mrseq	r2, CPSR
    2fa8:	0000a805 	andeq	sl, r0, r5, lsl #16
    2fac:	6d013f01 	stcvs	15, cr3, [r1, #-4]
    2fb0:	c4000000 	strgt	r0, [r0], #-0
    2fb4:	2808000f 	stmdacs	r8, {r0, r1, r2, r3}
    2fb8:	b8080010 	stmdalt	r8, {r4}
    2fbc:	01000016 	tsteq	r0, r6, lsl r0
    2fc0:	0000026b 	andeq	r0, r0, fp, ror #4
    2fc4:	00a40910 	adceq	r0, r4, r0, lsl r9
    2fc8:	fc410100 	mcrr2	1, 0, r0, r1, cr0
    2fcc:	02000001 	andeq	r0, r0, #1
    2fd0:	11006491 			; <UNDEFINED> instruction: 0x11006491
    2fd4:	00897f01 	addeq	r7, r9, r1, lsl #30
    2fd8:	01280100 			; <UNDEFINED> instruction: 0x01280100
    2fdc:	08000f94 	stmdaeq	r0, {r2, r4, r7, r8, r9, sl, fp}
    2fe0:	08000fc4 	stmdaeq	r0, {r2, r6, r7, r8, r9, sl, fp}
    2fe4:	000016f0 	strdeq	r1, [r0], -r0
    2fe8:	001e0001 	andseq	r0, lr, r1
    2fec:	00020000 	andeq	r0, r2, r0
    2ff0:	00000ac8 	andeq	r0, r0, r8, asr #21
    2ff4:	119d0104 	orrsne	r0, sp, r4, lsl #2
    2ff8:	02980000 	addseq	r0, r8, #0
    2ffc:	a9c70000 	stmibge	r7, {}^	; <UNPREDICTABLE>
    3000:	4d080000 	stcmi	0, cr0, [r8, #-0]
    3004:	a9ea0000 	stmibge	sl!, {}^	; <UNPREDICTABLE>
    3008:	80010000 	andhi	r0, r1, r0

Disassembly of section .debug_abbrev:

