mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
00000000 <.debug_abbrev>:
   0:	25011101 	strcs	r1, [r1, #-257]	; 0xfffffeff
   4:	030b130e 	movweq	r1, #45838	; 0xb30e
   8:	550e1b0e 	strpl	r1, [lr, #-2830]	; 0xfffff4f2
   c:	52011106 	andpl	r1, r1, #-2147483647	; 0x80000001
  10:	99061001 	stmdbls	r6, {r0, ip}
  14:	00000642 	andeq	r0, r0, r2, asr #12
  18:	0b002402 	bleq	9028 <_Min_Stack_Size+0x8c28>
  1c:	030b3e0b 	movweq	r3, #48651	; 0xbe0b
  20:	0300000e 	movweq	r0, #14
  24:	0e030016 	mcreq	0, 0, r0, cr3, cr6, {0}
  28:	0b3b0b3a 	bleq	ec2d18 <_Min_Stack_Size+0xec2918>
  2c:	00001349 	andeq	r1, r0, r9, asr #6
  30:	49002604 	stmdbmi	r0, {r2, r9, sl, sp}
  34:	05000013 	streq	r0, [r0, #-19]	; 0xffffffed
  38:	0b0b0024 	bleq	2c00d0 <_Min_Stack_Size+0x2bfcd0>
  3c:	08030b3e 	stmdaeq	r3, {r1, r2, r3, r4, r5, r8, r9, fp}
  40:	35060000 	strcc	r0, [r6, #-0]
  44:	00134900 	andseq	r4, r3, r0, lsl #18
  48:	01130700 	tsteq	r3, r0, lsl #14
  4c:	0b3a0b0b 	bleq	e82c80 <_Min_Stack_Size+0xe82880>
  50:	13010b3b 	movwne	r0, #6971	; 0x1b3b
  54:	0d080000 	stceq	0, cr0, [r8, #-0]
  58:	3a0e0300 	bcc	380c60 <_Min_Stack_Size+0x380860>
  5c:	490b3b0b 	stmdbmi	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
  60:	000a3813 	andeq	r3, sl, r3, lsl r8
  64:	01010900 	tsteq	r1, r0, lsl #18
  68:	13011349 	movwne	r1, #4937	; 0x1349
  6c:	210a0000 	mrscs	r0, (UNDEF: 10)
  70:	2f134900 	svccs	0x00134900
  74:	0b00000b 	bleq	a8 <_Min_Heap_Size-0x158>
  78:	0803000d 	stmdaeq	r3, {r0, r2, r3}
  7c:	0b3b0b3a 	bleq	ec2d6c <_Min_Stack_Size+0xec296c>
  80:	0a381349 	beq	e04dac <_Min_Stack_Size+0xe049ac>
  84:	0f0c0000 	svceq	0x000c0000
  88:	490b0b00 	stmdbmi	fp, {r8, r9, fp}
  8c:	0d000013 	stceq	0, cr0, [r0, #-76]	; 0xffffffb4
  90:	0b0b0113 	bleq	2c04e4 <_Min_Stack_Size+0x2c00e4>
  94:	053b0b3a 	ldreq	r0, [fp, #-2874]!	; 0xfffff4c6
  98:	00001301 	andeq	r1, r0, r1, lsl #6
  9c:	03000d0e 	movweq	r0, #3342	; 0xd0e
  a0:	3b0b3a0e 	blcc	2ce8e0 <_Min_Stack_Size+0x2ce4e0>
  a4:	38134905 	ldmdacc	r3, {r0, r2, r8, fp, lr}
  a8:	0f00000a 	svceq	0x0000000a
  ac:	0e030016 	mcreq	0, 0, r0, cr3, cr6, {0}
  b0:	053b0b3a 	ldreq	r0, [fp, #-2874]!	; 0xfffff4c6
  b4:	00001349 	andeq	r1, r0, r9, asr #6
  b8:	27001510 	smladcs	r0, r0, r5, r1
  bc:	1100000c 	tstne	r0, ip
  c0:	0e030034 	mcreq	0, 0, r0, cr3, cr4, {1}
  c4:	0b3b0b3a 	bleq	ec2db4 <_Min_Stack_Size+0xec29b4>
  c8:	0a021349 	beq	84df4 <_Min_Stack_Size+0x849f4>
  cc:	2e120000 	cdpcs	0, 1, cr0, cr2, cr0, {0}
  d0:	030c3f00 	movweq	r3, #52992	; 0xcf00
  d4:	3b0b3a0e 	blcc	2ce914 <_Min_Stack_Size+0x2ce514>
  d8:	110c2705 	tstne	ip, r5, lsl #14
  dc:	40011201 	andmi	r1, r1, r1, lsl #4
  e0:	0c429606 	mcrreq	6, 0, r9, r2, cr6
  e4:	2e130000 	cdpcs	0, 1, cr0, cr3, cr0, {0}
  e8:	030c3f00 	movweq	r3, #52992	; 0xcf00
  ec:	3b0b3a0e 	blcc	2ce92c <_Min_Stack_Size+0x2ce52c>
  f0:	110c270b 	tstne	ip, fp, lsl #14
  f4:	40011201 	andmi	r1, r1, r1, lsl #4
  f8:	0c429606 	mcrreq	6, 0, r9, r2, cr6
  fc:	2e140000 	cdpcs	0, 1, cr0, cr4, cr0, {0}
 100:	030c3f00 	movweq	r3, #52992	; 0xcf00
 104:	3b0b3a0e 	blcc	2ce944 <_Min_Stack_Size+0x2ce544>
 108:	110c270b 	tstne	ip, fp, lsl #14
 10c:	40011201 	andmi	r1, r1, r1, lsl #4
 110:	0c429706 	mcrreq	7, 0, r9, r2, cr6
 114:	2e150000 	cdpcs	0, 1, cr0, cr5, cr0, {0}
 118:	030c3f01 	movweq	r3, #52993	; 0xcf01
 11c:	3b0b3a0e 	blcc	2ce95c <_Min_Stack_Size+0x2ce55c>
 120:	110c270b 	tstne	ip, fp, lsl #14
 124:	40011201 	andmi	r1, r1, r1, lsl #4
 128:	0c429606 	mcrreq	6, 0, r9, r2, cr6
 12c:	00001301 	andeq	r1, r0, r1, lsl #6
 130:	03000516 	movweq	r0, #1302	; 0x516
 134:	3b0b3a0e 	blcc	2ce974 <_Min_Stack_Size+0x2ce574>
 138:	0213490b 	andseq	r4, r3, #180224	; 0x2c000
 13c:	1700000a 	strne	r0, [r0, -sl]
 140:	0e03012e 	adfeqsp	f0, f3, #0.5
 144:	0b3b0b3a 	bleq	ec2e34 <_Min_Stack_Size+0xec2a34>
 148:	13490c27 	movtne	r0, #39975	; 0x9c27
 14c:	01120111 	tsteq	r2, r1, lsl r1
 150:	42970640 	addsmi	r0, r7, #64, 12	; 0x4000000
 154:	0013010c 	andseq	r0, r3, ip, lsl #2
 158:	012e1800 			; <UNDEFINED> instruction: 0x012e1800
 15c:	0b3a0e03 	bleq	e83970 <_Min_Stack_Size+0xe83570>
 160:	0c270b3b 			; <UNDEFINED> instruction: 0x0c270b3b
 164:	01120111 	tsteq	r2, r1, lsl r1
 168:	42970640 	addsmi	r0, r7, #64, 12	; 0x4000000
 16c:	0013010c 	andseq	r0, r3, ip, lsl #2
 170:	012e1900 			; <UNDEFINED> instruction: 0x012e1900
 174:	0b3a0e03 	bleq	e83988 <_Min_Stack_Size+0xe83588>
 178:	0c270b3b 			; <UNDEFINED> instruction: 0x0c270b3b
 17c:	01120111 	tsteq	r2, r1, lsl r1
 180:	42970640 	addsmi	r0, r7, #64, 12	; 0x4000000
 184:	0000000c 	andeq	r0, r0, ip
 188:	25011101 	strcs	r1, [r1, #-257]	; 0xfffffeff
 18c:	030b130e 	movweq	r1, #45838	; 0xb30e
 190:	550e1b0e 	strpl	r1, [lr, #-2830]	; 0xfffff4f2
 194:	52011106 	andpl	r1, r1, #-2147483647	; 0x80000001
 198:	99061001 	stmdbls	r6, {r0, ip}
 19c:	00000642 	andeq	r0, r0, r2, asr #12
 1a0:	0b002402 	bleq	91b0 <_Min_Stack_Size+0x8db0>
 1a4:	030b3e0b 	movweq	r3, #48651	; 0xbe0b
 1a8:	0300000e 	movweq	r0, #14
 1ac:	0e030016 	mcreq	0, 0, r0, cr3, cr6, {0}
 1b0:	0b3b0b3a 	bleq	ec2ea0 <_Min_Stack_Size+0xec2aa0>
 1b4:	00001349 	andeq	r1, r0, r9, asr #6
 1b8:	0b002404 	bleq	91d0 <_Min_Stack_Size+0x8dd0>
 1bc:	030b3e0b 	movweq	r3, #48651	; 0xbe0b
 1c0:	05000008 	streq	r0, [r0, #-8]
 1c4:	13490035 	movtne	r0, #36917	; 0x9035
 1c8:	13060000 	movwne	r0, #24576	; 0x6000
 1cc:	3a0b0b01 	bcc	2c2dd8 <_Min_Stack_Size+0x2c29d8>
 1d0:	010b3b0b 	tsteq	fp, fp, lsl #22
 1d4:	07000013 	smladeq	r0, r3, r0, r0
 1d8:	0803000d 	stmdaeq	r3, {r0, r2, r3}
 1dc:	0b3b0b3a 	bleq	ec2ecc <_Min_Stack_Size+0xec2acc>
 1e0:	0a381349 	beq	e04f0c <_Min_Stack_Size+0xe04b0c>
 1e4:	0d080000 	stceq	0, cr0, [r8, #-0]
 1e8:	3a0e0300 	bcc	380df0 <_Min_Stack_Size+0x3809f0>
 1ec:	490b3b0b 	stmdbmi	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 1f0:	000a3813 	andeq	r3, sl, r3, lsl r8
 1f4:	000f0900 	andeq	r0, pc, r0, lsl #18
 1f8:	13490b0b 	movtne	r0, #39691	; 0x9b0b
 1fc:	2e0a0000 	cdpcs	0, 0, cr0, cr10, cr0, {0}
 200:	030c3f01 	movweq	r3, #52993	; 0xcf01
 204:	3b0b3a0e 	blcc	2cea44 <_Min_Stack_Size+0x2ce644>
 208:	490c2705 	stmdbmi	ip, {r0, r2, r8, r9, sl, sp}
 20c:	12011113 	andne	r1, r1, #-1073741820	; 0xc0000004
 210:	97064001 	strls	r4, [r6, -r1]
 214:	13010c42 	movwne	r0, #7234	; 0x1c42
 218:	050b0000 	streq	r0, [fp, #-0]
 21c:	3a0e0300 	bcc	380e24 <_Min_Stack_Size+0x380a24>
 220:	49053b0b 	stmdbmi	r5, {r0, r1, r3, r8, r9, fp, ip, sp}
 224:	000a0213 	andeq	r0, sl, r3, lsl r2
 228:	012e0c00 			; <UNDEFINED> instruction: 0x012e0c00
 22c:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 230:	053b0b3a 	ldreq	r0, [fp, #-2874]!	; 0xfffff4c6
 234:	01110c27 	tsteq	r1, r7, lsr #24
 238:	06400112 			; <UNDEFINED> instruction: 0x06400112
 23c:	010c4297 			; <UNDEFINED> instruction: 0x010c4297
 240:	0d000013 	stceq	0, cr0, [r0, #-76]	; 0xffffffb4
 244:	0c3f012e 	ldfeqs	f0, [pc], #-184	; 194 <_Min_Heap_Size-0x6c>
 248:	0b3a0e03 	bleq	e83a5c <_Min_Stack_Size+0xe8365c>
 24c:	0c270b3b 			; <UNDEFINED> instruction: 0x0c270b3b
 250:	01111349 	tsteq	r1, r9, asr #6
 254:	06400112 			; <UNDEFINED> instruction: 0x06400112
 258:	010c4297 			; <UNDEFINED> instruction: 0x010c4297
 25c:	0e000013 	mcreq	0, 0, r0, cr0, cr3, {0}
 260:	0e030005 	cdpeq	0, 0, cr0, cr3, cr5, {0}
 264:	0b3b0b3a 	bleq	ec2f54 <_Min_Stack_Size+0xec2b54>
 268:	0a021349 	beq	84f94 <_Min_Stack_Size+0x84b94>
 26c:	2e0f0000 	cdpcs	0, 0, cr0, cr15, cr0, {0}
 270:	030c3f01 	movweq	r3, #52993	; 0xcf01
 274:	3b0b3a0e 	blcc	2ceab4 <_Min_Stack_Size+0x2ce6b4>
 278:	110c270b 	tstne	ip, fp, lsl #14
 27c:	40011201 	andmi	r1, r1, r1, lsl #4
 280:	0c429706 	mcrreq	7, 0, r9, r2, cr6
 284:	00001301 	andeq	r1, r0, r1, lsl #6
 288:	3f012e10 	svccc	0x00012e10
 28c:	3a0e030c 	bcc	380ec4 <_Min_Stack_Size+0x380ac4>
 290:	270b3b0b 	strcs	r3, [fp, -fp, lsl #22]
 294:	1201110c 	andne	r1, r1, #12, 2
 298:	96064001 	strls	r4, [r6], -r1
 29c:	13010c42 	movwne	r0, #7234	; 0x1c42
 2a0:	34110000 	ldrcc	r0, [r1], #-0
 2a4:	3a0e0300 	bcc	380eac <_Min_Stack_Size+0x380aac>
 2a8:	490b3b0b 	stmdbmi	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 2ac:	000a0213 	andeq	r0, sl, r3, lsl r2
 2b0:	01011200 	mrseq	r1, R9_usr
 2b4:	13011349 	movwne	r1, #4937	; 0x1349
 2b8:	21130000 	tstcs	r3, r0
 2bc:	2f134900 	svccs	0x00134900
 2c0:	1400000b 	strne	r0, [r0], #-11
 2c4:	0e03012e 	adfeqsp	f0, f3, #0.5
 2c8:	0b3b0b3a 	bleq	ec2fb8 <_Min_Stack_Size+0xec2bb8>
 2cc:	13490c27 	movtne	r0, #39975	; 0x9c27
 2d0:	01120111 	tsteq	r2, r1, lsl r1
 2d4:	42970640 	addsmi	r0, r7, #64, 12	; 0x4000000
 2d8:	0000000c 	andeq	r0, r0, ip
 2dc:	25011101 	strcs	r1, [r1, #-257]	; 0xfffffeff
 2e0:	030b130e 	movweq	r1, #45838	; 0xb30e
 2e4:	550e1b0e 	strpl	r1, [lr, #-2830]	; 0xfffff4f2
 2e8:	52011106 	andpl	r1, r1, #-2147483647	; 0x80000001
 2ec:	99061001 	stmdbls	r6, {r0, ip}
 2f0:	00000642 	andeq	r0, r0, r2, asr #12
 2f4:	0b002402 	bleq	9304 <_Min_Stack_Size+0x8f04>
 2f8:	030b3e0b 	movweq	r3, #48651	; 0xbe0b
 2fc:	0300000e 	movweq	r0, #14
 300:	0e030016 	mcreq	0, 0, r0, cr3, cr6, {0}
 304:	0b3b0b3a 	bleq	ec2ff4 <_Min_Stack_Size+0xec2bf4>
 308:	00001349 	andeq	r1, r0, r9, asr #6
 30c:	49003504 	stmdbmi	r0, {r2, r8, sl, ip, sp}
 310:	05000013 	streq	r0, [r0, #-19]	; 0xffffffed
 314:	0b0b0024 	bleq	2c03ac <_Min_Stack_Size+0x2bffac>
 318:	08030b3e 	stmdaeq	r3, {r1, r2, r3, r4, r5, r8, r9, fp}
 31c:	13060000 	movwne	r0, #24576	; 0x6000
 320:	3a0b0b01 	bcc	2c2f2c <_Min_Stack_Size+0x2c2b2c>
 324:	010b3b0b 	tsteq	fp, fp, lsl #22
 328:	07000013 	smladeq	r0, r3, r0, r0
 32c:	0803000d 	stmdaeq	r3, {r0, r2, r3}
 330:	0b3b0b3a 	bleq	ec3020 <_Min_Stack_Size+0xec2c20>
 334:	0a381349 	beq	e05060 <_Min_Stack_Size+0xe04c60>
 338:	0d080000 	stceq	0, cr0, [r8, #-0]
 33c:	3a0e0300 	bcc	380f44 <_Min_Stack_Size+0x380b44>
 340:	490b3b0b 	stmdbmi	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 344:	000a3813 	andeq	r3, sl, r3, lsl r8
 348:	01010900 	tsteq	r1, r0, lsl #18
 34c:	13011349 	movwne	r1, #4937	; 0x1349
 350:	210a0000 	mrscs	r0, (UNDEF: 10)
 354:	2f134900 	svccs	0x00134900
 358:	0b00000b 	bleq	38c <_Min_Heap_Size+0x18c>
 35c:	0b0b000f 	bleq	2c03a0 <_Min_Stack_Size+0x2bffa0>
 360:	00001349 	andeq	r1, r0, r9, asr #6
 364:	2700150c 	strcs	r1, [r0, -ip, lsl #10]
 368:	0d00000c 	stceq	0, cr0, [r0, #-48]	; 0xffffffd0
 36c:	0e030034 	mcreq	0, 0, r0, cr3, cr4, {1}
 370:	0b3b0b3a 	bleq	ec3060 <_Min_Stack_Size+0xec2c60>
 374:	0a021349 	beq	850a0 <_Min_Stack_Size+0x84ca0>
 378:	2e0e0000 	cdpcs	0, 0, cr0, cr14, cr0, {0}
 37c:	030c3f00 	movweq	r3, #52992	; 0xcf00
 380:	3b0b3a0e 	blcc	2cebc0 <_Min_Stack_Size+0x2ce7c0>
 384:	110c2705 	tstne	ip, r5, lsl #14
 388:	40011201 	andmi	r1, r1, r1, lsl #4
 38c:	0c429606 	mcrreq	6, 0, r9, r2, cr6
 390:	2e0f0000 	cdpcs	0, 0, cr0, cr15, cr0, {0}
 394:	030c3f01 	movweq	r3, #52993	; 0xcf01
 398:	3b0b3a0e 	blcc	2cebd8 <_Min_Stack_Size+0x2ce7d8>
 39c:	490c2705 	stmdbmi	ip, {r0, r2, r8, r9, sl, sp}
 3a0:	12011113 	andne	r1, r1, #-1073741820	; 0xc0000004
 3a4:	97064001 	strls	r4, [r6, -r1]
 3a8:	13010c42 	movwne	r0, #7234	; 0x1c42
 3ac:	05100000 	ldreq	r0, [r0, #-0]
 3b0:	3a0e0300 	bcc	380fb8 <_Min_Stack_Size+0x380bb8>
 3b4:	49053b0b 	stmdbmi	r5, {r0, r1, r3, r8, r9, fp, ip, sp}
 3b8:	000a0213 	andeq	r0, sl, r3, lsl r2
 3bc:	012e1100 			; <UNDEFINED> instruction: 0x012e1100
 3c0:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 3c4:	053b0b3a 	ldreq	r0, [fp, #-2874]!	; 0xfffff4c6
 3c8:	01110c27 	tsteq	r1, r7, lsr #24
 3cc:	06400112 			; <UNDEFINED> instruction: 0x06400112
 3d0:	010c4297 			; <UNDEFINED> instruction: 0x010c4297
 3d4:	12000013 	andne	r0, r0, #19
 3d8:	0e030034 	mcreq	0, 0, r0, cr3, cr4, {1}
 3dc:	053b0b3a 	ldreq	r0, [fp, #-2874]!	; 0xfffff4c6
 3e0:	0a021349 	beq	8510c <_Min_Stack_Size+0x84d0c>
 3e4:	2e130000 	cdpcs	0, 1, cr0, cr3, cr0, {0}
 3e8:	030c3f01 	movweq	r3, #52993	; 0xcf01
 3ec:	3b0b3a0e 	blcc	2cec2c <_Min_Stack_Size+0x2ce82c>
 3f0:	110c2705 	tstne	ip, r5, lsl #14
 3f4:	40011201 	andmi	r1, r1, r1, lsl #4
 3f8:	0c429606 	mcrreq	6, 0, r9, r2, cr6
 3fc:	00001301 	andeq	r1, r0, r1, lsl #6
 400:	11010b14 	tstne	r1, r4, lsl fp
 404:	01011201 	tsteq	r1, r1, lsl #4
 408:	15000013 	strne	r0, [r0, #-19]	; 0xffffffed
 40c:	08030034 	stmdaeq	r3, {r2, r4, r5}
 410:	053b0b3a 	ldreq	r0, [fp, #-2874]!	; 0xfffff4c6
 414:	0a021349 	beq	85140 <_Min_Stack_Size+0x84d40>
 418:	0b160000 	bleq	580420 <_Min_Stack_Size+0x580020>
 41c:	12011101 	andne	r1, r1, #1073741824	; 0x40000000
 420:	17000001 	strne	r0, [r0, -r1]
 424:	0c3f012e 	ldfeqs	f0, [pc], #-184	; 374 <_Min_Heap_Size+0x174>
 428:	0b3a0e03 	bleq	e83c3c <_Min_Stack_Size+0xe8383c>
 42c:	0c270b3b 			; <UNDEFINED> instruction: 0x0c270b3b
 430:	01120111 	tsteq	r2, r1, lsl r1
 434:	42970640 	addsmi	r0, r7, #64, 12	; 0x4000000
 438:	0013010c 	andseq	r0, r3, ip, lsl #2
 43c:	00051800 	andeq	r1, r5, r0, lsl #16
 440:	0b3a0e03 	bleq	e83c54 <_Min_Stack_Size+0xe83854>
 444:	13490b3b 	movtne	r0, #39739	; 0x9b3b
 448:	00000a02 	andeq	r0, r0, r2, lsl #20
 44c:	03003419 	movweq	r3, #1049	; 0x419
 450:	3b0b3a0e 	blcc	2cec90 <_Min_Stack_Size+0x2ce890>
 454:	0013490b 	andseq	r4, r3, fp, lsl #18
 458:	00341a00 	eorseq	r1, r4, r0, lsl #20
 45c:	0b3a0803 	bleq	e82470 <_Min_Stack_Size+0xe82070>
 460:	13490b3b 	movtne	r0, #39739	; 0x9b3b
 464:	00000a02 	andeq	r0, r0, r2, lsl #20
 468:	01110100 	tsteq	r1, r0, lsl #2
 46c:	0b130e25 	bleq	4c3d08 <_Min_Stack_Size+0x4c3908>
 470:	0e1b0e03 	cdpeq	14, 1, cr0, cr11, cr3, {0}
 474:	01110655 	tsteq	r1, r5, asr r6
 478:	06100152 			; <UNDEFINED> instruction: 0x06100152
 47c:	00064299 	muleq	r6, r9, r2
 480:	00240200 	eoreq	r0, r4, r0, lsl #4
 484:	0b3e0b0b 	bleq	f830b8 <_Min_Stack_Size+0xf82cb8>
 488:	00000e03 	andeq	r0, r0, r3, lsl #28
 48c:	03001603 	movweq	r1, #1539	; 0x603
 490:	3b0b3a0e 	blcc	2cecd0 <_Min_Stack_Size+0x2ce8d0>
 494:	0013490b 	andseq	r4, r3, fp, lsl #18
 498:	00240400 	eoreq	r0, r4, r0, lsl #8
 49c:	0b3e0b0b 	bleq	f830d0 <_Min_Stack_Size+0xf82cd0>
 4a0:	00000803 	andeq	r0, r0, r3, lsl #16
 4a4:	49003505 	stmdbmi	r0, {r0, r2, r8, sl, ip, sp}
 4a8:	06000013 			; <UNDEFINED> instruction: 0x06000013
 4ac:	0b0b0113 	bleq	2c0900 <_Min_Stack_Size+0x2c0500>
 4b0:	0b3b0b3a 	bleq	ec31a0 <_Min_Stack_Size+0xec2da0>
 4b4:	00001301 	andeq	r1, r0, r1, lsl #6
 4b8:	03000d07 	movweq	r0, #3335	; 0xd07
 4bc:	3b0b3a08 	blcc	2cece4 <_Min_Stack_Size+0x2ce8e4>
 4c0:	3813490b 	ldmdacc	r3, {r0, r1, r3, r8, fp, lr}
 4c4:	0800000a 	stmdaeq	r0, {r1, r3}
 4c8:	0e03000d 	cdpeq	0, 0, cr0, cr3, cr13, {0}
 4cc:	0b3b0b3a 	bleq	ec31bc <_Min_Stack_Size+0xec2dbc>
 4d0:	0a381349 	beq	e051fc <_Min_Stack_Size+0xe04dfc>
 4d4:	0f090000 	svceq	0x00090000
 4d8:	490b0b00 	stmdbmi	fp, {r8, r9, fp}
 4dc:	0a000013 	beq	530 <_Min_Stack_Size+0x130>
 4e0:	0b3e0104 	bleq	f808f8 <_Min_Stack_Size+0xf804f8>
 4e4:	13490b0b 	movtne	r0, #39691	; 0x9b0b
 4e8:	0b3b0b3a 	bleq	ec31d8 <_Min_Stack_Size+0xec2dd8>
 4ec:	00001301 	andeq	r1, r0, r1, lsl #6
 4f0:	0300280b 	movweq	r2, #2059	; 0x80b
 4f4:	000b1c0e 	andeq	r1, fp, lr, lsl #24
 4f8:	01130c00 	tsteq	r3, r0, lsl #24
 4fc:	0b3a0b0b 	bleq	e83130 <_Min_Stack_Size+0xe82d30>
 500:	1301053b 	movwne	r0, #5435	; 0x153b
 504:	0d0d0000 	stceq	0, cr0, [sp, #-0]
 508:	3a0e0300 	bcc	381110 <_Min_Stack_Size+0x380d10>
 50c:	49053b0b 	stmdbmi	r5, {r0, r1, r3, r8, r9, fp, ip, sp}
 510:	000a3813 	andeq	r3, sl, r3, lsl r8
 514:	00160e00 	andseq	r0, r6, r0, lsl #28
 518:	0b3a0e03 	bleq	e83d2c <_Min_Stack_Size+0xe8392c>
 51c:	1349053b 	movtne	r0, #38203	; 0x953b
 520:	150f0000 	strne	r0, [pc, #-0]	; 528 <_Min_Stack_Size+0x128>
 524:	010c2701 	tsteq	ip, r1, lsl #14
 528:	10000013 	andne	r0, r0, r3, lsl r0
 52c:	13490005 	movtne	r0, #36869	; 0x9005
 530:	34110000 	ldrcc	r0, [r1], #-0
 534:	3a0e0300 	bcc	38113c <_Min_Stack_Size+0x380d3c>
 538:	490b3b0b 	stmdbmi	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 53c:	000a0213 	andeq	r0, sl, r3, lsl r2
 540:	012e1200 			; <UNDEFINED> instruction: 0x012e1200
 544:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 548:	053b0b3a 	ldreq	r0, [fp, #-2874]!	; 0xfffff4c6
 54c:	01110c27 	tsteq	r1, r7, lsr #24
 550:	06400112 			; <UNDEFINED> instruction: 0x06400112
 554:	010c4296 			; <UNDEFINED> instruction: 0x010c4296
 558:	13000013 	movwne	r0, #19
 55c:	0e030034 	mcreq	0, 0, r0, cr3, cr4, {1}
 560:	053b0b3a 	ldreq	r0, [fp, #-2874]!	; 0xfffff4c6
 564:	0a021349 	beq	85290 <_Min_Stack_Size+0x84e90>
 568:	2e140000 	cdpcs	0, 1, cr0, cr4, cr0, {0}
 56c:	030c3f01 	movweq	r3, #52993	; 0xcf01
 570:	3b0b3a0e 	blcc	2cedb0 <_Min_Stack_Size+0x2ce9b0>
 574:	110c2705 	tstne	ip, r5, lsl #14
 578:	40011201 	andmi	r1, r1, r1, lsl #4
 57c:	0c429706 	mcrreq	7, 0, r9, r2, cr6
 580:	00001301 	andeq	r1, r0, r1, lsl #6
 584:	03000515 	movweq	r0, #1301	; 0x515
 588:	3b0b3a0e 	blcc	2cedc8 <_Min_Stack_Size+0x2ce9c8>
 58c:	02134905 	andseq	r4, r3, #81920	; 0x14000
 590:	1600000a 	strne	r0, [r0], -sl
 594:	0c3f012e 	ldfeqs	f0, [pc], #-184	; 4e4 <_Min_Stack_Size+0xe4>
 598:	0b3a0e03 	bleq	e83dac <_Min_Stack_Size+0xe839ac>
 59c:	0c27053b 	cfstr32eq	mvfx0, [r7], #-236	; 0xffffff14
 5a0:	01111349 	tsteq	r1, r9, asr #6
 5a4:	06400112 			; <UNDEFINED> instruction: 0x06400112
 5a8:	010c4297 			; <UNDEFINED> instruction: 0x010c4297
 5ac:	17000013 	smladne	r0, r3, r0, r0
 5b0:	0111010b 	tsteq	r1, fp, lsl #2
 5b4:	00000112 	andeq	r0, r0, r2, lsl r1
 5b8:	03003418 	movweq	r3, #1048	; 0x418
 5bc:	3b0b3a08 	blcc	2cede4 <_Min_Stack_Size+0x2ce9e4>
 5c0:	02134905 	andseq	r4, r3, #81920	; 0x14000
 5c4:	1900000a 	stmdbne	r0, {r1, r3}
 5c8:	08030005 	stmdaeq	r3, {r0, r2}
 5cc:	053b0b3a 	ldreq	r0, [fp, #-2874]!	; 0xfffff4c6
 5d0:	0a021349 	beq	852fc <_Min_Stack_Size+0x84efc>
 5d4:	2e1a0000 	cdpcs	0, 1, cr0, cr10, cr0, {0}
 5d8:	030c3f01 	movweq	r3, #52993	; 0xcf01
 5dc:	3b0b3a0e 	blcc	2cee1c <_Min_Stack_Size+0x2cea1c>
 5e0:	110c270b 	tstne	ip, fp, lsl #14
 5e4:	40011201 	andmi	r1, r1, r1, lsl #4
 5e8:	0c429606 	mcrreq	6, 0, r9, r2, cr6
 5ec:	00001301 	andeq	r1, r0, r1, lsl #6
 5f0:	0300051b 	movweq	r0, #1307	; 0x51b
 5f4:	3b0b3a0e 	blcc	2cee34 <_Min_Stack_Size+0x2cea34>
 5f8:	0213490b 	andseq	r4, r3, #180224	; 0x2c000
 5fc:	1c00000a 	stcne	0, cr0, [r0], {10}
 600:	0c3f012e 	ldfeqs	f0, [pc], #-184	; 550 <_Min_Stack_Size+0x150>
 604:	0b3a0e03 	bleq	e83e18 <_Min_Stack_Size+0xe83a18>
 608:	0c270b3b 			; <UNDEFINED> instruction: 0x0c270b3b
 60c:	01120111 	tsteq	r2, r1, lsl r1
 610:	42970640 	addsmi	r0, r7, #64, 12	; 0x4000000
 614:	0013010c 	andseq	r0, r3, ip, lsl #2
 618:	01011d00 	tsteq	r1, r0, lsl #26
 61c:	13011349 	movwne	r1, #4937	; 0x1349
 620:	211e0000 	tstcs	lr, r0
 624:	2f134900 	svccs	0x00134900
 628:	1f00000b 	svcne	0x0000000b
 62c:	0c3f012e 	ldfeqs	f0, [pc], #-184	; 57c <_Min_Stack_Size+0x17c>
 630:	0b3a0e03 	bleq	e83e44 <_Min_Stack_Size+0xe83a44>
 634:	0c270b3b 			; <UNDEFINED> instruction: 0x0c270b3b
 638:	01111349 	tsteq	r1, r9, asr #6
 63c:	06400112 			; <UNDEFINED> instruction: 0x06400112
 640:	010c4297 			; <UNDEFINED> instruction: 0x010c4297
 644:	20000013 	andcs	r0, r0, r3, lsl r0
 648:	0e03012e 	adfeqsp	f0, f3, #0.5
 64c:	0b3b0b3a 	bleq	ec333c <_Min_Stack_Size+0xec2f3c>
 650:	01110c27 	tsteq	r1, r7, lsr #24
 654:	06400112 			; <UNDEFINED> instruction: 0x06400112
 658:	000c4296 	muleq	ip, r6, r2
 65c:	00342100 	eorseq	r2, r4, r0, lsl #2
 660:	0b3a0803 	bleq	e82674 <_Min_Stack_Size+0xe82274>
 664:	13490b3b 	movtne	r0, #39739	; 0x9b3b
 668:	00000a02 	andeq	r0, r0, r2, lsl #20
 66c:	01110100 	tsteq	r1, r0, lsl #2
 670:	0b130e25 	bleq	4c3f0c <_Min_Stack_Size+0x4c3b0c>
 674:	0e1b0e03 	cdpeq	14, 1, cr0, cr11, cr3, {0}
 678:	01110655 	tsteq	r1, r5, asr r6
 67c:	06100152 			; <UNDEFINED> instruction: 0x06100152
 680:	00064299 	muleq	r6, r9, r2
 684:	00240200 	eoreq	r0, r4, r0, lsl #4
 688:	0b3e0b0b 	bleq	f832bc <_Min_Stack_Size+0xf82ebc>
 68c:	00000e03 	andeq	r0, r0, r3, lsl #28
 690:	03001603 	movweq	r1, #1539	; 0x603
 694:	3b0b3a0e 	blcc	2ceed4 <_Min_Stack_Size+0x2cead4>
 698:	0013490b 	andseq	r4, r3, fp, lsl #18
 69c:	00240400 	eoreq	r0, r4, r0, lsl #8
 6a0:	0b3e0b0b 	bleq	f832d4 <_Min_Stack_Size+0xf82ed4>
 6a4:	00000803 	andeq	r0, r0, r3, lsl #16
 6a8:	49003505 	stmdbmi	r0, {r0, r2, r8, sl, ip, sp}
 6ac:	06000013 			; <UNDEFINED> instruction: 0x06000013
 6b0:	0b0b0113 	bleq	2c0b04 <_Min_Stack_Size+0x2c0704>
 6b4:	0b3b0b3a 	bleq	ec33a4 <_Min_Stack_Size+0xec2fa4>
 6b8:	00001301 	andeq	r1, r0, r1, lsl #6
 6bc:	03000d07 	movweq	r0, #3335	; 0xd07
 6c0:	3b0b3a08 	blcc	2ceee8 <_Min_Stack_Size+0x2ceae8>
 6c4:	3813490b 	ldmdacc	r3, {r0, r1, r3, r8, fp, lr}
 6c8:	0800000a 	stmdaeq	r0, {r1, r3}
 6cc:	0e03000d 	cdpeq	0, 0, cr0, cr3, cr13, {0}
 6d0:	0b3b0b3a 	bleq	ec33c0 <_Min_Stack_Size+0xec2fc0>
 6d4:	0a381349 	beq	e05400 <_Min_Stack_Size+0xe05000>
 6d8:	0f090000 	svceq	0x00090000
 6dc:	490b0b00 	stmdbmi	fp, {r8, r9, fp}
 6e0:	0a000013 	beq	734 <_Min_Stack_Size+0x334>
 6e4:	0c270015 	stceq	0, cr0, [r7], #-84	; 0xffffffac
 6e8:	040b0000 	streq	r0, [fp], #-0
 6ec:	0b0b3e01 	bleq	2cfef8 <_Min_Stack_Size+0x2cfaf8>
 6f0:	3a13490b 	bcc	4d2b24 <_Min_Stack_Size+0x4d2724>
 6f4:	010b3b0b 	tsteq	fp, fp, lsl #22
 6f8:	0c000013 	stceq	0, cr0, [r0], {19}
 6fc:	0e030028 	cdpeq	0, 0, cr0, cr3, cr8, {1}
 700:	00000b1c 	andeq	r0, r0, ip, lsl fp
 704:	4901010d 	stmdbmi	r1, {r0, r2, r3, r8}
 708:	00130113 	andseq	r0, r3, r3, lsl r1
 70c:	00210e00 	eoreq	r0, r1, r0, lsl #28
 710:	0b2f1349 	bleq	bc543c <_Min_Stack_Size+0xbc503c>
 714:	340f0000 	strcc	r0, [pc], #-0	; 71c <_Min_Stack_Size+0x31c>
 718:	3a0e0300 	bcc	381320 <_Min_Stack_Size+0x380f20>
 71c:	490b3b0b 	stmdbmi	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 720:	000a0213 	andeq	r0, sl, r3, lsl r2
 724:	002e1000 	eoreq	r1, lr, r0
 728:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 72c:	053b0b3a 	ldreq	r0, [fp, #-2874]!	; 0xfffff4c6
 730:	01110c27 	tsteq	r1, r7, lsr #24
 734:	06400112 			; <UNDEFINED> instruction: 0x06400112
 738:	000c4296 	muleq	ip, r6, r2
 73c:	012e1100 			; <UNDEFINED> instruction: 0x012e1100
 740:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 744:	053b0b3a 	ldreq	r0, [fp, #-2874]!	; 0xfffff4c6
 748:	01110c27 	tsteq	r1, r7, lsr #24
 74c:	06400112 			; <UNDEFINED> instruction: 0x06400112
 750:	010c4296 			; <UNDEFINED> instruction: 0x010c4296
 754:	12000013 	andne	r0, r0, #19
 758:	0e030005 	cdpeq	0, 0, cr0, cr3, cr5, {0}
 75c:	053b0b3a 	ldreq	r0, [fp, #-2874]!	; 0xfffff4c6
 760:	0a021349 	beq	8548c <_Min_Stack_Size+0x8508c>
 764:	05130000 	ldreq	r0, [r3, #-0]
 768:	3a080300 	bcc	201370 <_Min_Stack_Size+0x200f70>
 76c:	49053b0b 	stmdbmi	r5, {r0, r1, r3, r8, r9, fp, ip, sp}
 770:	000a0213 	andeq	r0, sl, r3, lsl r2
 774:	00341400 	eorseq	r1, r4, r0, lsl #8
 778:	0b3a0803 	bleq	e8278c <_Min_Stack_Size+0xe8238c>
 77c:	1349053b 	movtne	r0, #38203	; 0x953b
 780:	00000a02 	andeq	r0, r0, r2, lsl #20
 784:	03003415 	movweq	r3, #1045	; 0x415
 788:	3b0b3a0e 	blcc	2cefc8 <_Min_Stack_Size+0x2cebc8>
 78c:	02134905 	andseq	r4, r3, #81920	; 0x14000
 790:	1600000a 	strne	r0, [r0], -sl
 794:	0c3f012e 	ldfeqs	f0, [pc], #-184	; 6e4 <_Min_Stack_Size+0x2e4>
 798:	0b3a0e03 	bleq	e83fac <_Min_Stack_Size+0xe83bac>
 79c:	1349053b 	movtne	r0, #38203	; 0x953b
 7a0:	00000c3c 	andeq	r0, r0, ip, lsr ip
 7a4:	00001817 	andeq	r1, r0, r7, lsl r8
 7a8:	010b1800 	tsteq	fp, r0, lsl #16
 7ac:	01120111 	tsteq	r2, r1, lsl r1
 7b0:	2e190000 	cdpcs	0, 1, cr0, cr9, cr0, {0}
 7b4:	030c3f01 	movweq	r3, #52993	; 0xcf01
 7b8:	3b0b3a0e 	blcc	2ceff8 <_Min_Stack_Size+0x2cebf8>
 7bc:	110c2705 	tstne	ip, r5, lsl #14
 7c0:	40011201 	andmi	r1, r1, r1, lsl #4
 7c4:	0c429706 	mcrreq	7, 0, r9, r2, cr6
 7c8:	00001301 	andeq	r1, r0, r1, lsl #6
 7cc:	3f012e1a 	svccc	0x00012e1a
 7d0:	3a0e030c 	bcc	381408 <_Min_Stack_Size+0x381008>
 7d4:	270b3b0b 	strcs	r3, [fp, -fp, lsl #22]
 7d8:	1201110c 	andne	r1, r1, #12, 2
 7dc:	96064001 	strls	r4, [r6], -r1
 7e0:	13010c42 	movwne	r0, #7234	; 0x1c42
 7e4:	051b0000 	ldreq	r0, [fp, #-0]
 7e8:	3a0e0300 	bcc	3813f0 <_Min_Stack_Size+0x380ff0>
 7ec:	490b3b0b 	stmdbmi	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 7f0:	000a0213 	andeq	r0, sl, r3, lsl r2
 7f4:	00341c00 	eorseq	r1, r4, r0, lsl #24
 7f8:	0b3a0803 	bleq	e8280c <_Min_Stack_Size+0xe8240c>
 7fc:	13490b3b 	movtne	r0, #39739	; 0x9b3b
 800:	00000a02 	andeq	r0, r0, r2, lsl #20
 804:	3f012e1d 	svccc	0x00012e1d
 808:	3a0e030c 	bcc	381440 <_Min_Stack_Size+0x381040>
 80c:	270b3b0b 	strcs	r3, [fp, -fp, lsl #22]
 810:	1201110c 	andne	r1, r1, #12, 2
