mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
 814:	97064001 	strls	r4, [r6, -r1]
 818:	13010c42 	movwne	r0, #7234	; 0x1c42
 81c:	2e1e0000 	cdpcs	0, 1, cr0, cr14, cr0, {0}
 820:	030c3f01 	movweq	r3, #52993	; 0xcf01
 824:	3b0b3a0e 	blcc	2cf064 <_Min_Stack_Size+0x2cec64>
 828:	110c270b 	tstne	ip, fp, lsl #14
 82c:	40011201 	andmi	r1, r1, r1, lsl #4
 830:	0c429706 	mcrreq	7, 0, r9, r2, cr6
 834:	01000000 	mrseq	r0, (UNDEF: 0)
 838:	0e250111 	mcreq	1, 1, r0, cr5, cr1, {0}
 83c:	0e030b13 	vmoveq.32	d3[0], r0
 840:	06550e1b 			; <UNDEFINED> instruction: 0x06550e1b
 844:	01520111 	cmpeq	r2, r1, lsl r1
 848:	42990610 	addsmi	r0, r9, #16, 12	; 0x1000000
 84c:	02000006 	andeq	r0, r0, #6
 850:	0b0b0024 	bleq	2c08e8 <_Min_Stack_Size+0x2c04e8>
 854:	0e030b3e 	vmoveq.16	d3[0], r0
 858:	16030000 	strne	r0, [r3], -r0
 85c:	3a0e0300 	bcc	381464 <_Min_Stack_Size+0x381064>
 860:	490b3b0b 	stmdbmi	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 864:	04000013 	streq	r0, [r0], #-19	; 0xffffffed
 868:	0b0b0024 	bleq	2c0900 <_Min_Stack_Size+0x2c0500>
 86c:	08030b3e 	stmdaeq	r3, {r1, r2, r3, r4, r5, r8, r9, fp}
 870:	35050000 	strcc	r0, [r5, #-0]
 874:	00134900 	andseq	r4, r3, r0, lsl #18
 878:	01130600 	tsteq	r3, r0, lsl #12
 87c:	0b3a0b0b 	bleq	e834b0 <_Min_Stack_Size+0xe830b0>
 880:	13010b3b 	movwne	r0, #6971	; 0x1b3b
 884:	0d070000 	stceq	0, cr0, [r7, #-0]
 888:	3a080300 	bcc	201490 <_Min_Stack_Size+0x201090>
 88c:	490b3b0b 	stmdbmi	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 890:	000a3813 	andeq	r3, sl, r3, lsl r8
 894:	000d0800 	andeq	r0, sp, r0, lsl #16
 898:	0b3a0e03 	bleq	e840ac <_Min_Stack_Size+0xe83cac>
 89c:	13490b3b 	movtne	r0, #39739	; 0x9b3b
 8a0:	00000a38 	andeq	r0, r0, r8, lsr sl
 8a4:	0b000f09 	bleq	44d0 <_Min_Stack_Size+0x40d0>
 8a8:	0013490b 	andseq	r4, r3, fp, lsl #18
 8ac:	00150a00 	andseq	r0, r5, r0, lsl #20
 8b0:	00000c27 	andeq	r0, r0, r7, lsr #24
 8b4:	3e01040b 	cdpcc	4, 0, cr0, cr1, cr11, {0}
 8b8:	490b0b0b 	stmdbmi	fp, {r0, r1, r3, r8, r9, fp}
 8bc:	3b0b3a13 	blcc	2cf110 <_Min_Stack_Size+0x2ced10>
 8c0:	0013010b 	andseq	r0, r3, fp, lsl #2
 8c4:	00280c00 	eoreq	r0, r8, r0, lsl #24
 8c8:	0b1c0e03 	bleq	7040dc <_Min_Stack_Size+0x703cdc>
 8cc:	010d0000 	mrseq	r0, (UNDEF: 13)
 8d0:	01134901 	tsteq	r3, r1, lsl #18
 8d4:	0e000013 	mcreq	0, 0, r0, cr0, cr3, {0}
 8d8:	13490021 	movtne	r0, #36897	; 0x9021
 8dc:	00000b2f 	andeq	r0, r0, pc, lsr #22
 8e0:	0300340f 	movweq	r3, #1039	; 0x40f
 8e4:	3b0b3a0e 	blcc	2cf124 <_Min_Stack_Size+0x2ced24>
 8e8:	0213490b 	andseq	r4, r3, #180224	; 0x2c000
 8ec:	1000000a 	andne	r0, r0, sl
 8f0:	0c3f002e 	ldceq	0, cr0, [pc], #-184	; 840 <_Min_Stack_Size+0x440>
 8f4:	0b3a0e03 	bleq	e84108 <_Min_Stack_Size+0xe83d08>
 8f8:	0c27053b 	cfstr32eq	mvfx0, [r7], #-236	; 0xffffff14
 8fc:	01120111 	tsteq	r2, r1, lsl r1
 900:	42960640 	addsmi	r0, r6, #64, 12	; 0x4000000
 904:	1100000c 	tstne	r0, ip
 908:	0c3f012e 	ldfeqs	f0, [pc], #-184	; 858 <_Min_Stack_Size+0x458>
 90c:	0b3a0e03 	bleq	e84120 <_Min_Stack_Size+0xe83d20>
 910:	0c27053b 	cfstr32eq	mvfx0, [r7], #-236	; 0xffffff14
 914:	01120111 	tsteq	r2, r1, lsl r1
 918:	42970640 	addsmi	r0, r7, #64, 12	; 0x4000000
 91c:	0013010c 	andseq	r0, r3, ip, lsl #2
 920:	00051200 	andeq	r1, r5, r0, lsl #4
 924:	0b3a0e03 	bleq	e84138 <_Min_Stack_Size+0xe83d38>
 928:	1349053b 	movtne	r0, #38203	; 0x953b
 92c:	00000a02 	andeq	r0, r0, r2, lsl #20
 930:	3f012e13 	svccc	0x00012e13
 934:	3a0e030c 	bcc	38156c <_Min_Stack_Size+0x38116c>
 938:	270b3b0b 	strcs	r3, [fp, -fp, lsl #22]
 93c:	1201110c 	andne	r1, r1, #12, 2
 940:	96064001 	strls	r4, [r6], -r1
 944:	13010c42 	movwne	r0, #7234	; 0x1c42
 948:	05140000 	ldreq	r0, [r4, #-0]
 94c:	3a0e0300 	bcc	381554 <_Min_Stack_Size+0x381154>
 950:	490b3b0b 	stmdbmi	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 954:	000a0213 	andeq	r0, sl, r3, lsl r2
 958:	010b1500 	tsteq	fp, r0, lsl #10
 95c:	01120111 	tsteq	r2, r1, lsl r1
 960:	00001301 	andeq	r1, r0, r1, lsl #6
 964:	03003416 	movweq	r3, #1046	; 0x416
 968:	3b0b3a08 	blcc	2cf190 <_Min_Stack_Size+0x2ced90>
 96c:	0213490b 	andseq	r4, r3, #180224	; 0x2c000
 970:	1700000a 	strne	r0, [r0, -sl]
 974:	0e030034 	mcreq	0, 0, r0, cr3, cr4, {1}
 978:	053b0b3a 	ldreq	r0, [fp, #-2874]!	; 0xfffff4c6
 97c:	0a021349 	beq	856a8 <_Min_Stack_Size+0x852a8>
 980:	34180000 	ldrcc	r0, [r8], #-0
 984:	3a080300 	bcc	20158c <_Min_Stack_Size+0x20118c>
 988:	49053b0b 	stmdbmi	r5, {r0, r1, r3, r8, r9, fp, ip, sp}
 98c:	000a0213 	andeq	r0, sl, r3, lsl r2
 990:	010b1900 	tsteq	fp, r0, lsl #18
 994:	01120111 	tsteq	r2, r1, lsl r1
 998:	2e1a0000 	cdpcs	0, 1, cr0, cr10, cr0, {0}
 99c:	030c3f01 	movweq	r3, #52993	; 0xcf01
 9a0:	3b0b3a0e 	blcc	2cf1e0 <_Min_Stack_Size+0x2cede0>
 9a4:	110c270b 	tstne	ip, fp, lsl #14
 9a8:	40011201 	andmi	r1, r1, r1, lsl #4
 9ac:	0c429706 	mcrreq	7, 0, r9, r2, cr6
 9b0:	00001301 	andeq	r1, r0, r1, lsl #6
 9b4:	3f012e1b 	svccc	0x00012e1b
 9b8:	3a0e030c 	bcc	3815f0 <_Min_Stack_Size+0x3811f0>
 9bc:	270b3b0b 	strcs	r3, [fp, -fp, lsl #22]
 9c0:	1201110c 	andne	r1, r1, #12, 2
 9c4:	96064001 	strls	r4, [r6], -r1
 9c8:	00000c42 	andeq	r0, r0, r2, asr #24
 9cc:	01110100 	tsteq	r1, r0, lsl #2
 9d0:	0b130e25 	bleq	4c426c <_Min_Stack_Size+0x4c3e6c>
 9d4:	0e1b0e03 	cdpeq	14, 1, cr0, cr11, cr3, {0}
 9d8:	01110655 	tsteq	r1, r5, asr r6
 9dc:	06100152 			; <UNDEFINED> instruction: 0x06100152
 9e0:	00064299 	muleq	r6, r9, r2
 9e4:	00240200 	eoreq	r0, r4, r0, lsl #4
 9e8:	0b3e0b0b 	bleq	f8361c <_Min_Stack_Size+0xf8321c>
 9ec:	00000e03 	andeq	r0, r0, r3, lsl #28
 9f0:	03001603 	movweq	r1, #1539	; 0x603
 9f4:	3b0b3a0e 	blcc	2cf234 <_Min_Stack_Size+0x2cee34>
 9f8:	0013490b 	andseq	r4, r3, fp, lsl #18
 9fc:	00240400 	eoreq	r0, r4, r0, lsl #8
 a00:	0b3e0b0b 	bleq	f83634 <_Min_Stack_Size+0xf83234>
 a04:	00000803 	andeq	r0, r0, r3, lsl #16
 a08:	49003505 	stmdbmi	r0, {r0, r2, r8, sl, ip, sp}
 a0c:	06000013 			; <UNDEFINED> instruction: 0x06000013
 a10:	0b0b0113 	bleq	2c0e64 <_Min_Stack_Size+0x2c0a64>
 a14:	0b3b0b3a 	bleq	ec3704 <_Min_Stack_Size+0xec3304>
 a18:	00001301 	andeq	r1, r0, r1, lsl #6
 a1c:	03000d07 	movweq	r0, #3335	; 0xd07
 a20:	3b0b3a08 	blcc	2cf248 <_Min_Stack_Size+0x2cee48>
 a24:	3813490b 	ldmdacc	r3, {r0, r1, r3, r8, fp, lr}
 a28:	0800000a 	stmdaeq	r0, {r1, r3}
 a2c:	0e03000d 	cdpeq	0, 0, cr0, cr3, cr13, {0}
 a30:	0b3b0b3a 	bleq	ec3720 <_Min_Stack_Size+0xec3320>
 a34:	0a381349 	beq	e05760 <_Min_Stack_Size+0xe05360>
 a38:	0f090000 	svceq	0x00090000
 a3c:	490b0b00 	stmdbmi	fp, {r8, r9, fp}
 a40:	0a000013 	beq	a94 <_Min_Stack_Size+0x694>
 a44:	0b0b0113 	bleq	2c0e98 <_Min_Stack_Size+0x2c0a98>
 a48:	053b0b3a 	ldreq	r0, [fp, #-2874]!	; 0xfffff4c6
 a4c:	00001301 	andeq	r1, r0, r1, lsl #6
 a50:	03000d0b 	movweq	r0, #3339	; 0xd0b
 a54:	3b0b3a0e 	blcc	2cf294 <_Min_Stack_Size+0x2cee94>
 a58:	38134905 	ldmdacc	r3, {r0, r2, r8, fp, lr}
 a5c:	0c00000a 	stceq	0, cr0, [r0], {10}
 a60:	0e030016 	mcreq	0, 0, r0, cr3, cr6, {0}
 a64:	053b0b3a 	ldreq	r0, [fp, #-2874]!	; 0xfffff4c6
 a68:	00001349 	andeq	r1, r0, r9, asr #6
 a6c:	2700150d 	strcs	r1, [r0, -sp, lsl #10]
 a70:	0e00000c 	cdpeq	0, 0, cr0, cr0, cr12, {0}
 a74:	0e030034 	mcreq	0, 0, r0, cr3, cr4, {1}
 a78:	0b3b0b3a 	bleq	ec3768 <_Min_Stack_Size+0xec3368>
 a7c:	0c3f1349 	ldceq	3, cr1, [pc], #-292	; 960 <_Min_Stack_Size+0x560>
 a80:	00000a02 	andeq	r0, r0, r2, lsl #20
 a84:	3f012e0f 	svccc	0x00012e0f
 a88:	3a0e030c 	bcc	3816c0 <_Min_Stack_Size+0x3812c0>
 a8c:	270b3b0b 	strcs	r3, [fp, -fp, lsl #22]
 a90:	1113490c 	tstne	r3, ip, lsl #18
 a94:	40011201 	andmi	r1, r1, r1, lsl #4
 a98:	0c429606 	mcrreq	6, 0, r9, r2, cr6
 a9c:	00001301 	andeq	r1, r0, r1, lsl #6
 aa0:	03003410 	movweq	r3, #1040	; 0x410
 aa4:	3b0b3a0e 	blcc	2cf2e4 <_Min_Stack_Size+0x2ceee4>
 aa8:	0213490b 	andseq	r4, r3, #180224	; 0x2c000
 aac:	1100000a 	tstne	r0, sl
 ab0:	0c3f002e 	ldceq	0, cr0, [pc], #-184	; a00 <_Min_Stack_Size+0x600>
 ab4:	0b3a0e03 	bleq	e842c8 <_Min_Stack_Size+0xe83ec8>
 ab8:	0c270b3b 			; <UNDEFINED> instruction: 0x0c270b3b
 abc:	01120111 	tsteq	r2, r1, lsl r1
 ac0:	42970640 	addsmi	r0, r7, #64, 12	; 0x4000000
 ac4:	0000000c 	andeq	r0, r0, ip
 ac8:	10001101 	andne	r1, r0, r1, lsl #2
 acc:	03065506 	movweq	r5, #25862	; 0x6506
 ad0:	250e1b0e 	strcs	r1, [lr, #-2830]	; 0xfffff4f2
 ad4:	0005130e 	andeq	r1, r5, lr, lsl #6
	...

Disassembly of section .debug_loc:

