mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
00000000 <.debug_loc>:
       0:	080006b0 	stmdaeq	r0, {r4, r5, r7, r9, sl}
       4:	080006b2 	stmdaeq	r0, {r1, r4, r5, r7, r9, sl}
       8:	007d0002 	rsbseq	r0, sp, r2
       c:	080006b2 	stmdaeq	r0, {r1, r4, r5, r7, r9, sl}
      10:	080006b4 	stmdaeq	r0, {r2, r4, r5, r7, r9, sl}
      14:	087d0002 	ldmdaeq	sp!, {r1}^
      18:	080006b4 	stmdaeq	r0, {r2, r4, r5, r7, r9, sl}
      1c:	08000758 	stmdaeq	r0, {r3, r4, r6, r8, r9, sl}
      20:	08770002 	ldmdaeq	r7!, {r1}^
	...
      2c:	08000608 	stmdaeq	r0, {r3, r9, sl}
      30:	0800060a 	stmdaeq	r0, {r1, r3, r9, sl}
      34:	007d0002 	rsbseq	r0, sp, r2
      38:	0800060a 	stmdaeq	r0, {r1, r3, r9, sl}
      3c:	0800060c 	stmdaeq	r0, {r2, r3, r9, sl}
      40:	087d0002 	ldmdaeq	sp!, {r1}^
      44:	0800060c 	stmdaeq	r0, {r2, r3, r9, sl}
      48:	080006b0 	stmdaeq	r0, {r4, r5, r7, r9, sl}
      4c:	08770002 	ldmdaeq	r7!, {r1}^
	...
      58:	080005e4 	stmdaeq	r0, {r2, r5, r6, r7, r8, sl}
      5c:	080005e6 	stmdaeq	r0, {r1, r2, r5, r6, r7, r8, sl}
      60:	007d0002 	rsbseq	r0, sp, r2
      64:	080005e6 	stmdaeq	r0, {r1, r2, r5, r6, r7, r8, sl}
      68:	080005e8 	stmdaeq	r0, {r3, r5, r6, r7, r8, sl}
      6c:	087d0002 	ldmdaeq	sp!, {r1}^
      70:	080005e8 	stmdaeq	r0, {r3, r5, r6, r7, r8, sl}
      74:	08000608 	stmdaeq	r0, {r3, r9, sl}
      78:	08770002 	ldmdaeq	r7!, {r1}^
	...
      84:	080005c0 	stmdaeq	r0, {r6, r7, r8, sl}
      88:	080005c2 	stmdaeq	r0, {r1, r6, r7, r8, sl}
      8c:	007d0002 	rsbseq	r0, sp, r2
      90:	080005c2 	stmdaeq	r0, {r1, r6, r7, r8, sl}
      94:	080005c4 	stmdaeq	r0, {r2, r6, r7, r8, sl}
      98:	087d0002 	ldmdaeq	sp!, {r1}^
      9c:	080005c4 	stmdaeq	r0, {r2, r6, r7, r8, sl}
      a0:	080005e4 	stmdaeq	r0, {r2, r5, r6, r7, r8, sl}
      a4:	08770002 	ldmdaeq	r7!, {r1}^
	...
      b0:	0800059c 	stmdaeq	r0, {r2, r3, r4, r7, r8, sl}
      b4:	0800059e 	stmdaeq	r0, {r1, r2, r3, r4, r7, r8, sl}
      b8:	007d0002 	rsbseq	r0, sp, r2
      bc:	0800059e 	stmdaeq	r0, {r1, r2, r3, r4, r7, r8, sl}
      c0:	080005a0 	stmdaeq	r0, {r5, r7, r8, sl}
      c4:	087d0002 	ldmdaeq	sp!, {r1}^
      c8:	080005a0 	stmdaeq	r0, {r5, r7, r8, sl}
      cc:	080005c0 	stmdaeq	r0, {r6, r7, r8, sl}
      d0:	08770002 	ldmdaeq	r7!, {r1}^
	...
      dc:	08000578 	stmdaeq	r0, {r3, r4, r5, r6, r8, sl}
      e0:	0800057a 	stmdaeq	r0, {r1, r3, r4, r5, r6, r8, sl}
      e4:	007d0002 	rsbseq	r0, sp, r2
      e8:	0800057a 	stmdaeq	r0, {r1, r3, r4, r5, r6, r8, sl}
      ec:	0800057c 	stmdaeq	r0, {r2, r3, r4, r5, r6, r8, sl}
      f0:	087d0002 	ldmdaeq	sp!, {r1}^
      f4:	0800057c 	stmdaeq	r0, {r2, r3, r4, r5, r6, r8, sl}
      f8:	0800059c 	stmdaeq	r0, {r2, r3, r4, r7, r8, sl}
      fc:	08770002 	ldmdaeq	r7!, {r1}^
	...
     108:	08000554 	stmdaeq	r0, {r2, r4, r6, r8, sl}
     10c:	08000556 	stmdaeq	r0, {r1, r2, r4, r6, r8, sl}
     110:	007d0002 	rsbseq	r0, sp, r2
     114:	08000556 	stmdaeq	r0, {r1, r2, r4, r6, r8, sl}
     118:	08000558 	stmdaeq	r0, {r3, r4, r6, r8, sl}
     11c:	087d0002 	ldmdaeq	sp!, {r1}^
     120:	08000558 	stmdaeq	r0, {r3, r4, r6, r8, sl}
     124:	08000578 	stmdaeq	r0, {r3, r4, r5, r6, r8, sl}
     128:	08770002 	ldmdaeq	r7!, {r1}^
	...
     13c:	007d0002 	rsbseq	r0, sp, r2
	...
     148:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     154:	04770002 	ldrbteq	r0, [r7], #-2
	...
     160:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     16c:	007d0002 	rsbseq	r0, sp, r2
	...
     178:	08000384 	stmdaeq	r0, {r2, r7, r8, r9}
     17c:	08000386 	stmdaeq	r0, {r1, r2, r7, r8, r9}
     180:	007d0002 	rsbseq	r0, sp, r2
     184:	08000386 	stmdaeq	r0, {r1, r2, r7, r8, r9}
     188:	08000388 	stmdaeq	r0, {r3, r7, r8, r9}
     18c:	087d0002 	ldmdaeq	sp!, {r1}^
     190:	08000388 	stmdaeq	r0, {r3, r7, r8, r9}
     194:	0800038a 	stmdaeq	r0, {r1, r3, r7, r8, r9}
     198:	187d0002 	ldmdane	sp!, {r1}^
     19c:	0800038a 	stmdaeq	r0, {r1, r3, r7, r8, r9}
     1a0:	08000530 	stmdaeq	r0, {r4, r5, r8, sl}
     1a4:	18770002 	ldmdane	r7!, {r1}^
     1a8:	08000530 	stmdaeq	r0, {r4, r5, r8, sl}
     1ac:	08000532 	stmdaeq	r0, {r1, r4, r5, r8, sl}
     1b0:	08770002 	ldmdaeq	r7!, {r1}^
     1b4:	08000532 	stmdaeq	r0, {r1, r4, r5, r8, sl}
     1b8:	08000554 	stmdaeq	r0, {r2, r4, r6, r8, sl}
     1bc:	087d0002 	ldmdaeq	sp!, {r1}^
	...
     1c8:	08000308 	stmdaeq	r0, {r3, r8, r9}
     1cc:	0800030a 	stmdaeq	r0, {r1, r3, r8, r9}
     1d0:	007d0002 	rsbseq	r0, sp, r2
     1d4:	0800030a 	stmdaeq	r0, {r1, r3, r8, r9}
     1d8:	0800030c 	stmdaeq	r0, {r2, r3, r8, r9}
     1dc:	047d0002 	ldrbteq	r0, [sp], #-2
     1e0:	0800030c 	stmdaeq	r0, {r2, r3, r8, r9}
     1e4:	0800030e 	stmdaeq	r0, {r1, r2, r3, r8, r9}
     1e8:	187d0002 	ldmdane	sp!, {r1}^
     1ec:	0800030e 	stmdaeq	r0, {r1, r2, r3, r8, r9}
     1f0:	0800037e 	stmdaeq	r0, {r1, r2, r3, r4, r5, r6, r8, r9}
     1f4:	18770002 	ldmdane	r7!, {r1}^
     1f8:	0800037e 	stmdaeq	r0, {r1, r2, r3, r4, r5, r6, r8, r9}
     1fc:	08000380 	stmdaeq	r0, {r7, r8, r9}
     200:	04770002 	ldrbteq	r0, [r7], #-2
     204:	08000380 	stmdaeq	r0, {r7, r8, r9}
     208:	08000382 	stmdaeq	r0, {r1, r7, r8, r9}
     20c:	047d0002 	ldrbteq	r0, [sp], #-2
     210:	08000382 	stmdaeq	r0, {r1, r7, r8, r9}
     214:	08000384 	stmdaeq	r0, {r2, r7, r8, r9}
     218:	007d0002 	rsbseq	r0, sp, r2
	...
     224:	0800023c 	stmdaeq	r0, {r2, r3, r4, r5, r9}
     228:	0800023e 	stmdaeq	r0, {r1, r2, r3, r4, r5, r9}
     22c:	007d0002 	rsbseq	r0, sp, r2
     230:	0800023e 	stmdaeq	r0, {r1, r2, r3, r4, r5, r9}
     234:	08000240 	stmdaeq	r0, {r6, r9}
     238:	047d0002 	ldrbteq	r0, [sp], #-2
     23c:	08000240 	stmdaeq	r0, {r6, r9}
     240:	08000242 	stmdaeq	r0, {r1, r6, r9}
     244:	107d0002 	rsbsne	r0, sp, r2
     248:	08000242 	stmdaeq	r0, {r1, r6, r9}
     24c:	080002fa 	stmdaeq	r0, {r1, r3, r4, r5, r6, r7, r9}
     250:	10770002 	rsbsne	r0, r7, r2
     254:	080002fa 	stmdaeq	r0, {r1, r3, r4, r5, r6, r7, r9}
     258:	080002fc 	stmdaeq	r0, {r2, r3, r4, r5, r6, r7, r9}
     25c:	04770002 	ldrbteq	r0, [r7], #-2
     260:	080002fc 	stmdaeq	r0, {r2, r3, r4, r5, r6, r7, r9}
     264:	080002fe 	stmdaeq	r0, {r1, r2, r3, r4, r5, r6, r7, r9}
     268:	047d0002 	ldrbteq	r0, [sp], #-2
     26c:	080002fe 	stmdaeq	r0, {r1, r2, r3, r4, r5, r6, r7, r9}
     270:	08000308 	stmdaeq	r0, {r3, r8, r9}
     274:	007d0002 	rsbseq	r0, sp, r2
	...
     280:	08000170 	stmdaeq	r0, {r4, r5, r6, r8}
     284:	08000172 	stmdaeq	r0, {r1, r4, r5, r6, r8}
     288:	007d0002 	rsbseq	r0, sp, r2
     28c:	08000172 	stmdaeq	r0, {r1, r4, r5, r6, r8}
     290:	08000174 	stmdaeq	r0, {r2, r4, r5, r6, r8}
     294:	047d0002 	ldrbteq	r0, [sp], #-2
     298:	08000174 	stmdaeq	r0, {r2, r4, r5, r6, r8}
     29c:	08000176 	stmdaeq	r0, {r1, r2, r4, r5, r6, r8}
     2a0:	107d0002 	rsbsne	r0, sp, r2
     2a4:	08000176 	stmdaeq	r0, {r1, r2, r4, r5, r6, r8}
     2a8:	0800022e 	stmdaeq	r0, {r1, r2, r3, r5, r9}
     2ac:	10770002 	rsbsne	r0, r7, r2
     2b0:	0800022e 	stmdaeq	r0, {r1, r2, r3, r5, r9}
     2b4:	08000230 	stmdaeq	r0, {r4, r5, r9}
     2b8:	04770002 	ldrbteq	r0, [r7], #-2
     2bc:	08000230 	stmdaeq	r0, {r4, r5, r9}
     2c0:	08000232 	stmdaeq	r0, {r1, r4, r5, r9}
     2c4:	047d0002 	ldrbteq	r0, [sp], #-2
     2c8:	08000232 	stmdaeq	r0, {r1, r4, r5, r9}
     2cc:	0800023c 	stmdaeq	r0, {r2, r3, r4, r5, r9}
     2d0:	007d0002 	rsbseq	r0, sp, r2
	...
     2e4:	007d0002 	rsbseq	r0, sp, r2
	...
     2f0:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     2fc:	107d0002 	rsbsne	r0, sp, r2
	...
     308:	10770002 	rsbsne	r0, r7, r2
	...
     314:	04770002 	ldrbteq	r0, [r7], #-2
	...
     320:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     32c:	007d0002 	rsbseq	r0, sp, r2
	...
     340:	007d0002 	rsbseq	r0, sp, r2
	...
     34c:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     358:	107d0002 	rsbsne	r0, sp, r2
	...
     364:	10770002 	rsbsne	r0, r7, r2
	...
     370:	04770002 	ldrbteq	r0, [r7], #-2
	...
     37c:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     388:	007d0002 	rsbseq	r0, sp, r2
	...
     39c:	007d0002 	rsbseq	r0, sp, r2
	...
     3a8:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     3b4:	107d0002 	rsbsne	r0, sp, r2
	...
     3c0:	10770002 	rsbsne	r0, r7, r2
	...
     3cc:	04770002 	ldrbteq	r0, [r7], #-2
	...
     3d8:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     3e4:	007d0002 	rsbseq	r0, sp, r2
	...
     3f8:	007d0002 	rsbseq	r0, sp, r2
	...
     404:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     410:	107d0002 	rsbsne	r0, sp, r2
	...
     41c:	10770002 	rsbsne	r0, r7, r2
	...
     428:	04770002 	ldrbteq	r0, [r7], #-2
	...
     434:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     440:	007d0002 	rsbseq	r0, sp, r2
	...
     454:	007d0002 	rsbseq	r0, sp, r2
	...
     460:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     46c:	107d0002 	rsbsne	r0, sp, r2
	...
     478:	10770002 	rsbsne	r0, r7, r2
	...
     484:	04770002 	ldrbteq	r0, [r7], #-2
	...
     490:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     49c:	007d0002 	rsbseq	r0, sp, r2
	...
     4b0:	007d0002 	rsbseq	r0, sp, r2
	...
     4bc:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     4c8:	107d0002 	rsbsne	r0, sp, r2
	...
     4d4:	10770002 	rsbsne	r0, r7, r2
	...
     4e0:	04770002 	ldrbteq	r0, [r7], #-2
	...
     4ec:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     4f8:	007d0002 	rsbseq	r0, sp, r2
	...
     50c:	007d0002 	rsbseq	r0, sp, r2
	...
     518:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     524:	107d0002 	rsbsne	r0, sp, r2
	...
     530:	10770002 	rsbsne	r0, r7, r2
	...
     53c:	04770002 	ldrbteq	r0, [r7], #-2
	...
     548:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     554:	007d0002 	rsbseq	r0, sp, r2
	...
     560:	08000820 	stmdaeq	r0, {r5, fp}
     564:	08000822 	stmdaeq	r0, {r1, r5, fp}
     568:	007d0002 	rsbseq	r0, sp, r2
     56c:	08000822 	stmdaeq	r0, {r1, r5, fp}
     570:	08000824 	stmdaeq	r0, {r2, r5, fp}
     574:	0c7d0002 	ldcleq	0, cr0, [sp], #-8
     578:	08000824 	stmdaeq	r0, {r2, r5, fp}
     57c:	08000826 	stmdaeq	r0, {r1, r2, r5, fp}
     580:	207d0002 	rsbscs	r0, sp, r2
     584:	08000826 	stmdaeq	r0, {r1, r2, r5, fp}
     588:	08000a1a 	stmdaeq	r0, {r1, r3, r4, r9, fp}
     58c:	20770002 	rsbscs	r0, r7, r2
     590:	08000a1a 	stmdaeq	r0, {r1, r3, r4, r9, fp}
     594:	08000a1c 	stmdaeq	r0, {r2, r3, r4, r9, fp}
     598:	0c770002 	ldcleq	0, cr0, [r7], #-8
     59c:	08000a1c 	stmdaeq	r0, {r2, r3, r4, r9, fp}
     5a0:	08000a3c 	stmdaeq	r0, {r2, r3, r4, r5, r9, fp}
     5a4:	0c7d0002 	ldcleq	0, cr0, [sp], #-8
	...
     5b0:	08000758 	stmdaeq	r0, {r3, r4, r6, r8, r9, sl}
     5b4:	0800075a 	stmdaeq	r0, {r1, r3, r4, r6, r8, r9, sl}
     5b8:	007d0002 	rsbseq	r0, sp, r2
     5bc:	0800075a 	stmdaeq	r0, {r1, r3, r4, r6, r8, r9, sl}
     5c0:	0800075c 	stmdaeq	r0, {r2, r3, r4, r6, r8, r9, sl}
     5c4:	047d0002 	ldrbteq	r0, [sp], #-2
     5c8:	0800075c 	stmdaeq	r0, {r2, r3, r4, r6, r8, r9, sl}
     5cc:	0800075e 	stmdaeq	r0, {r1, r2, r3, r4, r6, r8, r9, sl}
     5d0:	107d0002 	rsbsne	r0, sp, r2
     5d4:	0800075e 	stmdaeq	r0, {r1, r2, r3, r4, r6, r8, r9, sl}
     5d8:	08000818 	stmdaeq	r0, {r3, r4, fp}
     5dc:	10770002 	rsbsne	r0, r7, r2
     5e0:	08000818 	stmdaeq	r0, {r3, r4, fp}
     5e4:	0800081a 	stmdaeq	r0, {r1, r3, r4, fp}
     5e8:	04770002 	ldrbteq	r0, [r7], #-2
     5ec:	0800081a 	stmdaeq	r0, {r1, r3, r4, fp}
     5f0:	0800081c 	stmdaeq	r0, {r2, r3, r4, fp}
     5f4:	047d0002 	ldrbteq	r0, [sp], #-2
     5f8:	0800081c 	stmdaeq	r0, {r2, r3, r4, fp}
     5fc:	0800081e 	stmdaeq	r0, {r1, r2, r3, r4, fp}
     600:	007d0002 	rsbseq	r0, sp, r2
	...
     60c:	08000af8 	stmdaeq	r0, {r3, r4, r5, r6, r7, r9, fp}
     610:	08000afa 	stmdaeq	r0, {r1, r3, r4, r5, r6, r7, r9, fp}
     614:	007d0002 	rsbseq	r0, sp, r2
     618:	08000afa 	stmdaeq	r0, {r1, r3, r4, r5, r6, r7, r9, fp}
     61c:	08000afc 	stmdaeq	r0, {r2, r3, r4, r5, r6, r7, r9, fp}
     620:	087d0002 	ldmdaeq	sp!, {r1}^
     624:	08000afc 	stmdaeq	r0, {r2, r3, r4, r5, r6, r7, r9, fp}
     628:	08000b50 	stmdaeq	r0, {r4, r6, r8, r9, fp}
     62c:	08770002 	ldmdaeq	r7!, {r1}^
	...
     638:	08000aa0 	stmdaeq	r0, {r5, r7, r9, fp}
     63c:	08000aa2 	stmdaeq	r0, {r1, r5, r7, r9, fp}
     640:	007d0002 	rsbseq	r0, sp, r2
     644:	08000aa2 	stmdaeq	r0, {r1, r5, r7, r9, fp}
     648:	08000aa4 	stmdaeq	r0, {r2, r5, r7, r9, fp}
     64c:	087d0002 	ldmdaeq	sp!, {r1}^
     650:	08000aa4 	stmdaeq	r0, {r2, r5, r7, r9, fp}
     654:	08000af8 	stmdaeq	r0, {r3, r4, r5, r6, r7, r9, fp}
     658:	08770002 	ldmdaeq	r7!, {r1}^
	...
     664:	08000a3c 	stmdaeq	r0, {r2, r3, r4, r5, r9, fp}
     668:	08000a3e 	stmdaeq	r0, {r1, r2, r3, r4, r5, r9, fp}
     66c:	007d0002 	rsbseq	r0, sp, r2
     670:	08000a3e 	stmdaeq	r0, {r1, r2, r3, r4, r5, r9, fp}
     674:	08000a40 	stmdaeq	r0, {r6, r9, fp}
     678:	087d0002 	ldmdaeq	sp!, {r1}^
     67c:	08000a40 	stmdaeq	r0, {r6, r9, fp}
     680:	08000aa0 	stmdaeq	r0, {r5, r7, r9, fp}
     684:	08770002 	ldmdaeq	r7!, {r1}^
	...
     698:	007d0002 	rsbseq	r0, sp, r2
	...
     6a4:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     6b0:	107d0002 	rsbsne	r0, sp, r2
	...
     6bc:	10770002 	rsbsne	r0, r7, r2
	...
     6c8:	04770002 	ldrbteq	r0, [r7], #-2
	...
     6d4:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     6e0:	007d0002 	rsbseq	r0, sp, r2
	...
     6f4:	007d0002 	rsbseq	r0, sp, r2
	...
     700:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     70c:	107d0002 	rsbsne	r0, sp, r2
	...
     718:	10770002 	rsbsne	r0, r7, r2
	...
     724:	04770002 	ldrbteq	r0, [r7], #-2
	...
     730:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     73c:	007d0002 	rsbseq	r0, sp, r2
	...
     750:	007d0002 	rsbseq	r0, sp, r2
	...
     75c:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     768:	187d0002 	ldmdane	sp!, {r1}^
	...
     774:	18770002 	ldmdane	r7!, {r1}^
	...
     780:	04770002 	ldrbteq	r0, [r7], #-2
	...
     78c:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     798:	007d0002 	rsbseq	r0, sp, r2
	...
     7ac:	007d0002 	rsbseq	r0, sp, r2
	...
     7b8:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     7c4:	107d0002 	rsbsne	r0, sp, r2
	...
     7d0:	10770002 	rsbsne	r0, r7, r2
	...
     7dc:	04770002 	ldrbteq	r0, [r7], #-2
	...
     7e8:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     7f4:	007d0002 	rsbseq	r0, sp, r2
	...
     808:	007d0002 	rsbseq	r0, sp, r2
	...
     814:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     820:	187d0002 	ldmdane	sp!, {r1}^
	...
     82c:	18770002 	ldmdane	r7!, {r1}^
	...
     838:	04770002 	ldrbteq	r0, [r7], #-2
	...
     844:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     850:	007d0002 	rsbseq	r0, sp, r2
	...
     864:	007d0002 	rsbseq	r0, sp, r2
	...
     870:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     87c:	107d0002 	rsbsne	r0, sp, r2
	...
     888:	10770002 	rsbsne	r0, r7, r2
	...
     894:	04770002 	ldrbteq	r0, [r7], #-2
	...
     8a0:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     8ac:	007d0002 	rsbseq	r0, sp, r2
	...
     8c0:	007d0002 	rsbseq	r0, sp, r2
	...
     8cc:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     8d8:	107d0002 	rsbsne	r0, sp, r2
	...
     8e4:	10770002 	rsbsne	r0, r7, r2
	...
     8f0:	04770002 	ldrbteq	r0, [r7], #-2
	...
     8fc:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     908:	007d0002 	rsbseq	r0, sp, r2
	...
     91c:	007d0002 	rsbseq	r0, sp, r2
	...
     928:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     934:	107d0002 	rsbsne	r0, sp, r2
	...
     940:	10770002 	rsbsne	r0, r7, r2
	...
     94c:	04770002 	ldrbteq	r0, [r7], #-2
	...
     958:	047d0002 	ldrbteq	r0, [sp], #-2
	...
     964:	007d0002 	rsbseq	r0, sp, r2
	...
     978:	007d0002 	rsbseq	r0, sp, r2
	...
     984:	087d0002 	ldmdaeq	sp!, {r1}^
	...
     990:	a87d0003 	ldmdage	sp!, {r0, r1}^
     994:	00000001 	andeq	r0, r0, r1
     998:	00000000 	andeq	r0, r0, r0
     99c:	77000300 	strvc	r0, [r0, -r0, lsl #6]
     9a0:	000001a8 	andeq	r0, r0, r8, lsr #3
     9a4:	00000000 	andeq	r0, r0, r0
     9a8:	00020000 	andeq	r0, r2, r0
     9ac:	00000877 	andeq	r0, r0, r7, ror r8
     9b0:	00000000 	andeq	r0, r0, r0
     9b4:	00020000 	andeq	r0, r2, r0
     9b8:	0000087d 	andeq	r0, r0, sp, ror r8
	...
     9c8:	00020000 	andeq	r0, r2, r0
     9cc:	0000007d 	andeq	r0, r0, sp, ror r0
     9d0:	00000000 	andeq	r0, r0, r0
     9d4:	00020000 	andeq	r0, r2, r0
     9d8:	0000047d 	andeq	r0, r0, sp, ror r4
     9dc:	00000000 	andeq	r0, r0, r0
     9e0:	00020000 	andeq	r0, r2, r0
     9e4:	0000107d 	andeq	r1, r0, sp, ror r0
     9e8:	00000000 	andeq	r0, r0, r0
     9ec:	00020000 	andeq	r0, r2, r0
     9f0:	00001077 	andeq	r1, r0, r7, ror r0
     9f4:	00000000 	andeq	r0, r0, r0
     9f8:	00020000 	andeq	r0, r2, r0
     9fc:	00000477 	andeq	r0, r0, r7, ror r4
     a00:	00000000 	andeq	r0, r0, r0
     a04:	00020000 	andeq	r0, r2, r0
     a08:	0000047d 	andeq	r0, r0, sp, ror r4
     a0c:	00000000 	andeq	r0, r0, r0
     a10:	00020000 	andeq	r0, r2, r0
     a14:	0000007d 	andeq	r0, r0, sp, ror r0
	...
     a24:	00020000 	andeq	r0, r2, r0
     a28:	0000007d 	andeq	r0, r0, sp, ror r0
     a2c:	00000000 	andeq	r0, r0, r0
     a30:	00020000 	andeq	r0, r2, r0
     a34:	0000087d 	andeq	r0, r0, sp, ror r8
     a38:	00000000 	andeq	r0, r0, r0
     a3c:	00020000 	andeq	r0, r2, r0
     a40:	0000287d 	andeq	r2, r0, sp, ror r8
     a44:	00000000 	andeq	r0, r0, r0
     a48:	00020000 	andeq	r0, r2, r0
     a4c:	00002877 	andeq	r2, r0, r7, ror r8
     a50:	00000000 	andeq	r0, r0, r0
     a54:	00020000 	andeq	r0, r2, r0
     a58:	00000877 	andeq	r0, r0, r7, ror r8
     a5c:	00000000 	andeq	r0, r0, r0
     a60:	00020000 	andeq	r0, r2, r0
     a64:	0000087d 	andeq	r0, r0, sp, ror r8
     a68:	00000000 	andeq	r0, r0, r0
     a6c:	00020000 	andeq	r0, r2, r0
     a70:	0000007d 	andeq	r0, r0, sp, ror r0
     a74:	00000000 	andeq	r0, r0, r0
     a78:	0e380000 	cdpeq	0, 3, cr0, cr8, cr0, {0}
     a7c:	0e3a0800 	cdpeq	8, 3, cr0, cr10, cr0, {0}
     a80:	00020800 	andeq	r0, r2, r0, lsl #16
     a84:	0e3a007d 	mrceq	0, 1, r0, cr10, cr13, {3}
     a88:	0e3c0800 	cdpeq	8, 3, cr0, cr12, cr0, {0}
     a8c:	00020800 	andeq	r0, r2, r0, lsl #16
     a90:	0e3c087d 	mrceq	8, 1, r0, cr12, cr13, {3}
     a94:	0e3e0800 	cdpeq	8, 3, cr0, cr14, cr0, {0}
     a98:	00020800 	andeq	r0, r2, r0, lsl #16
     a9c:	0e3e107d 	mrceq	0, 1, r1, cr14, cr13, {3}
     aa0:	0f1e0800 	svceq	0x001e0800
     aa4:	00020800 	andeq	r0, r2, r0, lsl #16
     aa8:	0f1e1077 	svceq	0x001e1077
     aac:	0f200800 	svceq	0x00200800
     ab0:	00020800 	andeq	r0, r2, r0, lsl #16
     ab4:	0f200877 	svceq	0x00200877
     ab8:	0f300800 	svceq	0x00300800
     abc:	00020800 	andeq	r0, r2, r0, lsl #16
     ac0:	0000087d 	andeq	r0, r0, sp, ror r8
     ac4:	00000000 	andeq	r0, r0, r0
     ac8:	0d3c0000 	ldceq	0, cr0, [ip, #-0]
     acc:	0d3e0800 	ldceq	8, cr0, [lr, #-0]
     ad0:	00020800 	andeq	r0, r2, r0, lsl #16
     ad4:	0d3e007d 	ldceq	0, cr0, [lr, #-500]!	; 0xfffffe0c
     ad8:	0d400800 	stcleq	8, cr0, [r0, #-0]
     adc:	00020800 	andeq	r0, r2, r0, lsl #16
     ae0:	0d40087d 	stcleq	8, cr0, [r0, #-500]	; 0xfffffe0c
     ae4:	0d420800 	stcleq	8, cr0, [r2, #-0]
     ae8:	00020800 	andeq	r0, r2, r0, lsl #16
     aec:	0d42187d 	stcleq	8, cr1, [r2, #-500]	; 0xfffffe0c
     af0:	0e280800 	cdpeq	8, 2, cr0, cr8, cr0, {0}
     af4:	00020800 	andeq	r0, r2, r0, lsl #16
     af8:	0e281877 	mcreq	8, 1, r1, cr8, cr7, {3}
     afc:	0e2a0800 	cdpeq	8, 2, cr0, cr10, cr0, {0}
     b00:	00020800 	andeq	r0, r2, r0, lsl #16
     b04:	0e2a0877 	mcreq	8, 1, r0, cr10, cr7, {3}
     b08:	0e380800 	cdpeq	8, 3, cr0, cr8, cr0, {0}
     b0c:	00020800 	andeq	r0, r2, r0, lsl #16
     b10:	0000087d 	andeq	r0, r0, sp, ror r8
     b14:	00000000 	andeq	r0, r0, r0
     b18:	0c480000 	mareq	acc0, r0, r8
     b1c:	0c4a0800 	mcrreq	8, 0, r0, sl, cr0
     b20:	00020800 	andeq	r0, r2, r0, lsl #16
     b24:	0c4a007d 	mcrreq	0, 7, r0, sl, cr13
     b28:	0c4c0800 	mcrreq	8, 0, r0, ip, cr0
     b2c:	00020800 	andeq	r0, r2, r0, lsl #16
     b30:	0c4c087d 	mcrreq	8, 7, r0, ip, cr13
     b34:	0c4e0800 	mcrreq	8, 0, r0, lr, cr0
     b38:	00020800 	andeq	r0, r2, r0, lsl #16
     b3c:	0c4e107d 	mcrreq	0, 7, r1, lr, cr13
     b40:	0d2e0800 	stceq	8, cr0, [lr, #-0]
     b44:	00020800 	andeq	r0, r2, r0, lsl #16
     b48:	0d2e1077 	stceq	0, cr1, [lr, #-476]!	; 0xfffffe24
     b4c:	0d300800 	ldceq	8, cr0, [r0, #-0]
     b50:	00020800 	andeq	r0, r2, r0, lsl #16
     b54:	0d300877 	ldceq	8, cr0, [r0, #-476]!	; 0xfffffe24
     b58:	0d3c0800 	ldceq	8, cr0, [ip, #-0]
     b5c:	00020800 	andeq	r0, r2, r0, lsl #16
     b60:	0000087d 	andeq	r0, r0, sp, ror r8
     b64:	00000000 	andeq	r0, r0, r0
     b68:	0b500000 	bleq	1400b70 <_Min_Stack_Size+0x1400770>
     b6c:	0b520800 	bleq	1482b74 <_Min_Stack_Size+0x1482774>
     b70:	00020800 	andeq	r0, r2, r0, lsl #16
     b74:	0b52007d 	bleq	1480d70 <_Min_Stack_Size+0x1480970>
     b78:	0b540800 	bleq	1502b80 <_Min_Stack_Size+0x1502780>
     b7c:	00020800 	andeq	r0, r2, r0, lsl #16
     b80:	0b54087d 	bleq	1502d7c <_Min_Stack_Size+0x150297c>
     b84:	0b560800 	bleq	1582b8c <_Min_Stack_Size+0x158278c>
     b88:	00020800 	andeq	r0, r2, r0, lsl #16
     b8c:	0b56187d 	bleq	1586d88 <_Min_Stack_Size+0x1586988>
     b90:	0c3c0800 	ldceq	8, cr0, [ip], #-0
     b94:	00020800 	andeq	r0, r2, r0, lsl #16
     b98:	0c3c1877 	ldceq	8, cr1, [ip], #-476	; 0xfffffe24
     b9c:	0c3e0800 	ldceq	8, cr0, [lr], #-0
     ba0:	00020800 	andeq	r0, r2, r0, lsl #16
     ba4:	0c3e0877 	ldceq	8, cr0, [lr], #-476	; 0xfffffe24
     ba8:	0c480800 	mcrreq	8, 0, r0, r8, cr0
     bac:	00020800 	andeq	r0, r2, r0, lsl #16
     bb0:	0000087d 	andeq	r0, r0, sp, ror r8
	...
     bc0:	00020000 	andeq	r0, r2, r0
     bc4:	0000007d 	andeq	r0, r0, sp, ror r0
     bc8:	00000000 	andeq	r0, r0, r0
     bcc:	00020000 	andeq	r0, r2, r0
     bd0:	0000047d 	andeq	r0, r0, sp, ror r4
     bd4:	00000000 	andeq	r0, r0, r0
     bd8:	00020000 	andeq	r0, r2, r0
     bdc:	0000107d 	andeq	r1, r0, sp, ror r0
     be0:	00000000 	andeq	r0, r0, r0
     be4:	00020000 	andeq	r0, r2, r0
     be8:	00001077 	andeq	r1, r0, r7, ror r0
     bec:	00000000 	andeq	r0, r0, r0
     bf0:	00020000 	andeq	r0, r2, r0
     bf4:	00000477 	andeq	r0, r0, r7, ror r4
     bf8:	00000000 	andeq	r0, r0, r0
     bfc:	00020000 	andeq	r0, r2, r0
     c00:	0000047d 	andeq	r0, r0, sp, ror r4
     c04:	00000000 	andeq	r0, r0, r0
     c08:	00020000 	andeq	r0, r2, r0
     c0c:	0000007d 	andeq	r0, r0, sp, ror r0
	...
     c1c:	00020000 	andeq	r0, r2, r0
     c20:	0000007d 	andeq	r0, r0, sp, ror r0
     c24:	00000000 	andeq	r0, r0, r0
     c28:	00020000 	andeq	r0, r2, r0
     c2c:	0000047d 	andeq	r0, r0, sp, ror r4
     c30:	00000000 	andeq	r0, r0, r0
     c34:	00020000 	andeq	r0, r2, r0
     c38:	0000107d 	andeq	r1, r0, sp, ror r0
     c3c:	00000000 	andeq	r0, r0, r0
     c40:	00020000 	andeq	r0, r2, r0
     c44:	00001077 	andeq	r1, r0, r7, ror r0
     c48:	00000000 	andeq	r0, r0, r0
     c4c:	00020000 	andeq	r0, r2, r0
     c50:	00000477 	andeq	r0, r0, r7, ror r4
     c54:	00000000 	andeq	r0, r0, r0
     c58:	00020000 	andeq	r0, r2, r0
     c5c:	0000047d 	andeq	r0, r0, sp, ror r4
     c60:	00000000 	andeq	r0, r0, r0
     c64:	00020000 	andeq	r0, r2, r0
     c68:	0000007d 	andeq	r0, r0, sp, ror r0
	...
     c78:	00020000 	andeq	r0, r2, r0
     c7c:	0000007d 	andeq	r0, r0, sp, ror r0
     c80:	00000000 	andeq	r0, r0, r0
     c84:	00020000 	andeq	r0, r2, r0
     c88:	0000047d 	andeq	r0, r0, sp, ror r4
     c8c:	00000000 	andeq	r0, r0, r0
     c90:	00020000 	andeq	r0, r2, r0
     c94:	0000107d 	andeq	r1, r0, sp, ror r0
     c98:	00000000 	andeq	r0, r0, r0
     c9c:	00020000 	andeq	r0, r2, r0
     ca0:	00001077 	andeq	r1, r0, r7, ror r0
     ca4:	00000000 	andeq	r0, r0, r0
     ca8:	00020000 	andeq	r0, r2, r0
     cac:	00000477 	andeq	r0, r0, r7, ror r4
     cb0:	00000000 	andeq	r0, r0, r0
     cb4:	00020000 	andeq	r0, r2, r0
     cb8:	0000047d 	andeq	r0, r0, sp, ror r4
     cbc:	00000000 	andeq	r0, r0, r0
     cc0:	00020000 	andeq	r0, r2, r0
     cc4:	0000007d 	andeq	r0, r0, sp, ror r0
	...
     cd4:	00020000 	andeq	r0, r2, r0
     cd8:	0000007d 	andeq	r0, r0, sp, ror r0
     cdc:	00000000 	andeq	r0, r0, r0
     ce0:	00020000 	andeq	r0, r2, r0
     ce4:	0000087d 	andeq	r0, r0, sp, ror r8
     ce8:	00000000 	andeq	r0, r0, r0
     cec:	00020000 	andeq	r0, r2, r0
     cf0:	0000207d 	andeq	r2, r0, sp, ror r0
