mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
     cf4:	00000000 	andeq	r0, r0, r0
     cf8:	00020000 	andeq	r0, r2, r0
     cfc:	00002077 	andeq	r2, r0, r7, ror r0
     d00:	00000000 	andeq	r0, r0, r0
     d04:	00020000 	andeq	r0, r2, r0
     d08:	00000877 	andeq	r0, r0, r7, ror r8
     d0c:	00000000 	andeq	r0, r0, r0
     d10:	00020000 	andeq	r0, r2, r0
     d14:	0000087d 	andeq	r0, r0, sp, ror r8
	...
     d24:	00020000 	andeq	r0, r2, r0
     d28:	0000007d 	andeq	r0, r0, sp, ror r0
     d2c:	00000000 	andeq	r0, r0, r0
     d30:	00020000 	andeq	r0, r2, r0
     d34:	0000087d 	andeq	r0, r0, sp, ror r8
     d38:	00000000 	andeq	r0, r0, r0
     d3c:	00020000 	andeq	r0, r2, r0
     d40:	0000207d 	andeq	r2, r0, sp, ror r0
     d44:	00000000 	andeq	r0, r0, r0
     d48:	00020000 	andeq	r0, r2, r0
     d4c:	00002077 	andeq	r2, r0, r7, ror r0
     d50:	00000000 	andeq	r0, r0, r0
     d54:	00020000 	andeq	r0, r2, r0
     d58:	00000877 	andeq	r0, r0, r7, ror r8
     d5c:	00000000 	andeq	r0, r0, r0
     d60:	00020000 	andeq	r0, r2, r0
     d64:	0000087d 	andeq	r0, r0, sp, ror r8
	...
     d74:	00020000 	andeq	r0, r2, r0
     d78:	0000007d 	andeq	r0, r0, sp, ror r0
     d7c:	00000000 	andeq	r0, r0, r0
     d80:	00020000 	andeq	r0, r2, r0
     d84:	0000087d 	andeq	r0, r0, sp, ror r8
     d88:	00000000 	andeq	r0, r0, r0
     d8c:	00020000 	andeq	r0, r2, r0
     d90:	0000207d 	andeq	r2, r0, sp, ror r0
     d94:	00000000 	andeq	r0, r0, r0
     d98:	00020000 	andeq	r0, r2, r0
     d9c:	00002077 	andeq	r2, r0, r7, ror r0
     da0:	00000000 	andeq	r0, r0, r0
     da4:	00020000 	andeq	r0, r2, r0
     da8:	00000877 	andeq	r0, r0, r7, ror r8
     dac:	00000000 	andeq	r0, r0, r0
     db0:	00020000 	andeq	r0, r2, r0
     db4:	0000087d 	andeq	r0, r0, sp, ror r8
	...
     dc4:	00020000 	andeq	r0, r2, r0
     dc8:	0000007d 	andeq	r0, r0, sp, ror r0
     dcc:	00000000 	andeq	r0, r0, r0
     dd0:	00020000 	andeq	r0, r2, r0
     dd4:	0000087d 	andeq	r0, r0, sp, ror r8
     dd8:	00000000 	andeq	r0, r0, r0
     ddc:	00020000 	andeq	r0, r2, r0
     de0:	0000207d 	andeq	r2, r0, sp, ror r0
     de4:	00000000 	andeq	r0, r0, r0
     de8:	00020000 	andeq	r0, r2, r0
     dec:	00002077 	andeq	r2, r0, r7, ror r0
     df0:	00000000 	andeq	r0, r0, r0
     df4:	00020000 	andeq	r0, r2, r0
     df8:	00000877 	andeq	r0, r0, r7, ror r8
     dfc:	00000000 	andeq	r0, r0, r0
     e00:	00020000 	andeq	r0, r2, r0
     e04:	0000087d 	andeq	r0, r0, sp, ror r8
	...
     e14:	00020000 	andeq	r0, r2, r0
     e18:	0000007d 	andeq	r0, r0, sp, ror r0
     e1c:	00000000 	andeq	r0, r0, r0
     e20:	00020000 	andeq	r0, r2, r0
     e24:	0000047d 	andeq	r0, r0, sp, ror r4
     e28:	00000000 	andeq	r0, r0, r0
     e2c:	00020000 	andeq	r0, r2, r0
     e30:	0000107d 	andeq	r1, r0, sp, ror r0
     e34:	00000000 	andeq	r0, r0, r0
     e38:	00020000 	andeq	r0, r2, r0
     e3c:	00001077 	andeq	r1, r0, r7, ror r0
     e40:	00000000 	andeq	r0, r0, r0
     e44:	00020000 	andeq	r0, r2, r0
     e48:	00000477 	andeq	r0, r0, r7, ror r4
     e4c:	00000000 	andeq	r0, r0, r0
     e50:	00020000 	andeq	r0, r2, r0
     e54:	0000047d 	andeq	r0, r0, sp, ror r4
     e58:	00000000 	andeq	r0, r0, r0
     e5c:	00020000 	andeq	r0, r2, r0
     e60:	0000007d 	andeq	r0, r0, sp, ror r0
	...
     e70:	00020000 	andeq	r0, r2, r0
     e74:	0000007d 	andeq	r0, r0, sp, ror r0
     e78:	00000000 	andeq	r0, r0, r0
     e7c:	00020000 	andeq	r0, r2, r0
     e80:	0000047d 	andeq	r0, r0, sp, ror r4
     e84:	00000000 	andeq	r0, r0, r0
     e88:	00020000 	andeq	r0, r2, r0
     e8c:	0000107d 	andeq	r1, r0, sp, ror r0
     e90:	00000000 	andeq	r0, r0, r0
     e94:	00020000 	andeq	r0, r2, r0
     e98:	00001077 	andeq	r1, r0, r7, ror r0
     e9c:	00000000 	andeq	r0, r0, r0
     ea0:	00020000 	andeq	r0, r2, r0
     ea4:	00000477 	andeq	r0, r0, r7, ror r4
     ea8:	00000000 	andeq	r0, r0, r0
     eac:	00020000 	andeq	r0, r2, r0
     eb0:	0000047d 	andeq	r0, r0, sp, ror r4
     eb4:	00000000 	andeq	r0, r0, r0
     eb8:	00020000 	andeq	r0, r2, r0
     ebc:	0000007d 	andeq	r0, r0, sp, ror r0
	...
     ecc:	00020000 	andeq	r0, r2, r0
     ed0:	0000007d 	andeq	r0, r0, sp, ror r0
     ed4:	00000000 	andeq	r0, r0, r0
     ed8:	00020000 	andeq	r0, r2, r0
     edc:	0000087d 	andeq	r0, r0, sp, ror r8
     ee0:	00000000 	andeq	r0, r0, r0
     ee4:	00020000 	andeq	r0, r2, r0
     ee8:	0000107d 	andeq	r1, r0, sp, ror r0
     eec:	00000000 	andeq	r0, r0, r0
     ef0:	00020000 	andeq	r0, r2, r0
     ef4:	00001077 	andeq	r1, r0, r7, ror r0
     ef8:	00000000 	andeq	r0, r0, r0
     efc:	00020000 	andeq	r0, r2, r0
     f00:	00000877 	andeq	r0, r0, r7, ror r8
     f04:	00000000 	andeq	r0, r0, r0
     f08:	00020000 	andeq	r0, r2, r0
     f0c:	0000087d 	andeq	r0, r0, sp, ror r8
	...
     f1c:	00020000 	andeq	r0, r2, r0
     f20:	0000007d 	andeq	r0, r0, sp, ror r0
     f24:	00000000 	andeq	r0, r0, r0
     f28:	00020000 	andeq	r0, r2, r0
     f2c:	0000047d 	andeq	r0, r0, sp, ror r4
     f30:	00000000 	andeq	r0, r0, r0
     f34:	00020000 	andeq	r0, r2, r0
     f38:	0000187d 	andeq	r1, r0, sp, ror r8
     f3c:	00000000 	andeq	r0, r0, r0
     f40:	00020000 	andeq	r0, r2, r0
     f44:	00001877 	andeq	r1, r0, r7, ror r8
     f48:	00000000 	andeq	r0, r0, r0
     f4c:	00020000 	andeq	r0, r2, r0
     f50:	00000477 	andeq	r0, r0, r7, ror r4
     f54:	00000000 	andeq	r0, r0, r0
     f58:	00020000 	andeq	r0, r2, r0
     f5c:	0000047d 	andeq	r0, r0, sp, ror r4
     f60:	00000000 	andeq	r0, r0, r0
     f64:	00020000 	andeq	r0, r2, r0
     f68:	0000007d 	andeq	r0, r0, sp, ror r0
	...
     f78:	00020000 	andeq	r0, r2, r0
     f7c:	0000007d 	andeq	r0, r0, sp, ror r0
     f80:	00000000 	andeq	r0, r0, r0
     f84:	00020000 	andeq	r0, r2, r0
     f88:	0000087d 	andeq	r0, r0, sp, ror r8
     f8c:	00000000 	andeq	r0, r0, r0
     f90:	00020000 	andeq	r0, r2, r0
     f94:	0000107d 	andeq	r1, r0, sp, ror r0
     f98:	00000000 	andeq	r0, r0, r0
     f9c:	00020000 	andeq	r0, r2, r0
     fa0:	00001077 	andeq	r1, r0, r7, ror r0
     fa4:	00000000 	andeq	r0, r0, r0
     fa8:	00020000 	andeq	r0, r2, r0
     fac:	00000877 	andeq	r0, r0, r7, ror r8
     fb0:	00000000 	andeq	r0, r0, r0
     fb4:	00020000 	andeq	r0, r2, r0
     fb8:	0000087d 	andeq	r0, r0, sp, ror r8
	...
     fc8:	00020000 	andeq	r0, r2, r0
     fcc:	0000007d 	andeq	r0, r0, sp, ror r0
     fd0:	00000000 	andeq	r0, r0, r0
     fd4:	00020000 	andeq	r0, r2, r0
     fd8:	0000047d 	andeq	r0, r0, sp, ror r4
     fdc:	00000000 	andeq	r0, r0, r0
     fe0:	00020000 	andeq	r0, r2, r0
     fe4:	0000107d 	andeq	r1, r0, sp, ror r0
     fe8:	00000000 	andeq	r0, r0, r0
     fec:	00020000 	andeq	r0, r2, r0
     ff0:	00001077 	andeq	r1, r0, r7, ror r0
     ff4:	00000000 	andeq	r0, r0, r0
     ff8:	00020000 	andeq	r0, r2, r0
     ffc:	00000477 	andeq	r0, r0, r7, ror r4
    1000:	00000000 	andeq	r0, r0, r0
    1004:	00020000 	andeq	r0, r2, r0
    1008:	0000047d 	andeq	r0, r0, sp, ror r4
    100c:	00000000 	andeq	r0, r0, r0
    1010:	00020000 	andeq	r0, r2, r0
    1014:	0000007d 	andeq	r0, r0, sp, ror r0
	...
    1024:	00020000 	andeq	r0, r2, r0
    1028:	0000007d 	andeq	r0, r0, sp, ror r0
    102c:	00000000 	andeq	r0, r0, r0
    1030:	00020000 	andeq	r0, r2, r0
    1034:	0000087d 	andeq	r0, r0, sp, ror r8
    1038:	00000000 	andeq	r0, r0, r0
    103c:	00020000 	andeq	r0, r2, r0
    1040:	0000287d 	andeq	r2, r0, sp, ror r8
    1044:	00000000 	andeq	r0, r0, r0
    1048:	00020000 	andeq	r0, r2, r0
    104c:	00002877 	andeq	r2, r0, r7, ror r8
    1050:	00000000 	andeq	r0, r0, r0
    1054:	00020000 	andeq	r0, r2, r0
    1058:	00000877 	andeq	r0, r0, r7, ror r8
    105c:	00000000 	andeq	r0, r0, r0
    1060:	00020000 	andeq	r0, r2, r0
    1064:	0000087d 	andeq	r0, r0, sp, ror r8
	...
    1074:	00020000 	andeq	r0, r2, r0
    1078:	0000007d 	andeq	r0, r0, sp, ror r0
    107c:	00000000 	andeq	r0, r0, r0
    1080:	00020000 	andeq	r0, r2, r0
    1084:	0000047d 	andeq	r0, r0, sp, ror r4
    1088:	00000000 	andeq	r0, r0, r0
    108c:	00020000 	andeq	r0, r2, r0
    1090:	0000187d 	andeq	r1, r0, sp, ror r8
    1094:	00000000 	andeq	r0, r0, r0
    1098:	00020000 	andeq	r0, r2, r0
    109c:	00001877 	andeq	r1, r0, r7, ror r8
    10a0:	00000000 	andeq	r0, r0, r0
    10a4:	00020000 	andeq	r0, r2, r0
    10a8:	00000477 	andeq	r0, r0, r7, ror r4
    10ac:	00000000 	andeq	r0, r0, r0
    10b0:	00020000 	andeq	r0, r2, r0
    10b4:	0000047d 	andeq	r0, r0, sp, ror r4
    10b8:	00000000 	andeq	r0, r0, r0
    10bc:	00020000 	andeq	r0, r2, r0
    10c0:	0000007d 	andeq	r0, r0, sp, ror r0
	...
    10d0:	00020000 	andeq	r0, r2, r0
    10d4:	0000007d 	andeq	r0, r0, sp, ror r0
    10d8:	00000000 	andeq	r0, r0, r0
    10dc:	00020000 	andeq	r0, r2, r0
    10e0:	0000087d 	andeq	r0, r0, sp, ror r8
    10e4:	00000000 	andeq	r0, r0, r0
    10e8:	00020000 	andeq	r0, r2, r0
    10ec:	0000207d 	andeq	r2, r0, sp, ror r0
    10f0:	00000000 	andeq	r0, r0, r0
    10f4:	00020000 	andeq	r0, r2, r0
    10f8:	00002077 	andeq	r2, r0, r7, ror r0
    10fc:	00000000 	andeq	r0, r0, r0
    1100:	00020000 	andeq	r0, r2, r0
    1104:	00000877 	andeq	r0, r0, r7, ror r8
    1108:	00000000 	andeq	r0, r0, r0
    110c:	00020000 	andeq	r0, r2, r0
    1110:	0000087d 	andeq	r0, r0, sp, ror r8
    1114:	00000000 	andeq	r0, r0, r0
    1118:	0f440000 	svceq	0x00440000
    111c:	0f460800 	svceq	0x00460800
    1120:	00020800 	andeq	r0, r2, r0, lsl #16
    1124:	0f46007d 	svceq	0x0046007d
    1128:	0f480800 	svceq	0x00480800
    112c:	00020800 	andeq	r0, r2, r0, lsl #16
    1130:	0f48087d 	svceq	0x0048087d
    1134:	0f580800 	svceq	0x00580800
    1138:	00020800 	andeq	r0, r2, r0, lsl #16
    113c:	00000877 	andeq	r0, r0, r7, ror r8
    1140:	00000000 	andeq	r0, r0, r0
    1144:	0f300000 	svceq	0x00300000
    1148:	0f320800 	svceq	0x00320800
    114c:	00020800 	andeq	r0, r2, r0, lsl #16
    1150:	0f32007d 	svceq	0x0032007d
    1154:	0f340800 	svceq	0x00340800
    1158:	00020800 	andeq	r0, r2, r0, lsl #16
    115c:	0f34087d 	svceq	0x0034087d
    1160:	0f440800 	svceq	0x00440800
    1164:	00020800 	andeq	r0, r2, r0, lsl #16
    1168:	00000877 	andeq	r0, r0, r7, ror r8
	...
    1178:	00020000 	andeq	r0, r2, r0
    117c:	0000007d 	andeq	r0, r0, sp, ror r0
    1180:	00000000 	andeq	r0, r0, r0
    1184:	00020000 	andeq	r0, r2, r0
    1188:	0000087d 	andeq	r0, r0, sp, ror r8
    118c:	00000000 	andeq	r0, r0, r0
    1190:	00020000 	andeq	r0, r2, r0
    1194:	0000187d 	andeq	r1, r0, sp, ror r8
    1198:	00000000 	andeq	r0, r0, r0
    119c:	00020000 	andeq	r0, r2, r0
    11a0:	00001877 	andeq	r1, r0, r7, ror r8
    11a4:	00000000 	andeq	r0, r0, r0
    11a8:	00020000 	andeq	r0, r2, r0
    11ac:	00000877 	andeq	r0, r0, r7, ror r8
    11b0:	00000000 	andeq	r0, r0, r0
    11b4:	00020000 	andeq	r0, r2, r0
    11b8:	0000087d 	andeq	r0, r0, sp, ror r8
	...
    11c8:	00020000 	andeq	r0, r2, r0
    11cc:	0000007d 	andeq	r0, r0, sp, ror r0
    11d0:	00000000 	andeq	r0, r0, r0
    11d4:	00020000 	andeq	r0, r2, r0
    11d8:	0000087d 	andeq	r0, r0, sp, ror r8
    11dc:	00000000 	andeq	r0, r0, r0
    11e0:	00020000 	andeq	r0, r2, r0
    11e4:	0000187d 	andeq	r1, r0, sp, ror r8
    11e8:	00000000 	andeq	r0, r0, r0
    11ec:	00020000 	andeq	r0, r2, r0
    11f0:	00001877 	andeq	r1, r0, r7, ror r8
    11f4:	00000000 	andeq	r0, r0, r0
    11f8:	00020000 	andeq	r0, r2, r0
    11fc:	00000877 	andeq	r0, r0, r7, ror r8
    1200:	00000000 	andeq	r0, r0, r0
    1204:	00020000 	andeq	r0, r2, r0
    1208:	0000087d 	andeq	r0, r0, sp, ror r8
	...
    1218:	00020000 	andeq	r0, r2, r0
    121c:	0000007d 	andeq	r0, r0, sp, ror r0
    1220:	00000000 	andeq	r0, r0, r0
    1224:	00020000 	andeq	r0, r2, r0
    1228:	0000087d 	andeq	r0, r0, sp, ror r8
    122c:	00000000 	andeq	r0, r0, r0
    1230:	00020000 	andeq	r0, r2, r0
    1234:	0000187d 	andeq	r1, r0, sp, ror r8
    1238:	00000000 	andeq	r0, r0, r0
    123c:	00020000 	andeq	r0, r2, r0
    1240:	00001877 	andeq	r1, r0, r7, ror r8
    1244:	00000000 	andeq	r0, r0, r0
    1248:	00020000 	andeq	r0, r2, r0
    124c:	00000877 	andeq	r0, r0, r7, ror r8
    1250:	00000000 	andeq	r0, r0, r0
    1254:	00020000 	andeq	r0, r2, r0
    1258:	0000087d 	andeq	r0, r0, sp, ror r8
	...
    1268:	00020000 	andeq	r0, r2, r0
    126c:	0000007d 	andeq	r0, r0, sp, ror r0
    1270:	00000000 	andeq	r0, r0, r0
    1274:	00020000 	andeq	r0, r2, r0
    1278:	0000047d 	andeq	r0, r0, sp, ror r4
    127c:	00000000 	andeq	r0, r0, r0
    1280:	00020000 	andeq	r0, r2, r0
    1284:	0000187d 	andeq	r1, r0, sp, ror r8
    1288:	00000000 	andeq	r0, r0, r0
    128c:	00020000 	andeq	r0, r2, r0
    1290:	00001877 	andeq	r1, r0, r7, ror r8
    1294:	00000000 	andeq	r0, r0, r0
    1298:	00020000 	andeq	r0, r2, r0
    129c:	00000477 	andeq	r0, r0, r7, ror r4
    12a0:	00000000 	andeq	r0, r0, r0
    12a4:	00020000 	andeq	r0, r2, r0
    12a8:	0000047d 	andeq	r0, r0, sp, ror r4
    12ac:	00000000 	andeq	r0, r0, r0
    12b0:	00020000 	andeq	r0, r2, r0
    12b4:	0000007d 	andeq	r0, r0, sp, ror r0
	...
    12c4:	00020000 	andeq	r0, r2, r0
    12c8:	0000007d 	andeq	r0, r0, sp, ror r0
    12cc:	00000000 	andeq	r0, r0, r0
    12d0:	00020000 	andeq	r0, r2, r0
    12d4:	0000047d 	andeq	r0, r0, sp, ror r4
    12d8:	00000000 	andeq	r0, r0, r0
    12dc:	00020000 	andeq	r0, r2, r0
    12e0:	0000187d 	andeq	r1, r0, sp, ror r8
    12e4:	00000000 	andeq	r0, r0, r0
    12e8:	00020000 	andeq	r0, r2, r0
    12ec:	00001877 	andeq	r1, r0, r7, ror r8
    12f0:	00000000 	andeq	r0, r0, r0
    12f4:	00020000 	andeq	r0, r2, r0
    12f8:	00000477 	andeq	r0, r0, r7, ror r4
    12fc:	00000000 	andeq	r0, r0, r0
    1300:	00020000 	andeq	r0, r2, r0
    1304:	0000047d 	andeq	r0, r0, sp, ror r4
    1308:	00000000 	andeq	r0, r0, r0
    130c:	00020000 	andeq	r0, r2, r0
    1310:	0000007d 	andeq	r0, r0, sp, ror r0
	...
    1320:	00020000 	andeq	r0, r2, r0
    1324:	0000007d 	andeq	r0, r0, sp, ror r0
    1328:	00000000 	andeq	r0, r0, r0
    132c:	00020000 	andeq	r0, r2, r0
    1330:	0000087d 	andeq	r0, r0, sp, ror r8
    1334:	00000000 	andeq	r0, r0, r0
    1338:	00020000 	andeq	r0, r2, r0
    133c:	0000307d 	andeq	r3, r0, sp, ror r0
    1340:	00000000 	andeq	r0, r0, r0
    1344:	00020000 	andeq	r0, r2, r0
    1348:	00003077 	andeq	r3, r0, r7, ror r0
    134c:	00000000 	andeq	r0, r0, r0
    1350:	00020000 	andeq	r0, r2, r0
    1354:	00000877 	andeq	r0, r0, r7, ror r8
    1358:	00000000 	andeq	r0, r0, r0
    135c:	00020000 	andeq	r0, r2, r0
    1360:	0000087d 	andeq	r0, r0, sp, ror r8
	...
    1370:	00020000 	andeq	r0, r2, r0
    1374:	0000007d 	andeq	r0, r0, sp, ror r0
    1378:	00000000 	andeq	r0, r0, r0
    137c:	00020000 	andeq	r0, r2, r0
    1380:	0000047d 	andeq	r0, r0, sp, ror r4
    1384:	00000000 	andeq	r0, r0, r0
    1388:	00020000 	andeq	r0, r2, r0
    138c:	0000107d 	andeq	r1, r0, sp, ror r0
    1390:	00000000 	andeq	r0, r0, r0
    1394:	00020000 	andeq	r0, r2, r0
    1398:	00001077 	andeq	r1, r0, r7, ror r0
    139c:	00000000 	andeq	r0, r0, r0
    13a0:	00020000 	andeq	r0, r2, r0
    13a4:	00000477 	andeq	r0, r0, r7, ror r4
    13a8:	00000000 	andeq	r0, r0, r0
    13ac:	00020000 	andeq	r0, r2, r0
    13b0:	0000047d 	andeq	r0, r0, sp, ror r4
    13b4:	00000000 	andeq	r0, r0, r0
    13b8:	00020000 	andeq	r0, r2, r0
    13bc:	0000007d 	andeq	r0, r0, sp, ror r0
	...
    13cc:	00020000 	andeq	r0, r2, r0
    13d0:	0000007d 	andeq	r0, r0, sp, ror r0
    13d4:	00000000 	andeq	r0, r0, r0
    13d8:	00020000 	andeq	r0, r2, r0
    13dc:	0000047d 	andeq	r0, r0, sp, ror r4
    13e0:	00000000 	andeq	r0, r0, r0
    13e4:	00020000 	andeq	r0, r2, r0
    13e8:	0000187d 	andeq	r1, r0, sp, ror r8
    13ec:	00000000 	andeq	r0, r0, r0
    13f0:	00020000 	andeq	r0, r2, r0
    13f4:	00001877 	andeq	r1, r0, r7, ror r8
    13f8:	00000000 	andeq	r0, r0, r0
    13fc:	00020000 	andeq	r0, r2, r0
    1400:	00000477 	andeq	r0, r0, r7, ror r4
    1404:	00000000 	andeq	r0, r0, r0
    1408:	00020000 	andeq	r0, r2, r0
    140c:	0000047d 	andeq	r0, r0, sp, ror r4
    1410:	00000000 	andeq	r0, r0, r0
    1414:	00020000 	andeq	r0, r2, r0
    1418:	0000007d 	andeq	r0, r0, sp, ror r0
    141c:	00000000 	andeq	r0, r0, r0
    1420:	0f800000 	svceq	0x00800000
    1424:	0f820800 	svceq	0x00820800
    1428:	00020800 	andeq	r0, r2, r0, lsl #16
    142c:	0f82007d 	svceq	0x0082007d
    1430:	0f840800 	svceq	0x00840800
    1434:	00020800 	andeq	r0, r2, r0, lsl #16
    1438:	0f84087d 	svceq	0x0084087d
    143c:	0f940800 	svceq	0x00940800
    1440:	00020800 	andeq	r0, r2, r0, lsl #16
    1444:	00000877 	andeq	r0, r0, r7, ror r8
    1448:	00000000 	andeq	r0, r0, r0
    144c:	0f6c0000 	svceq	0x006c0000
    1450:	0f6e0800 	svceq	0x006e0800
    1454:	00020800 	andeq	r0, r2, r0, lsl #16
    1458:	0f6e007d 	svceq	0x006e007d
    145c:	0f700800 	svceq	0x00700800
    1460:	00020800 	andeq	r0, r2, r0, lsl #16
    1464:	0f70087d 	svceq	0x0070087d
    1468:	0f800800 	svceq	0x00800800
    146c:	00020800 	andeq	r0, r2, r0, lsl #16
    1470:	00000877 	andeq	r0, r0, r7, ror r8
    1474:	00000000 	andeq	r0, r0, r0
    1478:	0f580000 	svceq	0x00580000
    147c:	0f5a0800 	svceq	0x005a0800
    1480:	00020800 	andeq	r0, r2, r0, lsl #16
    1484:	0f5a007d 	svceq	0x005a007d
    1488:	0f5c0800 	svceq	0x005c0800
    148c:	00020800 	andeq	r0, r2, r0, lsl #16
    1490:	0f5c087d 	svceq	0x005c087d
    1494:	0f6c0800 	svceq	0x006c0800
    1498:	00020800 	andeq	r0, r2, r0, lsl #16
    149c:	00000877 	andeq	r0, r0, r7, ror r8
	...
    14ac:	00020000 	andeq	r0, r2, r0
    14b0:	0000007d 	andeq	r0, r0, sp, ror r0
    14b4:	00000000 	andeq	r0, r0, r0
    14b8:	00020000 	andeq	r0, r2, r0
    14bc:	0000047d 	andeq	r0, r0, sp, ror r4
    14c0:	00000000 	andeq	r0, r0, r0
    14c4:	00020000 	andeq	r0, r2, r0
    14c8:	0000107d 	andeq	r1, r0, sp, ror r0
    14cc:	00000000 	andeq	r0, r0, r0
    14d0:	00020000 	andeq	r0, r2, r0
    14d4:	00001077 	andeq	r1, r0, r7, ror r0
    14d8:	00000000 	andeq	r0, r0, r0
    14dc:	00020000 	andeq	r0, r2, r0
    14e0:	00000477 	andeq	r0, r0, r7, ror r4
    14e4:	00000000 	andeq	r0, r0, r0
    14e8:	00020000 	andeq	r0, r2, r0
    14ec:	0000047d 	andeq	r0, r0, sp, ror r4
    14f0:	00000000 	andeq	r0, r0, r0
    14f4:	00020000 	andeq	r0, r2, r0
    14f8:	0000007d 	andeq	r0, r0, sp, ror r0
	...
    1508:	00020000 	andeq	r0, r2, r0
    150c:	0000007d 	andeq	r0, r0, sp, ror r0
    1510:	00000000 	andeq	r0, r0, r0
    1514:	00020000 	andeq	r0, r2, r0
    1518:	0000047d 	andeq	r0, r0, sp, ror r4
    151c:	00000000 	andeq	r0, r0, r0
    1520:	00020000 	andeq	r0, r2, r0
    1524:	0000187d 	andeq	r1, r0, sp, ror r8
    1528:	00000000 	andeq	r0, r0, r0
    152c:	00020000 	andeq	r0, r2, r0
    1530:	00001877 	andeq	r1, r0, r7, ror r8
    1534:	00000000 	andeq	r0, r0, r0
    1538:	00020000 	andeq	r0, r2, r0
    153c:	00000477 	andeq	r0, r0, r7, ror r4
    1540:	00000000 	andeq	r0, r0, r0
    1544:	00020000 	andeq	r0, r2, r0
    1548:	0000047d 	andeq	r0, r0, sp, ror r4
    154c:	00000000 	andeq	r0, r0, r0
    1550:	00020000 	andeq	r0, r2, r0
    1554:	0000007d 	andeq	r0, r0, sp, ror r0
	...
    1564:	00020000 	andeq	r0, r2, r0
    1568:	0000007d 	andeq	r0, r0, sp, ror r0
    156c:	00000000 	andeq	r0, r0, r0
    1570:	00020000 	andeq	r0, r2, r0
    1574:	0000047d 	andeq	r0, r0, sp, ror r4
    1578:	00000000 	andeq	r0, r0, r0
    157c:	00020000 	andeq	r0, r2, r0
    1580:	0000187d 	andeq	r1, r0, sp, ror r8
    1584:	00000000 	andeq	r0, r0, r0
    1588:	00020000 	andeq	r0, r2, r0
    158c:	00001877 	andeq	r1, r0, r7, ror r8
    1590:	00000000 	andeq	r0, r0, r0
    1594:	00020000 	andeq	r0, r2, r0
    1598:	00000477 	andeq	r0, r0, r7, ror r4
    159c:	00000000 	andeq	r0, r0, r0
    15a0:	00020000 	andeq	r0, r2, r0
    15a4:	0000047d 	andeq	r0, r0, sp, ror r4
    15a8:	00000000 	andeq	r0, r0, r0
    15ac:	00020000 	andeq	r0, r2, r0
    15b0:	0000007d 	andeq	r0, r0, sp, ror r0
	...
    15c0:	00020000 	andeq	r0, r2, r0
    15c4:	0000007d 	andeq	r0, r0, sp, ror r0
    15c8:	00000000 	andeq	r0, r0, r0
    15cc:	00020000 	andeq	r0, r2, r0
    15d0:	0000087d 	andeq	r0, r0, sp, ror r8
    15d4:	00000000 	andeq	r0, r0, r0
    15d8:	00030000 	andeq	r0, r3, r0
    15dc:	0000f07d 	andeq	pc, r0, sp, ror r0	; <UNPREDICTABLE>
    15e0:	00000000 	andeq	r0, r0, r0
    15e4:	03000000 	movweq	r0, #0
    15e8:	00f07700 	rscseq	r7, r0, r0, lsl #14
	...
    15f4:	08770002 	ldmdaeq	r7!, {r1}^
	...
    1600:	087d0002 	ldmdaeq	sp!, {r1}^
	...
    1614:	007d0002 	rsbseq	r0, sp, r2
	...
    1620:	047d0002 	ldrbteq	r0, [sp], #-2
	...
    162c:	107d0002 	rsbsne	r0, sp, r2
	...
    1638:	10770002 	rsbsne	r0, r7, r2
	...
    1644:	04770002 	ldrbteq	r0, [r7], #-2
	...
    1650:	047d0002 	ldrbteq	r0, [sp], #-2
	...
    165c:	007d0002 	rsbseq	r0, sp, r2
	...
    1670:	007d0002 	rsbseq	r0, sp, r2
	...
    167c:	087d0002 	ldmdaeq	sp!, {r1}^
	...
    1688:	287d0002 	ldmdacs	sp!, {r1}^
	...
    1694:	28770002 	ldmdacs	r7!, {r1}^
	...
    16a0:	08770002 	ldmdaeq	r7!, {r1}^
	...
    16ac:	087d0002 	ldmdaeq	sp!, {r1}^
	...
    16b8:	08000fc4 	stmdaeq	r0, {r2, r6, r7, r8, r9, sl, fp}
    16bc:	08000fc6 	stmdaeq	r0, {r1, r2, r6, r7, r8, r9, sl, fp}
    16c0:	007d0002 	rsbseq	r0, sp, r2
    16c4:	08000fc6 	stmdaeq	r0, {r1, r2, r6, r7, r8, r9, sl, fp}
    16c8:	08000fc8 	stmdaeq	r0, {r3, r6, r7, r8, r9, sl, fp}
    16cc:	087d0002 	ldmdaeq	sp!, {r1}^
    16d0:	08000fc8 	stmdaeq	r0, {r3, r6, r7, r8, r9, sl, fp}
    16d4:	08000fca 	stmdaeq	r0, {r1, r3, r6, r7, r8, r9, sl, fp}
    16d8:	207d0002 	rsbscs	r0, sp, r2
    16dc:	08000fca 	stmdaeq	r0, {r1, r3, r6, r7, r8, r9, sl, fp}
    16e0:	08001028 	stmdaeq	r0, {r3, r5, ip}
    16e4:	20770002 	rsbscs	r0, r7, r2
	...
    16f0:	08000f94 	stmdaeq	r0, {r2, r4, r7, r8, r9, sl, fp}
    16f4:	08000f96 	stmdaeq	r0, {r1, r2, r4, r7, r8, r9, sl, fp}
    16f8:	007d0002 	rsbseq	r0, sp, r2
    16fc:	08000f96 	stmdaeq	r0, {r1, r2, r4, r7, r8, r9, sl, fp}
    1700:	08000f98 	stmdaeq	r0, {r3, r4, r7, r8, r9, sl, fp}
    1704:	047d0002 	ldrbteq	r0, [sp], #-2
    1708:	08000f98 	stmdaeq	r0, {r3, r4, r7, r8, r9, sl, fp}
    170c:	08000fb6 	stmdaeq	r0, {r1, r2, r4, r5, r7, r8, r9, sl, fp}
    1710:	04770002 	ldrbteq	r0, [r7], #-2
    1714:	08000fb6 	stmdaeq	r0, {r1, r2, r4, r5, r7, r8, r9, sl, fp}
    1718:	08000fb8 	stmdaeq	r0, {r3, r4, r5, r7, r8, r9, sl, fp}
    171c:	047d0002 	ldrbteq	r0, [sp], #-2
    1720:	08000fb8 	stmdaeq	r0, {r3, r4, r5, r7, r8, r9, sl, fp}
    1724:	08000fc4 	stmdaeq	r0, {r2, r6, r7, r8, r9, sl, fp}
    1728:	007d0002 	rsbseq	r0, sp, r2
	...

