mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
Disassembly of section .debug_aranges:

00000000 <.debug_aranges>:
   0:	00000074 	andeq	r0, r0, r4, ror r0
   4:	00000002 	andeq	r0, r0, r2
   8:	00040000 	andeq	r0, r4, r0
   c:	00000000 	andeq	r0, r0, r0
  10:	08000170 	stmdaeq	r0, {r4, r5, r6, r8}
  14:	000000cc 	andeq	r0, r0, ip, asr #1
  18:	0800023c 	stmdaeq	r0, {r2, r3, r4, r5, r9}
  1c:	000000cc 	andeq	r0, r0, ip, asr #1
  20:	08000308 	stmdaeq	r0, {r3, r8, r9}
  24:	0000007c 	andeq	r0, r0, ip, ror r0
  28:	08000384 	stmdaeq	r0, {r2, r7, r8, r9}
  2c:	000001d0 	ldrdeq	r0, [r0], -r0	; <UNPREDICTABLE>
  30:	00000000 	andeq	r0, r0, r0
  34:	00000094 	muleq	r0, r4, r0
  38:	08000554 	stmdaeq	r0, {r2, r4, r6, r8, sl}
  3c:	00000024 	andeq	r0, r0, r4, lsr #32
  40:	08000578 	stmdaeq	r0, {r3, r4, r5, r6, r8, sl}
  44:	00000024 	andeq	r0, r0, r4, lsr #32
  48:	0800059c 	stmdaeq	r0, {r2, r3, r4, r7, r8, sl}
  4c:	00000024 	andeq	r0, r0, r4, lsr #32
  50:	080005c0 	stmdaeq	r0, {r6, r7, r8, sl}
  54:	00000024 	andeq	r0, r0, r4, lsr #32
  58:	080005e4 	stmdaeq	r0, {r2, r5, r6, r7, r8, sl}
  5c:	00000024 	andeq	r0, r0, r4, lsr #32
  60:	08000608 	stmdaeq	r0, {r3, r9, sl}
  64:	000000a8 	andeq	r0, r0, r8, lsr #1
  68:	080006b0 	stmdaeq	r0, {r4, r5, r7, r9, sl}
  6c:	000000a8 	andeq	r0, r0, r8, lsr #1
	...
  78:	0000005c 	andeq	r0, r0, ip, asr r0
  7c:	048b0002 	streq	r0, [fp], #2
  80:	00040000 	andeq	r0, r4, r0
  84:	00000000 	andeq	r0, r0, r0
  88:	08000758 	stmdaeq	r0, {r3, r4, r6, r8, r9, sl}
  8c:	000000c6 	andeq	r0, r0, r6, asr #1
  90:	08000820 	stmdaeq	r0, {r5, fp}
  94:	0000021c 	andeq	r0, r0, ip, lsl r2
  98:	00000000 	andeq	r0, r0, r0
  9c:	000000c8 	andeq	r0, r0, r8, asr #1
  a0:	00000000 	andeq	r0, r0, r0
  a4:	00000028 	andeq	r0, r0, r8, lsr #32
  a8:	00000000 	andeq	r0, r0, r0
  ac:	00000018 	andeq	r0, r0, r8, lsl r0
  b0:	00000000 	andeq	r0, r0, r0
  b4:	00000032 	andeq	r0, r0, r2, lsr r0
  b8:	00000000 	andeq	r0, r0, r0
  bc:	0000001c 	andeq	r0, r0, ip, lsl r0
  c0:	00000000 	andeq	r0, r0, r0
  c4:	00000026 	andeq	r0, r0, r6, lsr #32
  c8:	00000000 	andeq	r0, r0, r0
  cc:	00000070 	andeq	r0, r0, r0, ror r0
	...
  d8:	00000084 	andeq	r0, r0, r4, lsl #1
  dc:	08920002 	ldmeq	r2, {r1}
  e0:	00040000 	andeq	r0, r4, r0
	...
  ec:	000004a4 	andeq	r0, r0, r4, lsr #9
  f0:	00000000 	andeq	r0, r0, r0
  f4:	00000088 	andeq	r0, r0, r8, lsl #1
  f8:	00000000 	andeq	r0, r0, r0
  fc:	00000348 	andeq	r0, r0, r8, asr #6
 100:	00000000 	andeq	r0, r0, r0
 104:	0000001e 	andeq	r0, r0, lr, lsl r0
 108:	00000000 	andeq	r0, r0, r0
 10c:	0000001e 	andeq	r0, r0, lr, lsl r0
 110:	00000000 	andeq	r0, r0, r0
 114:	0000001c 	andeq	r0, r0, ip, lsl r0
 118:	00000000 	andeq	r0, r0, r0
 11c:	0000001c 	andeq	r0, r0, ip, lsl r0
 120:	00000000 	andeq	r0, r0, r0
 124:	00000020 	andeq	r0, r0, r0, lsr #32
 128:	00000000 	andeq	r0, r0, r0
 12c:	00000020 	andeq	r0, r0, r0, lsr #32
 130:	00000000 	andeq	r0, r0, r0
 134:	00000028 	andeq	r0, r0, r8, lsr #32
 138:	00000000 	andeq	r0, r0, r0
 13c:	00000024 	andeq	r0, r0, r4, lsr #32
 140:	08000a3c 	stmdaeq	r0, {r2, r3, r4, r5, r9, fp}
 144:	00000064 	andeq	r0, r0, r4, rrx
 148:	08000aa0 	stmdaeq	r0, {r5, r7, r9, fp}
 14c:	00000058 	andeq	r0, r0, r8, asr r0
 150:	08000af8 	stmdaeq	r0, {r3, r4, r5, r6, r7, r9, fp}
 154:	00000058 	andeq	r0, r0, r8, asr r0
	...
 160:	000000b4 	strheq	r0, [r0], -r4
 164:	13c00002 	bicne	r0, r0, #2
 168:	00040000 	andeq	r0, r4, r0
	...
 174:	0000006c 	andeq	r0, r0, ip, rrx
 178:	00000000 	andeq	r0, r0, r0
 17c:	0000007c 	andeq	r0, r0, ip, ror r0
 180:	00000000 	andeq	r0, r0, r0
 184:	00000178 	andeq	r0, r0, r8, ror r1
 188:	00000000 	andeq	r0, r0, r0
 18c:	00000090 	muleq	r0, r0, r0
 190:	00000000 	andeq	r0, r0, r0
 194:	00000218 	andeq	r0, r0, r8, lsl r2
 198:	00000000 	andeq	r0, r0, r0
 19c:	00000064 	andeq	r0, r0, r4, rrx
 1a0:	00000000 	andeq	r0, r0, r0
 1a4:	00000056 	andeq	r0, r0, r6, asr r0
 1a8:	00000000 	andeq	r0, r0, r0
 1ac:	0000003e 	andeq	r0, r0, lr, lsr r0
 1b0:	00000000 	andeq	r0, r0, r0
 1b4:	00000032 	andeq	r0, r0, r2, lsr r0
 1b8:	00000000 	andeq	r0, r0, r0
 1bc:	00000046 	andeq	r0, r0, r6, asr #32
 1c0:	00000000 	andeq	r0, r0, r0
 1c4:	000000e0 	andeq	r0, r0, r0, ror #1
 1c8:	00000000 	andeq	r0, r0, r0
 1cc:	000000ea 	andeq	r0, r0, sl, ror #1
 1d0:	00000000 	andeq	r0, r0, r0
 1d4:	0000007e 	andeq	r0, r0, lr, ror r0
 1d8:	00000000 	andeq	r0, r0, r0
 1dc:	0000001e 	andeq	r0, r0, lr, lsl r0
 1e0:	00000000 	andeq	r0, r0, r0
 1e4:	0000001a 	andeq	r0, r0, sl, lsl r0
 1e8:	00000000 	andeq	r0, r0, r0
 1ec:	0000003e 	andeq	r0, r0, lr, lsr r0
 1f0:	08000b50 	stmdaeq	r0, {r4, r6, r8, r9, fp}
 1f4:	000000f8 	strdeq	r0, [r0], -r8
 1f8:	08000c48 	stmdaeq	r0, {r3, r6, sl, fp}
 1fc:	000000f4 	strdeq	r0, [r0], -r4
 200:	08000d3c 	stmdaeq	r0, {r2, r3, r4, r5, r8, sl, fp}
 204:	000000fc 	strdeq	r0, [r0], -ip
 208:	08000e38 	stmdaeq	r0, {r3, r4, r5, r9, sl, fp}
 20c:	000000f8 	strdeq	r0, [r0], -r8
	...
 218:	00000064 	andeq	r0, r0, r4, rrx
 21c:	20750002 	rsbscs	r0, r5, r2
 220:	00040000 	andeq	r0, r4, r0
	...
 22c:	00000120 	andeq	r0, r0, r0, lsr #2
 230:	00000000 	andeq	r0, r0, r0
 234:	00000084 	andeq	r0, r0, r4, lsl #1
 238:	00000000 	andeq	r0, r0, r0
 23c:	000001a8 	andeq	r0, r0, r8, lsr #3
 240:	00000000 	andeq	r0, r0, r0
 244:	00000048 	andeq	r0, r0, r8, asr #32
 248:	00000000 	andeq	r0, r0, r0
 24c:	0000003a 	andeq	r0, r0, sl, lsr r0
 250:	00000000 	andeq	r0, r0, r0
 254:	0000002e 	andeq	r0, r0, lr, lsr #32
 258:	00000000 	andeq	r0, r0, r0
 25c:	00000044 	andeq	r0, r0, r4, asr #32
 260:	00000000 	andeq	r0, r0, r0
 264:	00000056 	andeq	r0, r0, r6, asr r0
 268:	08000f30 	stmdaeq	r0, {r4, r5, r8, r9, sl, fp}
 26c:	00000014 	andeq	r0, r0, r4, lsl r0
 270:	08000f44 	stmdaeq	r0, {r2, r6, r8, r9, sl, fp}
 274:	00000014 	andeq	r0, r0, r4, lsl r0
	...
 280:	0000005c 	andeq	r0, r0, ip, asr r0
 284:	26d20002 	ldrbcs	r0, [r2], r2
 288:	00040000 	andeq	r0, r4, r0
	...
 294:	000001b8 			; <UNDEFINED> instruction: 0x000001b8
 298:	00000000 	andeq	r0, r0, r0
 29c:	000000bc 	strheq	r0, [r0], -ip
 2a0:	00000000 	andeq	r0, r0, r0
 2a4:	00000214 	andeq	r0, r0, r4, lsl r2
 2a8:	00000000 	andeq	r0, r0, r0
 2ac:	00000058 	andeq	r0, r0, r8, asr r0
 2b0:	00000000 	andeq	r0, r0, r0
 2b4:	00000092 	muleq	r0, r2, r0
 2b8:	00000000 	andeq	r0, r0, r0
 2bc:	00000022 	andeq	r0, r0, r2, lsr #32
 2c0:	08000f58 	stmdaeq	r0, {r3, r4, r6, r8, r9, sl, fp}
 2c4:	00000014 	andeq	r0, r0, r4, lsl r0
 2c8:	08000f6c 	stmdaeq	r0, {r2, r3, r5, r6, r8, r9, sl, fp}
 2cc:	00000014 	andeq	r0, r0, r4, lsl r0
 2d0:	08000f80 	stmdaeq	r0, {r7, r8, r9, sl, fp}
 2d4:	00000014 	andeq	r0, r0, r4, lsl r0
	...
 2e0:	00000024 	andeq	r0, r0, r4, lsr #32
 2e4:	2d680002 	stclcs	0, cr0, [r8, #-8]!
 2e8:	00040000 	andeq	r0, r4, r0
 2ec:	00000000 	andeq	r0, r0, r0
 2f0:	08000f94 	stmdaeq	r0, {r2, r4, r7, r8, r9, sl, fp}
 2f4:	00000030 	andeq	r0, r0, r0, lsr r0
 2f8:	08000fc4 	stmdaeq	r0, {r2, r6, r7, r8, r9, sl, fp}
 2fc:	00000064 	andeq	r0, r0, r4, rrx
	...
 308:	00000024 	andeq	r0, r0, r4, lsr #32
 30c:	2fea0002 	svccs	0x00ea0002
 310:	00040000 	andeq	r0, r4, r0
 314:	00000000 	andeq	r0, r0, r0
 318:	08001028 	stmdaeq	r0, {r3, r5, ip}
 31c:	00000050 	andeq	r0, r0, r0, asr r0
 320:	08001078 	stmdaeq	r0, {r3, r4, r5, r6, ip}
 324:	00000002 	andeq	r0, r0, r2
	...

Disassembly of section .debug_ranges:

00000000 <.debug_ranges>:
   0:	08000170 	stmdaeq	r0, {r4, r5, r6, r8}
   4:	0800023c 	stmdaeq	r0, {r2, r3, r4, r5, r9}
   8:	0800023c 	stmdaeq	r0, {r2, r3, r4, r5, r9}
   c:	08000308 	stmdaeq	r0, {r3, r8, r9}
  10:	08000308 	stmdaeq	r0, {r3, r8, r9}
  14:	08000384 	stmdaeq	r0, {r2, r7, r8, r9}
  18:	08000384 	stmdaeq	r0, {r2, r7, r8, r9}
  1c:	08000554 	stmdaeq	r0, {r2, r4, r6, r8, sl}
  20:	00000001 	andeq	r0, r0, r1
  24:	00000001 	andeq	r0, r0, r1
  28:	08000554 	stmdaeq	r0, {r2, r4, r6, r8, sl}
  2c:	08000578 	stmdaeq	r0, {r3, r4, r5, r6, r8, sl}
  30:	08000578 	stmdaeq	r0, {r3, r4, r5, r6, r8, sl}
  34:	0800059c 	stmdaeq	r0, {r2, r3, r4, r7, r8, sl}
  38:	0800059c 	stmdaeq	r0, {r2, r3, r4, r7, r8, sl}
  3c:	080005c0 	stmdaeq	r0, {r6, r7, r8, sl}
  40:	080005c0 	stmdaeq	r0, {r6, r7, r8, sl}
  44:	080005e4 	stmdaeq	r0, {r2, r5, r6, r7, r8, sl}
  48:	080005e4 	stmdaeq	r0, {r2, r5, r6, r7, r8, sl}
  4c:	08000608 	stmdaeq	r0, {r3, r9, sl}
  50:	08000608 	stmdaeq	r0, {r3, r9, sl}
  54:	080006b0 	stmdaeq	r0, {r4, r5, r7, r9, sl}
  58:	080006b0 	stmdaeq	r0, {r4, r5, r7, r9, sl}
  5c:	08000758 	stmdaeq	r0, {r3, r4, r6, r8, r9, sl}
	...
  68:	08000758 	stmdaeq	r0, {r3, r4, r6, r8, r9, sl}
  6c:	0800081e 	stmdaeq	r0, {r1, r2, r3, r4, fp}
  70:	08000820 	stmdaeq	r0, {r5, fp}
  74:	08000a3c 	stmdaeq	r0, {r2, r3, r4, r5, r9, fp}
  78:	00000001 	andeq	r0, r0, r1
  7c:	00000001 	andeq	r0, r0, r1
  80:	00000001 	andeq	r0, r0, r1
  84:	00000001 	andeq	r0, r0, r1
  88:	00000001 	andeq	r0, r0, r1
  8c:	00000001 	andeq	r0, r0, r1
  90:	00000001 	andeq	r0, r0, r1
  94:	00000001 	andeq	r0, r0, r1
  98:	00000001 	andeq	r0, r0, r1
  9c:	00000001 	andeq	r0, r0, r1
  a0:	00000001 	andeq	r0, r0, r1
  a4:	00000001 	andeq	r0, r0, r1
  a8:	00000001 	andeq	r0, r0, r1
  ac:	00000001 	andeq	r0, r0, r1
	...
  b8:	00000001 	andeq	r0, r0, r1
  bc:	00000001 	andeq	r0, r0, r1
  c0:	00000001 	andeq	r0, r0, r1
  c4:	00000001 	andeq	r0, r0, r1
  c8:	00000001 	andeq	r0, r0, r1
  cc:	00000001 	andeq	r0, r0, r1
  d0:	00000001 	andeq	r0, r0, r1
  d4:	00000001 	andeq	r0, r0, r1
  d8:	00000001 	andeq	r0, r0, r1
  dc:	00000001 	andeq	r0, r0, r1
  e0:	00000001 	andeq	r0, r0, r1
  e4:	00000001 	andeq	r0, r0, r1
  e8:	00000001 	andeq	r0, r0, r1
  ec:	00000001 	andeq	r0, r0, r1
  f0:	00000001 	andeq	r0, r0, r1
  f4:	00000001 	andeq	r0, r0, r1
  f8:	00000001 	andeq	r0, r0, r1
  fc:	00000001 	andeq	r0, r0, r1
 100:	00000001 	andeq	r0, r0, r1
 104:	00000001 	andeq	r0, r0, r1
 108:	00000001 	andeq	r0, r0, r1
 10c:	00000001 	andeq	r0, r0, r1
 110:	08000a3c 	stmdaeq	r0, {r2, r3, r4, r5, r9, fp}
 114:	08000aa0 	stmdaeq	r0, {r5, r7, r9, fp}
 118:	08000aa0 	stmdaeq	r0, {r5, r7, r9, fp}
 11c:	08000af8 	stmdaeq	r0, {r3, r4, r5, r6, r7, r9, fp}
 120:	08000af8 	stmdaeq	r0, {r3, r4, r5, r6, r7, r9, fp}
 124:	08000b50 	stmdaeq	r0, {r4, r6, r8, r9, fp}
	...
 130:	00000001 	andeq	r0, r0, r1
 134:	00000001 	andeq	r0, r0, r1
 138:	00000001 	andeq	r0, r0, r1
 13c:	00000001 	andeq	r0, r0, r1
 140:	00000001 	andeq	r0, r0, r1
 144:	00000001 	andeq	r0, r0, r1
 148:	00000001 	andeq	r0, r0, r1
 14c:	00000001 	andeq	r0, r0, r1
 150:	00000001 	andeq	r0, r0, r1
 154:	00000001 	andeq	r0, r0, r1
 158:	00000001 	andeq	r0, r0, r1
 15c:	00000001 	andeq	r0, r0, r1
 160:	00000001 	andeq	r0, r0, r1
 164:	00000001 	andeq	r0, r0, r1
 168:	00000001 	andeq	r0, r0, r1
 16c:	00000001 	andeq	r0, r0, r1
 170:	00000001 	andeq	r0, r0, r1
 174:	00000001 	andeq	r0, r0, r1
 178:	00000001 	andeq	r0, r0, r1
 17c:	00000001 	andeq	r0, r0, r1
 180:	00000001 	andeq	r0, r0, r1
 184:	00000001 	andeq	r0, r0, r1
 188:	00000001 	andeq	r0, r0, r1
 18c:	00000001 	andeq	r0, r0, r1
 190:	00000001 	andeq	r0, r0, r1
 194:	00000001 	andeq	r0, r0, r1
 198:	00000001 	andeq	r0, r0, r1
 19c:	00000001 	andeq	r0, r0, r1
 1a0:	00000001 	andeq	r0, r0, r1
 1a4:	00000001 	andeq	r0, r0, r1
 1a8:	00000001 	andeq	r0, r0, r1
 1ac:	00000001 	andeq	r0, r0, r1
 1b0:	08000b50 	stmdaeq	r0, {r4, r6, r8, r9, fp}
 1b4:	08000c48 	stmdaeq	r0, {r3, r6, sl, fp}
 1b8:	08000c48 	stmdaeq	r0, {r3, r6, sl, fp}
 1bc:	08000d3c 	stmdaeq	r0, {r2, r3, r4, r5, r8, sl, fp}
 1c0:	08000d3c 	stmdaeq	r0, {r2, r3, r4, r5, r8, sl, fp}
 1c4:	08000e38 	stmdaeq	r0, {r3, r4, r5, r9, sl, fp}
 1c8:	08000e38 	stmdaeq	r0, {r3, r4, r5, r9, sl, fp}
 1cc:	08000f30 	stmdaeq	r0, {r4, r5, r8, r9, sl, fp}
	...
 1d8:	00000001 	andeq	r0, r0, r1
 1dc:	00000001 	andeq	r0, r0, r1
 1e0:	00000001 	andeq	r0, r0, r1
 1e4:	00000001 	andeq	r0, r0, r1
 1e8:	00000001 	andeq	r0, r0, r1
 1ec:	00000001 	andeq	r0, r0, r1
 1f0:	00000001 	andeq	r0, r0, r1
 1f4:	00000001 	andeq	r0, r0, r1
 1f8:	00000001 	andeq	r0, r0, r1
 1fc:	00000001 	andeq	r0, r0, r1
 200:	00000001 	andeq	r0, r0, r1
 204:	00000001 	andeq	r0, r0, r1
 208:	00000001 	andeq	r0, r0, r1
 20c:	00000001 	andeq	r0, r0, r1
 210:	00000001 	andeq	r0, r0, r1
 214:	00000001 	andeq	r0, r0, r1
 218:	08000f30 	stmdaeq	r0, {r4, r5, r8, r9, sl, fp}
 21c:	08000f44 	stmdaeq	r0, {r2, r6, r8, r9, sl, fp}
 220:	08000f44 	stmdaeq	r0, {r2, r6, r8, r9, sl, fp}
 224:	08000f58 	stmdaeq	r0, {r3, r4, r6, r8, r9, sl, fp}
	...
 230:	00000001 	andeq	r0, r0, r1
 234:	00000001 	andeq	r0, r0, r1
 238:	00000001 	andeq	r0, r0, r1
 23c:	00000001 	andeq	r0, r0, r1
 240:	00000001 	andeq	r0, r0, r1
 244:	00000001 	andeq	r0, r0, r1
 248:	00000001 	andeq	r0, r0, r1
 24c:	00000001 	andeq	r0, r0, r1
 250:	00000001 	andeq	r0, r0, r1
 254:	00000001 	andeq	r0, r0, r1
 258:	00000001 	andeq	r0, r0, r1
 25c:	00000001 	andeq	r0, r0, r1
 260:	08000f58 	stmdaeq	r0, {r3, r4, r6, r8, r9, sl, fp}
 264:	08000f6c 	stmdaeq	r0, {r2, r3, r5, r6, r8, r9, sl, fp}
 268:	08000f6c 	stmdaeq	r0, {r2, r3, r5, r6, r8, r9, sl, fp}
 26c:	08000f80 	stmdaeq	r0, {r7, r8, r9, sl, fp}
 270:	08000f80 	stmdaeq	r0, {r7, r8, r9, sl, fp}
 274:	08000f94 	stmdaeq	r0, {r2, r4, r7, r8, r9, sl, fp}
	...
 280:	08000f94 	stmdaeq	r0, {r2, r4, r7, r8, r9, sl, fp}
 284:	08000fc4 	stmdaeq	r0, {r2, r6, r7, r8, r9, sl, fp}
 288:	08000fc4 	stmdaeq	r0, {r2, r6, r7, r8, r9, sl, fp}
 28c:	08001028 	stmdaeq	r0, {r3, r5, ip}
	...
 298:	ffffffff 			; <UNDEFINED> instruction: 0xffffffff
 29c:	00000000 	andeq	r0, r0, r0
 2a0:	08001028 	stmdaeq	r0, {r3, r5, ip}
 2a4:	08001078 	stmdaeq	r0, {r3, r4, r5, r6, ip}
 2a8:	08001078 	stmdaeq	r0, {r3, r4, r5, r6, ip}
 2ac:	0800107a 	stmdaeq	r0, {r1, r3, r4, r5, r6, ip}
	...

Disassembly of section .debug_macro:

