mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
00000000 <.debug_macro>:
   0:	00020004 	andeq	r0, r2, r4
   4:	07000000 	streq	r0, [r0, -r0]
   8:	00000000 	andeq	r0, r0, r0
   c:	03010003 	movweq	r0, #4099	; 0x1003
  10:	0007060c 	andeq	r0, r7, ip, lsl #12
  14:	04000000 	streq	r0, [r0], #-0
  18:	05050d03 	streq	r0, [r5, #-3331]	; 0xfffff2fd
  1c:	0069e009 	rsbeq	lr, r9, r9
  20:	02100300 	andseq	r0, r0, #0, 6
  24:	00000007 	andeq	r0, r0, r7
  28:	11030400 	tstne	r3, r0, lsl #8
  2c:	fa090503 	blx	241440 <_Min_Stack_Size+0x241040>
  30:	03000050 	movweq	r0, #80	; 0x50
  34:	0704020f 	streq	r0, [r4, -pc, lsl #4]
  38:	00000000 	andeq	r0, r0, r0
  3c:	04120304 	ldreq	r0, [r2], #-772	; 0xfffffcfc
  40:	00000007 	andeq	r0, r0, r7
  44:	54070400 	strpl	r0, [r7], #-1024	; 0xfffffc00
  48:	04000000 	streq	r0, [r0], #-0
  4c:	2cf11305 	ldclcs	3, cr1, [r1], #20
  50:	00040000 	andeq	r0, r4, r0
  54:	05000004 	streq	r0, [r0, #-4]
  58:	0052172a 	subseq	r1, r2, sl, lsr #14
  5c:	fa2b0500 	blx	ac1464 <_Min_Stack_Size+0xac1064>
  60:	05000062 	streq	r0, [r0, #-98]	; 0xffffff9e
  64:	000cbb2c 	andeq	fp, ip, ip, lsr #22
  68:	662d0500 	strtvs	r0, [sp], -r0, lsl #10
  6c:	05000030 	streq	r0, [r0, #-48]	; 0xffffffd0
  70:	0041bb2e 	subeq	fp, r1, lr, lsr #22
  74:	952f0500 	strls	r0, [pc, #-1280]!	; fffffb7c <_estack+0xdfffab7c>
  78:	05000052 	streq	r0, [r0, #-82]	; 0xffffffae
  7c:	0063d630 	rsbeq	sp, r3, r0, lsr r6
  80:	c6310500 	ldrtgt	r0, [r1], -r0, lsl #10
  84:	0500000d 	streq	r0, [r0, #-13]
  88:	0003bc32 	andeq	fp, r3, r2, lsr ip
  8c:	8c330500 	cfldr32hi	mvfx0, [r3], #-0
  90:	05000043 	streq	r0, [r0, #-67]	; 0xffffffbd
  94:	0047b334 	subeq	fp, r7, r4, lsr r3
  98:	1e350500 	cfabs32ne	mvfx0, mvfx5
  9c:	0500000a 	streq	r0, [r0, #-10]
  a0:	0048ba36 	subeq	fp, r8, r6, lsr sl
  a4:	47370500 	ldrmi	r0, [r7, -r0, lsl #10]!
  a8:	0500000b 	streq	r0, [r0, #-11]
  ac:	00498438 	subeq	r8, r9, r8, lsr r4
  b0:	c7390500 	ldrgt	r0, [r9, -r0, lsl #10]!
  b4:	0500000b 	streq	r0, [r0, #-11]
  b8:	26910196 			; <UNDEFINED> instruction: 0x26910196
  bc:	97050000 	strls	r0, [r5, -r0]
  c0:	0025fc01 	eoreq	pc, r5, r1, lsl #24
  c4:	01980500 	orrseq	r0, r8, r0, lsl #10
  c8:	00002568 	andeq	r2, r0, r8, ror #10
  cc:	f2019905 	vmla.i8	d9, d1, d5
  d0:	05000024 	streq	r0, [r0, #-36]	; 0xffffffdc
  d4:	2465019a 	strbtcs	r0, [r5], #-410	; 0xfffffe66
  d8:	9b050000 	blls	1400e0 <_Min_Stack_Size+0x13fce0>
  dc:	0023ef01 	eoreq	lr, r3, r1, lsl #30
  e0:	019c0500 	orrseq	r0, ip, r0, lsl #10
  e4:	0000234b 	andeq	r2, r0, fp, asr #6
  e8:	b6019d05 	strlt	r9, [r1], -r5, lsl #26
  ec:	05000022 	streq	r0, [r0, #-34]	; 0xffffffde
  f0:	42b7019e 	adcsmi	r0, r7, #-2147483609	; 0x80000027
  f4:	9f050000 	svcls	0x00050000
  f8:	00424101 	subeq	r4, r2, r1, lsl #2
  fc:	01a00500 	lsleq	r0, r0, #10
 100:	0000555d 	andeq	r5, r0, sp, asr r5
 104:	1701a105 	strne	sl, [r1, -r5, lsl #2]
 108:	05000045 	streq	r0, [r0, #-69]	; 0xffffffbb
 10c:	330001a2 	movwcc	r0, #418	; 0x1a2
 110:	a3050000 	movwge	r0, #20480	; 0x5000
 114:	003ba301 	eorseq	sl, fp, r1, lsl #6
 118:	01a40500 			; <UNDEFINED> instruction: 0x01a40500
 11c:	00002a7a 	andeq	r2, r0, sl, ror sl
 120:	4401a505 	strmi	sl, [r1], #-1285	; 0xfffffafb
 124:	05000005 	streq	r0, [r0, #-5]
 128:	212f01a7 	smulwbcs	pc, r7, r1	; <UNPREDICTABLE>
 12c:	a8050000 	stmdage	r5, {}	; <UNPREDICTABLE>
 130:	0020b901 	eoreq	fp, r0, r1, lsl #18
 134:	01a90500 			; <UNDEFINED> instruction: 0x01a90500
 138:	00002043 	andeq	r2, r0, r3, asr #32
 13c:	a701aa05 	strge	sl, [r1, -r5, lsl #20]
 140:	0500001f 	streq	r0, [r0, #-31]	; 0xffffffe1
 144:	1f3101ab 	svcne	0x003101ab
 148:	ac050000 	stcge	0, cr0, [r5], {-0}
 14c:	001ebb01 	andseq	fp, lr, r1, lsl #22
 150:	01ad0500 			; <UNDEFINED> instruction: 0x01ad0500
 154:	00001e1e 	andeq	r1, r0, lr, lsl lr
 158:	3201ae05 	andcc	sl, r1, #5, 28	; 0x50
 15c:	0500001d 	streq	r0, [r0, #-29]	; 0xffffffe3
 160:	1cbc01af 	ldfnes	f0, [ip], #700	; 0x2bc
 164:	b0050000 	andlt	r0, r5, r0
 168:	0040d301 	subeq	sp, r0, r1, lsl #6
 16c:	01b10500 			; <UNDEFINED> instruction: 0x01b10500
 170:	00005b9d 	muleq	r0, sp, fp
 174:	8401b205 	strhi	fp, [r1], #-517	; 0xfffffdfb
 178:	05000030 	streq	r0, [r0, #-48]	; 0xffffffd0
 17c:	0c4301b3 	stfeqe	f0, [r3], {179}	; 0xb3
 180:	b4050000 	strlt	r0, [r5], #-0
 184:	00625101 	rsbeq	r5, r2, r1, lsl #2
 188:	01b50500 			; <UNDEFINED> instruction: 0x01b50500
 18c:	00005082 	andeq	r5, r0, r2, lsl #1
 190:	0301b605 	movweq	fp, #5637	; 0x1605
 194:	0500003f 	streq	r0, [r0, #-63]	; 0xffffffc1
 198:	1bea01b8 	blne	ffa80880 <_estack+0xdfa7b880>
 19c:	b9050000 	stmdblt	r5, {}	; <UNPREDICTABLE>
 1a0:	001b7401 	andseq	r7, fp, r1, lsl #8
 1a4:	01ba0500 			; <UNDEFINED> instruction: 0x01ba0500
 1a8:	00001afe 	strdeq	r1, [r0], -lr
 1ac:	7601bb05 	strvc	fp, [r1], -r5, lsl #22
 1b0:	0500001a 	streq	r0, [r0, #-26]	; 0xffffffe6
 1b4:	065501bc 			; <UNDEFINED> instruction: 0x065501bc
 1b8:	bd050000 	stclt	0, cr0, [r5, #-0]
 1bc:	0019e001 	andseq	lr, r9, r1
 1c0:	01be0500 			; <UNDEFINED> instruction: 0x01be0500
 1c4:	0000196a 	andeq	r1, r0, sl, ror #18
 1c8:	a601bf05 	strge	fp, [r1], -r5, lsl #30
 1cc:	05000013 	streq	r0, [r0, #-19]	; 0xffffffed
 1d0:	187101c0 	ldmdane	r1!, {r6, r7, r8}^
 1d4:	c1050000 	mrsgt	r0, (UNDEF: 5)
 1d8:	0021df01 	eoreq	sp, r1, r1, lsl #30
 1dc:	01c20500 	biceq	r0, r2, r0, lsl #10
 1e0:	00006759 	andeq	r6, r0, r9, asr r7
 1e4:	7e01c305 	cdpvc	3, 0, cr12, cr1, cr5, {0}
 1e8:	05000009 	streq	r0, [r0, #-9]
 1ec:	603201c4 	eorsvs	r0, r2, r4, asr #3
 1f0:	c5050000 	strgt	r0, [r5, #-0]
 1f4:	0017f401 	andseq	pc, r7, r1, lsl #8
 1f8:	01c60500 	biceq	r0, r6, r0, lsl #10
 1fc:	00003caa 	andeq	r3, r0, sl, lsr #25
 200:	e701c705 	str	ip, [r1, -r5, lsl #14]
 204:	0500002b 	streq	r0, [r0, #-43]	; 0xffffffd5
 208:	5c9201c9 	ldfpls	f0, [r2], {201}	; 0xc9
 20c:	ca050000 	bgt	140214 <_Min_Stack_Size+0x13fe14>
 210:	00172a01 	andseq	r2, r7, r1, lsl #20
 214:	01cb0500 	biceq	r0, fp, r0, lsl #10
 218:	000016b4 			; <UNDEFINED> instruction: 0x000016b4
 21c:	e901cc05 	stmdb	r1, {r0, r2, sl, fp, lr, pc}
 220:	05000006 	streq	r0, [r0, #-6]
 224:	163101cd 	ldrtne	r0, [r1], -sp, asr #3
 228:	ce050000 	cdpgt	0, 0, cr0, cr5, cr0, {0}
 22c:	00158f01 	andseq	r8, r5, r1, lsl #30
 230:	01cf0500 	biceq	r0, pc, r0, lsl #10
 234:	00001004 	andeq	r1, r0, r4
 238:	df01d005 	svcle	0x0001d005
 23c:	05000014 	streq	r0, [r0, #-20]	; 0xffffffec
 240:	27b501d1 	sbfxcs	r0, r1, #3, #22
 244:	d2050000 	andle	r0, r5, #0
 248:	00143401 	andseq	r3, r4, r1, lsl #8
 24c:	01d30500 	bicseq	r0, r3, r0, lsl #10
 250:	000053d5 	ldrdeq	r5, [r0], -r5	; <UNPREDICTABLE>
 254:	b101d405 	tstlt	r1, r5, lsl #8
 258:	05000043 	streq	r0, [r0, #-67]	; 0xffffffbd
 25c:	31bd01d5 			; <UNDEFINED> instruction: 0x31bd01d5
 260:	d6050000 	strle	r0, [r5], -r0
 264:	00535d01 	subseq	r5, r3, r1, lsl #26
 268:	01d70500 	bicseq	r0, r7, r0, lsl #10
 26c:	0000295a 	andeq	r2, r0, sl, asr r9
 270:	d501d805 	strle	sp, [r1, #-2053]	; 0xfffff7fb
 274:	05000002 	streq	r0, [r0, #-2]
 278:	5b1601da 	blpl	5809e8 <_Min_Stack_Size+0x5805e8>
 27c:	db050000 	blle	140284 <_Min_Stack_Size+0x13fe84>
 280:	005aa001 	subseq	sl, sl, r1
 284:	01dc0500 	bicseq	r0, ip, r0, lsl #10
 288:	00001299 	muleq	r0, r9, r2
 28c:	5901dd05 	stmdbpl	r1, {r0, r2, r8, sl, fp, ip, lr, pc}
 290:	0500000a 	streq	r0, [r0, #-10]
 294:	0e8e01de 	mcreq	1, 4, r0, cr14, cr14, {6}
 298:	df050000 	svcle	0x00050000
 29c:	00119701 	andseq	r9, r1, r1, lsl #14
 2a0:	01e00500 	mvneq	r0, r0, lsl #10
 2a4:	00001121 	andeq	r1, r0, r1, lsr #2
 2a8:	8d01e105 	stfhid	f6, [r1, #-20]	; 0xffffffec
 2ac:	05000010 	streq	r0, [r0, #-16]
 2b0:	1da801e2 	stfnes	f0, [r8, #904]!	; 0x388
 2b4:	e3050000 	movw	r0, #20480	; 0x5000
 2b8:	000f8e01 	andeq	r8, pc, r1, lsl #28
 2bc:	01e40500 	mvneq	r0, r0, lsl #10
 2c0:	0000401e 	andeq	r4, r0, lr, lsl r0
 2c4:	ea01e505 	b	796e0 <_Min_Stack_Size+0x792e0>
 2c8:	0500002e 	streq	r0, [r0, #-46]	; 0xffffffd2
 2cc:	0acf01e6 	beq	ff3c0a6c <_estack+0xdf3bba6c>
 2d0:	e7050000 	str	r0, [r5, -r0]
 2d4:	00613401 	rsbeq	r3, r1, r1, lsl #8
 2d8:	01e80500 	mvneq	r0, r0, lsl #10
 2dc:	00004e61 	andeq	r4, r0, r1, ror #28
 2e0:	8601e905 	strhi	lr, [r1], -r5, lsl #18
 2e4:	0500003d 	streq	r0, [r0, #-61]	; 0xffffffc3
 2e8:	036401f1 	cmneq	r4, #1073741884	; 0x4000003c
 2ec:	f2050000 	vhadd.s8	d0, d5, d0
 2f0:	003c7f01 	eorseq	r7, ip, r1, lsl #30
 2f4:	01f30500 	mvnseq	r0, r0, lsl #10
 2f8:	000045dd 	ldrdeq	r4, [r0], -sp
 2fc:	3901fa05 	stmdbcc	r1, {r0, r2, r9, fp, ip, sp, lr, pc}
 300:	05000009 	streq	r0, [r0, #-9]
 304:	4bb601fb 	blmi	fed80af8 <_estack+0xded7baf8>
 308:	04000000 	streq	r0, [r0], #-0
 30c:	02580200 	subseq	r0, r8, #0, 4
 310:	00070000 	andeq	r0, r7, r0
 314:	03000000 	movweq	r0, #0
 318:	0c030100 	stfeqs	f0, [r3], {-0}
 31c:	00000705 	andeq	r0, r0, r5, lsl #14
 320:	03040000 	movweq	r0, #16384	; 0x4000
 324:	0905040d 	stmdbeq	r5, {r0, r2, r3, sl}
 328:	00004cf6 	strdeq	r4, [r0], -r6
 32c:	07020f03 	streq	r0, [r2, -r3, lsl #30]
 330:	00000000 	andeq	r0, r0, r0
 334:	03100304 	tsteq	r0, #4, 6	; 0x10000000
 338:	50fa0905 	rscspl	r0, sl, r5, lsl #18
 33c:	0f030000 	svceq	0x00030000
 340:	00070402 	andeq	r0, r7, r2, lsl #8
 344:	04000000 	streq	r0, [r0], #-0
 348:	00000007 	andeq	r0, r0, r7
 34c:	00040400 	andeq	r0, r4, r0, lsl #8
 350:	60020004 	andvs	r0, r2, r4
 354:	07000004 	streq	r0, [r0, -r4]
 358:	00000000 	andeq	r0, r0, r0
 35c:	03010003 	movweq	r0, #4099	; 0x1003
 360:	0007060e 	andeq	r0, r7, lr, lsl #12
 364:	04000000 	streq	r0, [r0], #-0
 368:	05050f03 	streq	r0, [r5, #-3843]	; 0xfffff0fd
 36c:	007d5609 	rsbseq	r5, sp, r9, lsl #12
 370:	02110300 	andseq	r0, r1, #0, 6
 374:	00000007 	andeq	r0, r0, r7
 378:	12030400 	andne	r0, r3, #0, 8
 37c:	fa090503 	blx	241790 <_Min_Stack_Size+0x241390>
 380:	03000050 	movweq	r0, #80	; 0x50
 384:	0704020f 	streq	r0, [r4, -pc, lsl #4]
 388:	00000000 	andeq	r0, r0, r0
 38c:	04130304 	ldreq	r0, [r3], #-772	; 0xfffffcfc
 390:	00000007 	andeq	r0, r0, r7
 394:	00070400 	andeq	r0, r7, r0, lsl #8
 398:	04000000 	streq	r0, [r0], #-0
 39c:	00040004 	andeq	r0, r4, r4
 3a0:	00073902 	andeq	r3, r7, r2, lsl #18
 3a4:	00000700 	andeq	r0, r0, r0, lsl #14
 3a8:	00030000 	andeq	r0, r3, r0
 3ac:	060c0301 	streq	r0, [ip], -r1, lsl #6
 3b0:	00000007 	andeq	r0, r0, r7
 3b4:	0d030400 	cfstrseq	mvf0, [r3, #-0]
 3b8:	10090505 	andne	r0, r9, r5, lsl #10
 3bc:	03000090 	movweq	r0, #144	; 0x90
 3c0:	00070210 	andeq	r0, r7, r0, lsl r2
 3c4:	04000000 	streq	r0, [r0], #-0
 3c8:	05031103 	streq	r1, [r3, #-259]	; 0xfffffefd
 3cc:	0050fa09 	subseq	pc, r0, r9, lsl #20
 3d0:	020f0300 	andeq	r0, pc, #0, 6
 3d4:	00000704 	andeq	r0, r0, r4, lsl #14
 3d8:	03040000 	movweq	r0, #16384	; 0x4000
 3dc:	00070412 	andeq	r0, r7, r2, lsl r4
 3e0:	04000000 	streq	r0, [r0], #-0
 3e4:	07071303 	streq	r1, [r7, -r3, lsl #6]
 3e8:	00000000 	andeq	r0, r0, r0
 3ec:	00000704 	andeq	r0, r0, r4, lsl #14
 3f0:	04040000 	streq	r0, [r4], #-0
 3f4:	02000400 	andeq	r0, r0, #0, 8
 3f8:	00000ba1 	andeq	r0, r0, r1, lsr #23
 3fc:	00000007 	andeq	r0, r0, r7
 400:	01000300 	mrseq	r0, LR_irq
 404:	07060c03 	streq	r0, [r6, -r3, lsl #24]
 408:	00000000 	andeq	r0, r0, r0
 40c:	050d0304 	streq	r0, [sp, #-772]	; 0xfffffcfc
 410:	989f0905 	ldmls	pc, {r0, r2, r8, fp}	; <UNPREDICTABLE>
 414:	10030000 	andne	r0, r3, r0
 418:	00000702 	andeq	r0, r0, r2, lsl #14
 41c:	03040000 	movweq	r0, #16384	; 0x4000
 420:	09050311 	stmdbeq	r5, {r0, r4, r8, r9}
 424:	000050fa 	strdeq	r5, [r0], -sl
 428:	04020f03 	streq	r0, [r2], #-3843	; 0xfffff0fd
 42c:	00000007 	andeq	r0, r0, r7
 430:	12030400 	andne	r0, r3, #0, 8
 434:	00000704 	andeq	r0, r0, r4, lsl #14
 438:	07040000 	streq	r0, [r4, -r0]
 43c:	00000443 	andeq	r0, r0, r3, asr #8
 440:	04000404 	streq	r0, [r0], #-1028	; 0xfffffbfc
 444:	18050000 	stmdane	r5, {}	; <UNPREDICTABLE>
 448:	000096a9 	andeq	r9, r0, r9, lsr #13
 44c:	94d42505 	ldrbls	r2, [r4], #1285	; 0x505
 450:	26050000 	strcs	r0, [r5], -r0
 454:	0000992d 	andeq	r9, r0, sp, lsr #18
 458:	95553105 	ldrbls	r3, [r5, #-261]	; 0xfffffefb
 45c:	32050000 	andcc	r0, r5, #0
 460:	000098b3 			; <UNDEFINED> instruction: 0x000098b3
 464:	93c83305 	bicls	r3, r8, #335544320	; 0x14000000
 468:	34050000 	strcc	r0, [r5], #-0
 46c:	000094f5 	strdeq	r9, [r0], -r5
 470:	92ff3505 	rscsls	r3, pc, #20971520	; 0x1400000
 474:	3e050000 	cdpcc	0, 0, cr0, cr5, cr0, {0}
 478:	0000979e 	muleq	r0, lr, r7
 47c:	938b3f05 	orrls	r3, fp, #5, 30
 480:	48050000 	stmdami	r5, {}	; <UNPREDICTABLE>
 484:	000094b2 			; <UNDEFINED> instruction: 0x000094b2
 488:	95ea4905 	strbls	r4, [sl, #2309]!	; 0x905
 48c:	52050000 	andpl	r0, r5, #0
 490:	0000958c 	andeq	r9, r0, ip, lsl #11
 494:	95305305 	ldrls	r5, [r0, #-773]!	; 0xfffffcfb
 498:	5c050000 	stcpl	0, cr0, [r5], {-0}
 49c:	00009900 	andeq	r9, r0, r0, lsl #18
 4a0:	98105d05 	ldmdals	r0, {r0, r2, r8, sl, fp, ip, lr}
 4a4:	6a050000 	bvs	1404ac <_Min_Stack_Size+0x1400ac>
 4a8:	000096cc 	andeq	r9, r0, ip, asr #13
 4ac:	93f96b05 	mvnsls	r6, #5120	; 0x1400
 4b0:	6c050000 	stcvs	0, cr0, [r5], {-0}
 4b4:	00009748 	andeq	r9, r0, r8, asr #14
 4b8:	994d6d05 	stmdbls	sp, {r0, r2, r8, sl, fp, sp, lr}^
 4bc:	6e050000 	cdpvs	0, 0, cr0, cr5, cr0, {0}
 4c0:	000097d4 	ldrdeq	r9, [r0], -r4
 4c4:	96807e05 	strls	r7, [r0], r5, lsl #28
 4c8:	7f050000 	svcvc	0x00050000
 4cc:	000099ac 	andeq	r9, r0, ip, lsr #19
 4d0:	35018005 	strcc	r8, [r1, #-5]
 4d4:	05000094 	streq	r0, [r0, #-148]	; 0xffffff6c
 4d8:	98510181 	ldmdals	r1, {r0, r7, r8}^
 4dc:	82050000 	andhi	r0, r5, #0
 4e0:	0095c001 	addseq	ip, r5, r1
 4e4:	01830500 	orreq	r0, r3, r0, lsl #10
 4e8:	00009331 	andeq	r9, r0, r1, lsr r3
 4ec:	29018405 	stmdbcs	r1, {r0, r2, sl, pc}
 4f0:	0500009a 	streq	r0, [r0, #-154]	; 0xffffff66
 4f4:	960d0185 	strls	r0, [sp], -r5, lsl #3
 4f8:	91050000 	mrsls	r0, (UNDEF: 5)
 4fc:	00998f01 	addseq	r8, r9, r1, lsl #30
 500:	01920500 	orrseq	r0, r2, r0, lsl #10
 504:	000098e4 	andeq	r9, r0, r4, ror #17
 508:	d5019305 	strle	r9, [r1, #-773]	; 0xfffffcfb
 50c:	05000099 	streq	r0, [r0, #-153]	; 0xffffff67
 510:	945e0194 	ldrbls	r0, [lr], #-404	; 0xfffffe6c
 514:	04000000 	streq	r0, [r0], #-0
 518:	0da40200 	sfmeq	f0, 4, [r4]
 51c:	00070000 	andeq	r0, r7, r0
 520:	03000000 	movweq	r0, #0
 524:	0c030100 	stfeqs	f0, [r3], {-0}
 528:	00000706 	andeq	r0, r0, r6, lsl #14
 52c:	03040000 	movweq	r0, #16384	; 0x4000
 530:	0905050d 	stmdbeq	r5, {r0, r2, r3, r8, sl}
 534:	00009f4a 	andeq	r9, r0, sl, asr #30
 538:	07021003 	streq	r1, [r2, -r3]
 53c:	00000000 	andeq	r0, r0, r0
 540:	03110304 	tsteq	r1, #4, 6	; 0x10000000
 544:	50fa0905 	rscspl	r0, sl, r5, lsl #18
 548:	0f030000 	svceq	0x00030000
 54c:	00070402 	andeq	r0, r7, r2, lsl #8
 550:	04000000 	streq	r0, [r0], #-0
 554:	07071203 	streq	r1, [r7, -r3, lsl #4]
 558:	00000000 	andeq	r0, r0, r0
 55c:	04130304 	ldreq	r0, [r3], #-772	; 0xfffffcfc
 560:	00000007 	andeq	r0, r0, r7
 564:	6e070400 	cfcpysvs	mvf0, mvf7
 568:	04000005 	streq	r0, [r0], #-5
 56c:	00040004 	andeq	r0, r4, r4
 570:	28210500 	stmdacs	r1!, {r8, sl}
 574:	0500009b 	streq	r0, [r0, #-155]	; 0xffffff65
 578:	009d8322 	addseq	r8, sp, r2, lsr #6
 57c:	9e230500 	cfsh64ls	mvdx0, mvdx3, #0
 580:	050000a0 	streq	r0, [r0, #-160]	; 0xffffff60
 584:	009abd34 	addseq	fp, sl, r4, lsr sp
 588:	60350500 	eorsvs	r0, r5, r0, lsl #10
 58c:	0500009d 	streq	r0, [r0, #-157]	; 0xffffff63
 590:	009a5436 	addseq	r5, sl, r6, lsr r4
 594:	8a370500 	bhi	dc199c <_Min_Stack_Size+0xdc159c>
 598:	0500009c 	streq	r0, [r0, #-156]	; 0xffffff64
 59c:	009eeb38 	addseq	lr, lr, r8, lsr fp
 5a0:	a2390500 	eorsge	r0, r9, #0, 10
 5a4:	0500009d 	streq	r0, [r0, #-157]	; 0xffffff63
 5a8:	009caf3a 	addseq	sl, ip, sl, lsr pc
 5ac:	f93b0500 			; <UNDEFINED> instruction: 0xf93b0500
 5b0:	0500009c 	streq	r0, [r0, #-156]	; 0xffffff64
 5b4:	009e383c 	addseq	r3, lr, ip, lsr r8
 5b8:	213d0500 	teqcs	sp, r0, lsl #10
 5bc:	0500009c 	streq	r0, [r0, #-156]	; 0xffffff64
 5c0:	009a7946 	addseq	r7, sl, r6, asr #18
 5c4:	b1470500 	cmplt	r7, r0, lsl #10
 5c8:	0500009e 	streq	r0, [r0, #-158]	; 0xffffff62
 5cc:	00a05a51 	adceq	r5, r0, r1, asr sl
 5d0:	47520500 	ldrbmi	r0, [r2, -r0, lsl #10]
 5d4:	0500009b 	streq	r0, [r0, #-155]	; 0xffffff65
 5d8:	00a01253 	adceq	r1, r0, r3, asr r2
 5dc:	ec5e0500 	cfldr64	mvdx0, [lr], {-0}
 5e0:	0500009b 	streq	r0, [r0, #-155]	; 0xffffff65
 5e4:	009dc95f 	addseq	ip, sp, pc, asr r9
 5e8:	d6600500 	strbtle	r0, [r0], -r0, lsl #10
 5ec:	0500009c 	streq	r0, [r0, #-156]	; 0xffffff64
 5f0:	009e1361 	addseq	r1, lr, r1, ror #6
 5f4:	216c0500 	cmncs	ip, r0, lsl #10
 5f8:	0500009f 	streq	r0, [r0, #-159]	; 0xffffff61
 5fc:	009ae06d 	addseq	lr, sl, sp, rrx
 600:	a16e0500 	cmnge	lr, r0, lsl #10
 604:	0500009f 	streq	r0, [r0, #-159]	; 0xffffff61
 608:	009fdd6f 	addseq	sp, pc, pc, ror #26
 60c:	be7b0500 	cdplt	5, 7, cr0, cr11, cr0, {0}
 610:	0500009b 	streq	r0, [r0, #-155]	; 0xffffff65
 614:	009e807c 	addseq	r8, lr, ip, ror r0
 618:	6c7d0500 	cfldr64vs	mvdx0, [sp], #-0
 61c:	0500009c 	streq	r0, [r0, #-156]	; 0xffffff64
 620:	009e617e 	addseq	r6, lr, lr, ror r1
 624:	207f0500 	rsbscs	r0, pc, r0, lsl #10
 628:	0000009d 	muleq	r0, sp, r0
 62c:	9d020004 	stcls	0, cr0, [r2, #-16]
 630:	0700000f 	streq	r0, [r0, -pc]
 634:	00000000 	andeq	r0, r0, r0
 638:	03010003 	movweq	r0, #4099	; 0x1003
 63c:	00070214 	andeq	r0, r7, r4, lsl r2
 640:	04000000 	streq	r0, [r0], #-0
 644:	05031503 	streq	r1, [r3, #-1283]	; 0xfffffafd
 648:	0050fa09 	subseq	pc, r0, r9, lsl #20
 64c:	020f0300 	andeq	r0, pc, #0, 6
 650:	00000704 	andeq	r0, r0, r4, lsl #14
 654:	03040000 	movweq	r0, #16384	; 0x4000
 658:	00070616 	andeq	r0, r7, r6, lsl r6
 65c:	04000000 	streq	r0, [r0], #-0
 660:	05041703 	streq	r1, [r4, #-1795]	; 0xfffff8fd
 664:	004cf609 	subeq	pc, ip, r9, lsl #12
 668:	070f0300 	streq	r0, [pc, -r0, lsl #6]
 66c:	08100304 	ldmdaeq	r0, {r2, r8, r9}
 670:	00000704 	andeq	r0, r0, r4, lsl #14
 674:	03040000 	movweq	r0, #16384	; 0x4000
 678:	09050518 	stmdbeq	r5, {r3, r4, r8, sl}
 67c:	000069e0 	andeq	r6, r0, r0, ror #19
 680:	04041203 	streq	r1, [r4], #-515	; 0xfffffdfd
 684:	00005407 	andeq	r5, r0, r7, lsl #8
 688:	19030400 	stmdbne	r3, {sl}
 68c:	4a090509 	bmi	241ab8 <_Min_Stack_Size+0x2416b8>
 690:	0300009f 	movweq	r0, #159	; 0x9f
 694:	00070a12 	andeq	r0, r7, r2, lsl sl
 698:	04000000 	streq	r0, [r0], #-0
 69c:	00056e07 	andeq	r6, r5, r7, lsl #28
 6a0:	1a030400 	bne	c16a8 <_Min_Stack_Size+0xc12a8>
 6a4:	070f070b 	streq	r0, [pc, -fp, lsl #14]
 6a8:	03040000 	movweq	r0, #16384	; 0x4000
 6ac:	e9070c1b 	stmdb	r7, {r0, r1, r3, r4, sl, fp}
 6b0:	04000007 	streq	r0, [r0], #-7
 6b4:	070d1c03 	streq	r1, [sp, -r3, lsl #24]
 6b8:	000008d5 	ldrdeq	r0, [r0], -r5
 6bc:	0e1d0304 	cdpeq	3, 1, cr0, cr13, cr4, {0}
 6c0:	a3360905 	teqge	r6, #81920	; 0x14000
 6c4:	0f030000 	svceq	0x00030000
 6c8:	1003040f 	andne	r0, r3, pc, lsl #8
 6cc:	00070410 	andeq	r0, r7, r0, lsl r4
 6d0:	04000000 	streq	r0, [r0], #-0
 6d4:	07111e03 	ldreq	r1, [r1, -r3, lsl #28]
 6d8:	00000be8 	andeq	r0, r0, r8, ror #23
 6dc:	121f0304 	andsne	r0, pc, #4, 6	; 0x10000000
 6e0:	a6f30905 	ldrbtge	r0, [r3], r5, lsl #18
 6e4:	11030000 	mrsne	r0, (UNDEF: 3)
 6e8:	17050413 	smladne	r5, r3, r4, r0
 6ec:	0000a546 	andeq	sl, r0, r6, asr #10
 6f0:	14200304 	strtne	r0, [r0], #-772	; 0xfffffcfc
 6f4:	000c5807 	andeq	r5, ip, r7, lsl #16
 6f8:	21030400 	tstcs	r3, r0, lsl #8
 6fc:	6c090515 	cfstr32vs	mvfx0, [r9], {21}
 700:	030000a5 	movweq	r0, #165	; 0xa5
 704:	07041611 	smladeq	r4, r1, r6, r1
 708:	00000cf2 	strdeq	r0, [r0], -r2
 70c:	04000404 	streq	r0, [r0], #-1028	; 0xfffffbfc
 710:	09050000 	stmdbeq	r5, {}	; <UNPREDICTABLE>
 714:	0000989f 	muleq	r0, pc, r8	; <UNPREDICTABLE>
 718:	96a91805 	strtls	r1, [r9], r5, lsl #16
 71c:	25050000 	strcs	r0, [r5, #-0]
 720:	000094d4 	ldrdeq	r9, [r0], -r4
 724:	992d2605 	pushls	{r0, r2, r9, sl, sp}
 728:	31050000 	mrscc	r0, (UNDEF: 5)
 72c:	00009555 	andeq	r9, r0, r5, asr r5
 730:	98b33205 	ldmls	r3!, {r0, r2, r9, ip, sp}
 734:	33050000 	movwcc	r0, #20480	; 0x5000
 738:	000093c8 	andeq	r9, r0, r8, asr #7
 73c:	94f53405 	ldrbtls	r3, [r5], #1029	; 0x405
 740:	35050000 	strcc	r0, [r5, #-0]
 744:	000092ff 	strdeq	r9, [r0], -pc	; <UNPREDICTABLE>
 748:	979e3e05 	ldrls	r3, [lr, r5, lsl #28]
 74c:	3f050000 	svccc	0x00050000
 750:	0000938b 	andeq	r9, r0, fp, lsl #7
 754:	94b24805 	ldrtls	r4, [r2], #2053	; 0x805
 758:	49050000 	stmdbmi	r5, {}	; <UNPREDICTABLE>
 75c:	000095ea 	andeq	r9, r0, sl, ror #11
 760:	958c5205 	strls	r5, [ip, #517]	; 0x205
 764:	53050000 	movwpl	r0, #20480	; 0x5000
 768:	00009530 	andeq	r9, r0, r0, lsr r5
 76c:	99005c05 	stmdbls	r0, {r0, r2, sl, fp, ip, lr}
 770:	5d050000 	stcpl	0, cr0, [r5, #-0]
 774:	00009810 	andeq	r9, r0, r0, lsl r8
 778:	96cc6a05 	strbls	r6, [ip], r5, lsl #20
 77c:	6b050000 	blvs	140784 <_Min_Stack_Size+0x140384>
 780:	000093f9 	strdeq	r9, [r0], -r9	; <UNPREDICTABLE>
 784:	97486c05 	strbls	r6, [r8, -r5, lsl #24]
 788:	6d050000 	stcvs	0, cr0, [r5, #-0]
 78c:	0000994d 	andeq	r9, r0, sp, asr #18
 790:	97d46e05 	ldrbls	r6, [r4, r5, lsl #28]
 794:	7e050000 	cdpvc	0, 0, cr0, cr5, cr0, {0}
 798:	00009680 	andeq	r9, r0, r0, lsl #13
 79c:	99ac7f05 	stmibls	ip!, {r0, r2, r8, r9, sl, fp, ip, sp, lr}
 7a0:	80050000 	andhi	r0, r5, r0
 7a4:	00943501 	addseq	r3, r4, r1, lsl #10
 7a8:	01810500 	orreq	r0, r1, r0, lsl #10
 7ac:	00009851 	andeq	r9, r0, r1, asr r8
 7b0:	c0018205 	andgt	r8, r1, r5, lsl #4
 7b4:	05000095 	streq	r0, [r0, #-149]	; 0xffffff6b
 7b8:	93310183 	teqls	r1, #-1073741792	; 0xc0000020
 7bc:	84050000 	strhi	r0, [r5], #-0
 7c0:	009a2901 	addseq	r2, sl, r1, lsl #18
 7c4:	01850500 	orreq	r0, r5, r0, lsl #10
 7c8:	0000960d 	andeq	r9, r0, sp, lsl #12
 7cc:	8f019105 	svchi	0x00019105
 7d0:	05000099 	streq	r0, [r0, #-153]	; 0xffffff67
 7d4:	98e40192 	stmials	r4!, {r1, r4, r7, r8}^
 7d8:	93050000 	movwls	r0, #20480	; 0x5000
 7dc:	0099d501 	addseq	sp, r9, r1, lsl #10
 7e0:	01940500 	orrseq	r0, r4, r0, lsl #10
 7e4:	0000945e 	andeq	r9, r0, lr, asr r4
 7e8:	00000400 	andeq	r0, r0, r0, lsl #8
 7ec:	90100905 	andsls	r0, r0, r5, lsl #18
 7f0:	19050000 	stmdbne	r5, {}	; <UNPREDICTABLE>
 7f4:	00008dec 	andeq	r8, r0, ip, ror #27
 7f8:	863f1a05 	ldrthi	r1, [pc], -r5, lsl #20
 7fc:	1c050000 	stcne	0, cr0, [r5], {-0}
 800:	00008c27 	andeq	r8, r0, r7, lsr #24
 804:	8e6c1d05 	cdphi	13, 6, cr1, cr12, cr5, {0}
 808:	1e050000 	cdpne	0, 0, cr0, cr5, cr0, {0}
 80c:	00008c75 	andeq	r8, r0, r5, ror ip
 810:	98019305 	stmdals	r1, {r0, r2, r8, r9, ip, pc}
 814:	0500008c 	streq	r0, [r0, #-140]	; 0xffffff74
 818:	90cc0194 	smullls	r0, ip, r4, r1
 81c:	a3050000 	movwge	r0, #20480	; 0x5000
 820:	0091ab01 	addseq	sl, r1, r1, lsl #22
 824:	01a40500 			; <UNDEFINED> instruction: 0x01a40500
 828:	00008885 	andeq	r8, r0, r5, lsl #17
 82c:	8001c005 	andhi	ip, r1, r5
 830:	05000085 	streq	r0, [r0, #-133]	; 0xffffff7b
 834:	866c01c1 	strbthi	r0, [ip], -r1, asr #3
 838:	c2050000 	andgt	r0, r5, #0
 83c:	008ed201 	addeq	sp, lr, r1, lsl #4
 840:	01c30500 	biceq	r0, r3, r0, lsl #10
 844:	00008918 	andeq	r8, r0, r8, lsl r9
 848:	2a01c405 	bcs	71864 <_Min_Stack_Size+0x71464>
 84c:	05000088 	streq	r0, [r0, #-136]	; 0xffffff78
 850:	8f2001c5 	svchi	0x002001c5
 854:	c6050000 	strgt	r0, [r5], -r0
 858:	008ccf01 	addeq	ip, ip, r1, lsl #30
 85c:	01c70500 	biceq	r0, r7, r0, lsl #10
 860:	000089a7 	andeq	r8, r0, r7, lsr #19
 864:	4101c805 	tstmi	r1, r5, lsl #16
 868:	0500008f 	streq	r0, [r0, #-143]	; 0xffffff71
 86c:	89ee01c9 	stmibhi	lr!, {r0, r3, r6, r7, r8}^
 870:	ca050000 	bgt	140878 <_Min_Stack_Size+0x140478>
 874:	008c4801 	addeq	r4, ip, r1, lsl #16
 878:	01cb0500 	biceq	r0, fp, r0, lsl #10
 87c:	00008a1f 	andeq	r8, r0, pc, lsl sl
 880:	cb01cc05 	blgt	7389c <_Min_Stack_Size+0x7349c>
 884:	05000088 	streq	r0, [r0, #-136]	; 0xffffff78
 888:	885001cd 	ldmdahi	r0, {r0, r2, r3, r6, r7, r8}^
 88c:	ce050000 	cdpgt	0, 0, cr0, cr5, cr0, {0}
 890:	00874a01 	addeq	r4, r7, r1, lsl #20
 894:	01cf0500 	biceq	r0, pc, r0, lsl #10
 898:	00008b56 	andeq	r8, r0, r6, asr fp
 89c:	1101df05 	tstne	r1, r5, lsl #30
 8a0:	05000086 	streq	r0, [r0, #-134]	; 0xffffff7a
 8a4:	86b401e0 	ldrthi	r0, [r4], r0, ror #3
 8a8:	ef050000 	svc	0x00050000
 8ac:	008fc901 	addeq	ip, pc, r1, lsl #18
 8b0:	01f00500 	mvnseq	r0, r0, lsl #10
