mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
 8b4:	00008d76 	andeq	r8, r0, r6, ror sp
 8b8:	b9028005 	stmdblt	r2, {r0, r2, pc}
 8bc:	05000087 	streq	r0, [r0, #-135]	; 0xffffff79
 8c0:	8a580281 	bhi	16012cc <_Min_Stack_Size+0x1600ecc>
 8c4:	90050000 	andls	r0, r5, r0
 8c8:	0085df02 	addeq	sp, r5, r2, lsl #30
 8cc:	02910500 	addseq	r0, r1, #0, 10
 8d0:	000090ec 	andeq	r9, r0, ip, ror #1
 8d4:	00000400 	andeq	r0, r0, r0, lsl #8
 8d8:	7d560905 	vldrvc.16	s1, [r6, #-10]	; <UNPREDICTABLE>
 8dc:	1b050000 	blne	1408e4 <_Min_Stack_Size+0x1404e4>
 8e0:	00007485 	andeq	r7, r0, r5, lsl #9
 8e4:	76651c05 	strbtvc	r1, [r5], -r5, lsl #24
 8e8:	1e050000 	cdpne	0, 0, cr0, cr5, cr0, {0}
 8ec:	000082c1 	andeq	r8, r0, r1, asr #5
 8f0:	80051f05 	andhi	r1, r5, r5, lsl #30
 8f4:	20050000 	andcs	r0, r5, r0
 8f8:	00006e6b 	andeq	r6, r0, fp, ror #28
 8fc:	7c882105 	stfvcs	f2, [r8], {5}
 900:	23050000 	movwcs	r0, #20480	; 0x5000
 904:	00007b69 	andeq	r7, r0, r9, ror #22
 908:	74192405 	ldrvc	r2, [r9], #-1029	; 0xfffffbfb
 90c:	25050000 	strcs	r0, [r5, #-0]
 910:	00006dfc 	strdeq	r6, [r0], -ip
 914:	6c602605 	stclvs	6, cr2, [r0], #-20	; 0xffffffec
 918:	28050000 	stmdacs	r5, {}	; <UNPREDICTABLE>
 91c:	000080dd 	ldrdeq	r8, [r0], -sp
 920:	7e8d2905 	vdivvc.f16	s4, s26, s10	; <UNPREDICTABLE>
 924:	2a050000 	bcs	14092c <_Min_Stack_Size+0x14052c>
 928:	000082e4 	andeq	r8, r0, r4, ror #5
 92c:	704a2b05 	subvc	r2, sl, r5, lsl #22
 930:	9b050000 	blls	140938 <_Min_Stack_Size+0x140538>
 934:	00724801 	rsbseq	r4, r2, r1, lsl #16
 938:	019c0500 	orrseq	r0, ip, r0, lsl #10
 93c:	00006ba5 	andeq	r6, r0, r5, lsr #23
 940:	fd01b105 	stc2	1, cr11, [r1, #-20]	; 0xffffffec
 944:	0500007a 	streq	r0, [r0, #-122]	; 0xffffff86
 948:	6f8401b2 	svcvs	0x008401b2
 94c:	b3050000 	movwlt	r0, #20480	; 0x5000
 950:	007a0601 	rsbseq	r0, sl, r1, lsl #12
 954:	01b40500 			; <UNDEFINED> instruction: 0x01b40500
 958:	00006ff0 	strdeq	r6, [r0], -r0
 95c:	0201e005 	andeq	lr, r1, #5
 960:	0500006f 	streq	r0, [r0, #-111]	; 0xffffff91
 964:	76ea01e1 	strbtvc	r0, [sl], r1, ror #3
 968:	e2050000 	and	r0, r5, #0
 96c:	00735801 	rsbseq	r5, r3, r1, lsl #16
 970:	01e30500 	mvneq	r0, r0, lsl #10
 974:	00007e59 	andeq	r7, r0, r9, asr lr
 978:	e601e405 	str	lr, [r1], -r5, lsl #8
 97c:	0500007e 	streq	r0, [r0, #-126]	; 0xffffff82
 980:	709d01e5 	addsvc	r0, sp, r5, ror #3
 984:	e6050000 	str	r0, [r5], -r0
 988:	0075eb01 	rsbseq	lr, r5, r1, lsl #22
 98c:	01e70500 	mvneq	r0, r0, lsl #10
 990:	00008369 	andeq	r8, r0, r9, ror #6
 994:	6201e805 	andvs	lr, r1, #327680	; 0x50000
 998:	05000071 	streq	r0, [r0, #-113]	; 0xffffff8f
 99c:	6ca301e9 	stfvss	f0, [r3], #932	; 0x3a4
 9a0:	ea050000 	b	1409a8 <_Min_Stack_Size+0x1405a8>
 9a4:	00799a01 	rsbseq	r9, r9, r1, lsl #20
 9a8:	01eb0500 	mvneq	r0, r0, lsl #10
 9ac:	00007de8 	andeq	r7, r0, r8, ror #27
 9b0:	8501ec05 	strhi	lr, [r1, #-3077]	; 0xfffff3fb
 9b4:	0500007f 	streq	r0, [r0, #-127]	; 0xffffff81
 9b8:	7c1401ed 	ldfvcs	f0, [r4], {237}	; 0xed
 9bc:	ee050000 	cdp	0, 0, cr0, cr5, cr0, {0}
 9c0:	0077c601 	rsbseq	ip, r7, r1, lsl #12
 9c4:	01ef0500 	mvneq	r0, r0, lsl #10
 9c8:	000081bd 			; <UNDEFINED> instruction: 0x000081bd
 9cc:	c901fd05 	stmdbgt	r1, {r0, r2, r8, sl, fp, ip, sp, lr, pc}
 9d0:	0500007b 	streq	r0, [r0, #-123]	; 0xffffff85
 9d4:	756a01fe 	strbvc	r0, [sl, #-510]!	; 0xfffffe02
 9d8:	8e050000 	cdphi	0, 0, cr0, cr5, cr0, {0}
 9dc:	00819f02 	addeq	r9, r1, r2, lsl #30
 9e0:	028f0500 	addeq	r0, pc, #0, 10
 9e4:	00007cd1 	ldrdeq	r7, [r0], -r1
 9e8:	1c02a305 	stcne	3, cr10, [r2], {5}
 9ec:	05000075 	streq	r0, [r0, #-117]	; 0xffffff8b
 9f0:	6e1f02a4 	cdpvs	2, 1, cr0, cr15, cr4, {5}
 9f4:	a5050000 	strge	r0, [r5, #-0]
 9f8:	00781302 	rsbseq	r1, r8, r2, lsl #6
 9fc:	02a60500 	adceq	r0, r6, #0, 10
 a00:	00007635 	andeq	r7, r0, r5, lsr r6
 a04:	4b02d205 	blmi	b5220 <_Min_Stack_Size+0xb4e20>
 a08:	0500006f 	streq	r0, [r0, #-111]	; 0xffffff91
 a0c:	706802d3 	ldrdvc	r0, [r8], #-35	; 0xffffffdd	; <UNPREDICTABLE>
 a10:	d4050000 	strle	r0, [r5], #-0
 a14:	006e8e02 	rsbeq	r8, lr, r2, lsl #28
 a18:	02d50500 	sbcseq	r0, r5, #0, 10
 a1c:	000074e7 	andeq	r7, r0, r7, ror #9
 a20:	0202d605 	andeq	sp, r2, #5242880	; 0x500000
 a24:	05000083 	streq	r0, [r0, #-131]	; 0xffffff7d
 a28:	70e802d7 	ldrdvc	r0, [r8], #39	; 0x27	; <UNPREDICTABLE>
 a2c:	d8050000 	stmdale	r5, {}	; <UNPREDICTABLE>
 a30:	00849002 	addeq	r9, r4, r2
 a34:	02d90500 	sbcseq	r0, r9, #0, 10
 a38:	000083de 	ldrdeq	r8, [r0], -lr
 a3c:	4502da05 	strmi	sp, [r2, #-2565]	; 0xfffff5fb
 a40:	05000084 	streq	r0, [r0, #-132]	; 0xffffff7c
 a44:	7f4c02db 	svcvc	0x004c02db
 a48:	dc050000 	stcle	0, cr0, [r5], {-0}
 a4c:	00778b02 	rsbseq	r8, r7, r2, lsl #22
 a50:	02dd0500 	sbcseq	r0, sp, #0, 10
 a54:	000073de 	ldrdeq	r7, [r0], -lr
 a58:	3c02de05 	stccc	14, cr13, [r2], {5}
 a5c:	05000074 	streq	r0, [r0, #-116]	; 0xffffff8c
 a60:	787902df 	ldmdavc	r9!, {r0, r1, r2, r3, r4, r6, r7, r9}^
 a64:	e0050000 	and	r0, r5, r0
 a68:	0074ac02 	rsbseq	sl, r4, r2, lsl #24
 a6c:	02e10500 	rsceq	r0, r1, #0, 10
 a70:	0000759c 	muleq	r0, ip, r5
 a74:	4d02ee05 	stcmi	14, cr14, [r2, #-20]	; 0xffffffec
 a78:	05000077 	streq	r0, [r0, #-119]	; 0xffffff89
 a7c:	790702ef 	stmdbvc	r7, {r0, r1, r2, r3, r5, r6, r7, r9}
 a80:	91050000 	mrsls	r0, (UNDEF: 5)
 a84:	007f1e03 	rsbseq	r1, pc, r3, lsl #28
 a88:	03920500 	orrseq	r0, r2, #0, 10
 a8c:	00007121 	andeq	r7, r0, r1, lsr #2
 a90:	30039305 	andcc	r9, r3, r5, lsl #6
 a94:	05000081 	streq	r0, [r0, #-129]	; 0xffffff7f
 a98:	7e220394 	mcrvc	3, 1, r0, cr2, cr4, {4}
 a9c:	95050000 	strls	r0, [r5, #-0]
 aa0:	0078cb03 	rsbseq	ip, r8, r3, lsl #22
 aa4:	03960500 	orrseq	r0, r6, #0, 10
 aa8:	00006bdb 	ldrdeq	r6, [r0], -fp
 aac:	2c039705 	stccs	7, cr9, [r3], {5}
 ab0:	05000073 	streq	r0, [r0, #-115]	; 0xffffff8d
 ab4:	76b40398 	ssatvc	r0, #21, r8, lsl #7
 ab8:	ac050000 	stcge	0, cr0, [r5], {-0}
 abc:	00828903 	addeq	r8, r2, r3, lsl #18
 ac0:	03ad0500 			; <UNDEFINED> instruction: 0x03ad0500
 ac4:	000083a1 	andeq	r8, r0, r1, lsr #7
 ac8:	ee03ae05 	cdp	14, 0, cr10, cr3, cr5, {0}
 acc:	0500007c 	streq	r0, [r0, #-124]	; 0xffffff84
 ad0:	72e403af 	rscvc	r0, r4, #-1140850686	; 0xbc000002
 ad4:	c3050000 	movwgt	r0, #20480	; 0x5000
 ad8:	00805503 	addeq	r5, r0, r3, lsl #10
 adc:	03c40500 	biceq	r0, r4, #0, 10
 ae0:	00006c22 	andeq	r6, r0, r2, lsr #24
 ae4:	c503d505 	strgt	sp, [r3, #-1285]	; 0xfffffafb
 ae8:	05000071 	streq	r0, [r0, #-113]	; 0xffffff8f
 aec:	7eab03d6 	mcrvc	3, 5, r0, cr11, cr6, {6}
 af0:	f1050000 			; <UNDEFINED> instruction: 0xf1050000
 af4:	0079d403 	rsbseq	sp, r9, r3, lsl #8
 af8:	03f20500 	mvnseq	r0, #0, 10
 afc:	00007a77 	andeq	r7, r0, r7, ror sl
 b00:	5f03f405 	svcpl	0x0003f405
 b04:	05000082 	streq	r0, [r0, #-130]	; 0xffffff7e
 b08:	702103f5 	strdvc	r0, [r1], -r5	; <UNPREDICTABLE>
 b0c:	88050000 	stmdahi	r5, {}	; <UNPREDICTABLE>
 b10:	007da604 	rsbseq	sl, sp, r4, lsl #12
 b14:	04890500 	streq	r0, [r9], #1280	; 0x500
 b18:	00007b2c 	andeq	r7, r0, ip, lsr #22
 b1c:	41049905 	tstmi	r4, r5, lsl #18
 b20:	0500007a 	streq	r0, [r0, #-122]	; 0xffffff86
 b24:	7abf049a 	bvc	fefc1d94 <_estack+0xdefbcd94>
 b28:	b9050000 	stmdblt	r5, {}	; <UNPREDICTABLE>
 b2c:	007fbf04 	rsbseq	fp, pc, r4, lsl #30
 b30:	04ba0500 	ldrteq	r0, [sl], #1280	; 0x500
 b34:	000071f8 	strdeq	r7, [r0], -r8
 b38:	9f04bb05 	svcls	0x0004bb05
 b3c:	05000071 	streq	r0, [r0, #-113]	; 0xffffff8f
 b40:	7cab04bc 	cfstrsvc	mvf0, [fp], #752	; 0x2f0
 b44:	bd050000 	stclt	0, cr0, [r5, #-0]
 b48:	007fe304 	rsbseq	lr, pc, r4, lsl #6
 b4c:	04be0500 	ldrteq	r0, [lr], #1280	; 0x500
 b50:	000080bb 	strheq	r8, [r0], -fp
 b54:	f704bf05 			; <UNDEFINED> instruction: 0xf704bf05
 b58:	05000081 	streq	r0, [r0, #-129]	; 0xffffff7f
 b5c:	7d2b04c0 	cfstrsvc	mvf0, [fp, #-768]!	; 0xfffffd00
 b60:	c9050000 	stmdbgt	r5, {}	; <UNPREDICTABLE>
 b64:	0080fb04 	addeq	pc, r0, r4, lsl #22
 b68:	04ca0500 	strbeq	r0, [sl], #1280	; 0x500
 b6c:	0000795f 	andeq	r7, r0, pc, asr r9
 b70:	1e04cd05 	cdpne	13, 0, cr12, cr4, cr5, {0}
 b74:	05000072 	streq	r0, [r0, #-114]	; 0xffffff8e
 b78:	841704ce 	ldrhi	r0, [r7], #-1230	; 0xfffffb32
 b7c:	cf050000 	svcgt	0x00050000
 b80:	006dce04 	rsbeq	ip, sp, r4, lsl #28
 b84:	04d00500 	ldrbeq	r0, [r0], #1280	; 0x500
 b88:	00006ed4 	ldrdeq	r6, [r0], -r4
 b8c:	8804d305 	stmdahi	r4, {r0, r2, r8, r9, ip, lr, pc}
 b90:	05000072 	streq	r0, [r0, #-114]	; 0xffffff8e
 b94:	6d6104d4 	cfstrdvs	mvd0, [r1, #-848]!	; 0xfffffcb0
 b98:	d7050000 	strle	r0, [r5, -r0]
 b9c:	00784d04 	rsbseq	r4, r8, r4, lsl #26
 ba0:	04d80500 	ldrbeq	r0, [r8], #1280	; 0x500
 ba4:	0000753d 	andeq	r7, r0, sp, lsr r5
 ba8:	7304db05 	movwvc	sp, #19205	; 0x4b05
 bac:	05000081 	streq	r0, [r0, #-129]	; 0xffffff7f
 bb0:	6b5604dc 	blvs	1581f28 <_Min_Stack_Size+0x1581b28>
 bb4:	ea050000 	b	140bbc <_Min_Stack_Size+0x1407bc>
 bb8:	006e4404 	rsbeq	r4, lr, r4, lsl #8
 bbc:	04eb0500 	strbteq	r0, [fp], #1280	; 0x500
 bc0:	00006b82 	andeq	r6, r0, r2, lsl #23
 bc4:	cb04ec05 	blgt	13bbe0 <_Min_Stack_Size+0x13b7e0>
 bc8:	0500006f 	streq	r0, [r0, #-111]	; 0xffffff91
 bcc:	7b8c04ed 	blvc	fe301f88 <_estack+0xde2fcf88>
 bd0:	ee050000 	cdp	0, 0, cr0, cr5, cr0, {0}
 bd4:	00768f04 	rsbseq	r8, r6, r4, lsl #30
 bd8:	04ef0500 	strbteq	r0, [pc], #1280	; be0 <_Min_Stack_Size+0x7e0>
 bdc:	00007d81 	andeq	r7, r0, r1, lsl #27
 be0:	4e04f005 	cdpmi	0, 0, cr15, cr4, cr5, {0}
 be4:	0000007c 	andeq	r0, r0, ip, ror r0
 be8:	05000004 	streq	r0, [r0, #-4]
 bec:	00a57a09 	adceq	r7, r5, r9, lsl #20
 bf0:	f4370500 			; <UNDEFINED> instruction: 0xf4370500
 bf4:	050000a3 	streq	r0, [r0, #-163]	; 0xffffff5d
 bf8:	00a81e38 	adceq	r1, r8, r8, lsr lr
 bfc:	f93a0500 			; <UNDEFINED> instruction: 0xf93a0500
 c00:	050000a8 	streq	r0, [r0, #-168]	; 0xffffff58
 c04:	00a23f3b 	adceq	r3, r2, fp, lsr pc
 c08:	543d0500 	ldrtpl	r0, [sp], #-1280	; 0xfffffb00
 c0c:	050000a9 	streq	r0, [r0, #-169]	; 0xffffff57
 c10:	00a8e03e 	adceq	lr, r8, lr, lsr r0
 c14:	87400500 	strbhi	r0, [r0, -r0, lsl #10]
 c18:	050000a1 	streq	r0, [r0, #-161]	; 0xffffff5f
 c1c:	00a7a141 	adceq	sl, r7, r1, asr #2
 c20:	14430500 	strbne	r0, [r3], #-1280	; 0xfffffb00
 c24:	050000a7 	streq	r0, [r0, #-167]	; 0xffffff59
 c28:	00a10b44 	adceq	r0, r1, r4, asr #22
 c2c:	f3460500 	vrshl.u8	d16, d0, d6
 c30:	050000a5 	streq	r0, [r0, #-165]	; 0xffffff5b
 c34:	00a14147 	adceq	r4, r1, r7, asr #2
 c38:	72490500 	subvc	r0, r9, #0, 10
 c3c:	050000a1 	streq	r0, [r0, #-161]	; 0xffffff5f
 c40:	00a5064a 	adceq	r0, r5, sl, asr #12
 c44:	794c0500 	stmdbvc	ip, {r8, sl}^
 c48:	050000a4 	streq	r0, [r0, #-164]	; 0xffffff5c
 c4c:	00a8a34d 	adceq	sl, r8, sp, asr #6
 c50:	46500500 	ldrbmi	r0, [r0], -r0, lsl #10
 c54:	000000a3 	andeq	r0, r0, r3, lsr #1
 c58:	05000004 	streq	r0, [r0, #-4]
 c5c:	00a51f12 	adceq	r1, r5, r2, lsl pc
 c60:	373f0500 	ldrcc	r0, [pc, -r0, lsl #10]!
 c64:	050000a8 	streq	r0, [r0, #-168]	; 0xffffff58
 c68:	00a41440 	adceq	r1, r4, r0, asr #8
 c6c:	ba420500 	blt	1082074 <_Min_Stack_Size+0x1081c74>
 c70:	050000a7 	streq	r0, [r0, #-167]	; 0xffffff59
 c74:	00a7e843 	adceq	lr, r7, r3, asr #16
 c78:	15450500 	strbne	r0, [r5, #-1280]	; 0xfffffb00
 c7c:	050000a2 	streq	r0, [r0, #-162]	; 0xffffff5e
 c80:	00a36246 	adceq	r6, r3, r6, asr #4
 c84:	c5480500 	strbgt	r0, [r8, #-1280]	; 0xfffffb00
 c88:	050000a5 	streq	r0, [r0, #-165]	; 0xffffff5b
 c8c:	00a12449 	adceq	r2, r1, r9, asr #8
 c90:	5a4b0500 	bpl	12c2098 <_Min_Stack_Size+0x12c1c98>
 c94:	050000a1 	streq	r0, [r0, #-161]	; 0xffffff5f
 c98:	00a5a84c 	adceq	sl, r5, ip, asr #16
 c9c:	d54e0500 	strble	r0, [lr, #-1280]	; 0xfffffb00
 ca0:	050000a4 	streq	r0, [r0, #-164]	; 0xffffff5c
 ca4:	00a1bc4f 	adceq	fp, r1, pc, asr #24
 ca8:	8b510500 	blhi	14420b0 <_Min_Stack_Size+0x1441cb0>
 cac:	050000a8 	streq	r0, [r0, #-168]	; 0xffffff58
 cb0:	00a3a852 	adceq	sl, r3, r2, asr r8
 cb4:	87570500 	ldrbhi	r0, [r7, -r0, lsl #10]
 cb8:	050000a9 	streq	r0, [r0, #-169]	; 0xffffff57
 cbc:	00a76358 	adceq	r6, r7, r8, asr r3
 cc0:	78590500 	ldmdavc	r9, {r8, sl}^
 cc4:	050000a6 	streq	r0, [r0, #-166]	; 0xffffff5a
 cc8:	00a1f65a 	adceq	pc, r1, sl, asr r6	; <UNPREDICTABLE>
 ccc:	4f5b0500 	svcmi	0x005b0500
 cd0:	050000a8 	streq	r0, [r0, #-168]	; 0xffffff58
 cd4:	00a6085c 	adceq	r0, r6, ip, asr r8
 cd8:	205d0500 	subscs	r0, sp, r0, lsl #10
 cdc:	050000a9 	streq	r0, [r0, #-169]	; 0xffffff57
 ce0:	00a6955e 	adceq	r9, r6, lr, asr r5
 ce4:	895f0500 	ldmdbhi	pc, {r8, sl}^	; <UNPREDICTABLE>
 ce8:	050000a5 	streq	r0, [r0, #-165]	; 0xffffff5b
 cec:	00a96960 	adceq	r6, r9, r0, ror #18
 cf0:	00040000 	andeq	r0, r4, r0
 cf4:	3a190500 	bcc	6420fc <_Min_Stack_Size+0x641cfc>
 cf8:	050000a6 	streq	r0, [r0, #-166]	; 0xffffff5a
 cfc:	00a6b41a 	adceq	fp, r6, sl, lsl r4
 d00:	7f1b0500 	svcvc	0x001b0500
 d04:	050000a3 	streq	r0, [r0, #-163]	; 0xffffff5d
 d08:	00a2581c 	adceq	r5, r2, ip, lsl r8
 d0c:	ed1d0500 	cfldr32	mvfx0, [sp, #-0]
 d10:	000000a4 	andeq	r0, r0, r4, lsr #1

Disassembly of section .debug_line:

