mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
00000000 <.debug_line>:
       0:	00000254 	andeq	r0, r0, r4, asr r2
       4:	00a40002 	adceq	r0, r4, r2
       8:	01020000 	mrseq	r0, (UNDEF: 2)
       c:	000d0efb 	strdeq	r0, [sp], -fp
      10:	01010101 	tsteq	r1, r1, lsl #2
      14:	01000000 	mrseq	r0, (UNDEF: 0)
      18:	2e010000 	cdpcs	0, 0, cr0, cr1, cr0, {0}
      1c:	434d2f2e 	movtmi	r2, #57134	; 0xdf2e
      20:	2e004c41 	cdpcs	12, 0, cr4, cr0, cr1, {2}
      24:	434d2f2e 	movtmi	r2, #57134	; 0xdf2e
      28:	492f4c41 	stmdbmi	pc!, {r0, r6, sl, fp, lr}	; <UNPREDICTABLE>
      2c:	2e2f636e 	cdpcs	3, 2, cr6, cr15, cr14, {3}
      30:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
      34:	7265532f 	rsbvc	r5, r5, #-1140850688	; 0xbc000000
      38:	65636976 	strbvs	r6, [r3, #-2422]!	; 0xfffff68a
      3c:	2e2e0073 	mcrcs	0, 1, r0, cr14, cr3, {3}
      40:	41434d2f 	cmpmi	r3, pc, lsr #26
      44:	6e492f4c 	cdpvs	15, 4, cr2, cr9, cr12, {2}
      48:	2e2e0063 	cdpcs	0, 2, cr0, cr14, cr3, {3}
      4c:	41434d2f 	cmpmi	r3, pc, lsr #26
      50:	2e2e2f4c 	cdpcs	15, 2, cr2, cr14, cr12, {2}
      54:	7265532f 	rsbvc	r5, r5, #-1140850688	; 0xbc000000
      58:	65636976 	strbvs	r6, [r3, #-2422]!	; 0xfffff68a
      5c:	45000073 	strmi	r0, [r0, #-115]	; 0xffffff8d
      60:	2e495458 	mcrcs	4, 2, r5, cr9, cr8, {2}
      64:	00010063 	andeq	r0, r1, r3, rrx
      68:	616c5000 	cmnvs	ip, r0
      6c:	726f6674 	rsbvc	r6, pc, #116, 12	; 0x7400000
      70:	79545f6d 	ldmdbvc	r4, {r0, r2, r3, r5, r6, r8, r9, sl, fp, ip, lr}^
      74:	2e736570 	mrccs	5, 3, r6, cr3, cr0, {3}
      78:	00020068 	andeq	r0, r2, r8, rrx
      7c:	6d747300 	ldclvs	3, cr7, [r4, #-0]
      80:	31663233 	cmncc	r6, r3, lsr r2
      84:	36633330 			; <UNDEFINED> instruction: 0x36633330
      88:	0200682e 	andeq	r6, r0, #3014656	; 0x2e0000
      8c:	50470000 	subpl	r0, r7, r0
      90:	682e4f49 	stmdavs	lr!, {r0, r3, r6, r8, r9, sl, fp, lr}
      94:	00000300 	andeq	r0, r0, r0, lsl #6
      98:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
      9c:	0300682e 	movweq	r6, #2094	; 0x82e
      a0:	74550000 	ldrbvc	r0, [r5], #-0
      a4:	2e736c69 	cdpcs	12, 7, cr6, cr3, cr9, {3}
      a8:	00040068 	andeq	r0, r4, r8, rrx
      ac:	05000000 	streq	r0, [r0, #-0]
      b0:	00017002 	andeq	r7, r1, r2
      b4:	01280308 			; <UNDEFINED> instruction: 0x01280308
      b8:	1427025a 	strtne	r0, [r7], #-602	; 0xfffffda6
      bc:	75757575 	ldrbvc	r7, [r5, #-1397]!	; 0xfffffa8b
      c0:	02767a79 	rsbseq	r7, r6, #495616	; 0x79000
      c4:	01010009 	tsteq	r1, r9
      c8:	3c020500 	cfstr32cc	mvfx0, [r2], {-0}
      cc:	03080002 	movweq	r0, #32770	; 0x8002
      d0:	5a0100c4 	bpl	403e8 <_Min_Stack_Size+0x3ffe8>
      d4:	75142702 	ldrvc	r2, [r4, #-1794]	; 0xfffff8fe
      d8:	79757575 	ldmdbvc	r5!, {r0, r2, r4, r5, r6, r8, sl, ip, sp, lr}^
      dc:	0902767a 	stmdbeq	r2, {r1, r3, r4, r5, r6, r9, sl, ip, sp, lr}
      e0:	00010100 	andeq	r0, r1, r0, lsl #2
      e4:	03080205 	movweq	r0, #33285	; 0x8205
      e8:	e0030800 	and	r0, r3, r0, lsl #16
      ec:	025b0100 	subseq	r0, fp, #0, 2
      f0:	41411727 	cmpmi	r1, r7, lsr #14
      f4:	02213e41 	eoreq	r3, r1, #1040	; 0x410
      f8:	01010005 	tsteq	r1, r5
      fc:	84020500 	strhi	r0, [r2], #-1280	; 0xfffffb00
     100:	03080003 	movweq	r0, #32771	; 0x8003
     104:	4f01018c 	svcmi	0x0001018c
     108:	08754b5d 	ldmdaeq	r5!, {r0, r2, r3, r4, r6, r8, r9, fp, lr}^
     10c:	04020013 	streq	r0, [r2], #-19	; 0xffffffed
     110:	009e0601 	addseq	r0, lr, r1, lsl #12
     114:	58030402 	stmdapl	r3, {r1, sl}
     118:	05040200 	streq	r0, [r4, #-512]	; 0xfffffe00
     11c:	04020058 	streq	r0, [r2], #-88	; 0xffffffa8
     120:	02005807 	andeq	r5, r0, #458752	; 0x70000
     124:	00580904 	subseq	r0, r8, r4, lsl #18
     128:	2e0a0402 	cdpcs	4, 0, cr0, cr10, cr2, {0}
     12c:	08040200 	stmdaeq	r4, {r9}
     130:	0402002e 	streq	r0, [r2], #-46	; 0xffffffd2
     134:	02002e06 	andeq	r2, r0, #6, 28	; 0x60
     138:	002e0404 	eoreq	r0, lr, r4, lsl #8
     13c:	2e020402 	cdpcs	4, 0, cr0, cr2, cr2, {0}
     140:	14040200 	strne	r0, [r4], #-512	; 0xfffffe00
     144:	04020020 	streq	r0, [r2], #-32	; 0xffffffe0
     148:	00970614 	addseq	r0, r7, r4, lsl r6
     14c:	bb140402 	bllt	50115c <_Min_Stack_Size+0x500d5c>
     150:	14040200 	strne	r0, [r4], #-512	; 0xfffffe00
     154:	23ad84bc 			; <UNDEFINED> instruction: 0x23ad84bc
     158:	adad23ad 	stcge	3, cr2, [sp, #692]!	; 0x2b4
     15c:	ad4c8727 	stclge	7, cr8, [ip, #-156]	; 0xffffff64
     160:	5bbb1c60 	blpl	feec72e8 <_estack+0xdeec22e8>
     164:	01001402 	tsteq	r0, r2, lsl #8
     168:	02050001 	andeq	r0, r5, #1
     16c:	00000000 	andeq	r0, r0, r0
     170:	0101d403 	tsteq	r1, r3, lsl #8
     174:	3d3d3d31 	ldccc	13, cr3, [sp, #-196]!	; 0xffffff3c
     178:	674d3d3d 	smlaldxvs	r3, sp, sp, sp
     17c:	67676767 	strbvs	r6, [r7, -r7, ror #14]!
     180:	0b026867 	bleq	9a324 <_Min_Stack_Size+0x99f24>
     184:	00010100 	andeq	r0, r1, r0, lsl #2
     188:	05540205 	ldrbeq	r0, [r4, #-517]	; 0xfffffdfb
     18c:	ee030800 	cdp	8, 0, cr0, cr3, cr0, {0}
     190:	69300101 	ldmdbvs	r0!, {r0, r8}
     194:	0007023e 	andeq	r0, r7, lr, lsr r2
     198:	05000101 	streq	r0, [r0, #-257]	; 0xfffffeff
     19c:	00057802 	andeq	r7, r5, r2, lsl #16
     1a0:	01f80308 	mvnseq	r0, r8, lsl #6
     1a4:	3e693001 	cdpcc	0, 6, cr3, cr9, cr1, {0}
     1a8:	01000702 	tsteq	r0, r2, lsl #14
     1ac:	02050001 	andeq	r0, r5, #1
     1b0:	0800059c 	stmdaeq	r0, {r2, r3, r4, r7, r8, sl}
     1b4:	01028203 	tsteq	r2, r3, lsl #4
     1b8:	023e6930 	eorseq	r6, lr, #48, 18	; 0xc0000
     1bc:	01010007 	tsteq	r1, r7
     1c0:	c0020500 	andgt	r0, r2, r0, lsl #10
     1c4:	03080005 	movweq	r0, #32773	; 0x8005
     1c8:	3001028c 	andcc	r0, r1, ip, lsl #5
     1cc:	07023e69 	streq	r3, [r2, -r9, ror #28]
     1d0:	00010100 	andeq	r0, r1, r0, lsl #2
     1d4:	05e40205 	strbeq	r0, [r4, #517]!	; 0x205
     1d8:	96030800 	strls	r0, [r3], -r0, lsl #16
     1dc:	69300102 	ldmdbvs	r0!, {r1, r8}
     1e0:	0007023e 	andeq	r0, r7, lr, lsr r2
     1e4:	05000101 	streq	r0, [r0, #-257]	; 0xfffffeff
     1e8:	00060802 	andeq	r0, r6, r2, lsl #16
     1ec:	02a00308 	adceq	r0, r0, #8, 6	; 0x20000000
     1f0:	02003001 	andeq	r3, r0, #1
     1f4:	66060104 	strvs	r0, [r6], -r4, lsl #2
     1f8:	02009106 	andeq	r9, r0, #-2147483647	; 0x80000001
     1fc:	66060104 	strvs	r0, [r6], -r4, lsl #2
     200:	02009106 	andeq	r9, r0, #-2147483647	; 0x80000001
     204:	66060104 	strvs	r0, [r6], -r4, lsl #2
     208:	02009106 	andeq	r9, r0, #-2147483647	; 0x80000001
     20c:	66060104 	strvs	r0, [r6], -r4, lsl #2
     210:	02009106 	andeq	r9, r0, #-2147483647	; 0x80000001
     214:	66060104 	strvs	r0, [r6], -r4, lsl #2
     218:	07029106 	streq	r9, [r2, -r6, lsl #2]
     21c:	00010100 	andeq	r0, r1, r0, lsl #2
     220:	06b00205 	ldrteq	r0, [r0], r5, lsl #4
     224:	aa030800 	bge	c222c <_Min_Stack_Size+0xc1e2c>
     228:	00300102 	eorseq	r0, r0, r2, lsl #2
     22c:	06010402 	streq	r0, [r1], -r2, lsl #8
     230:	00910666 	addseq	r0, r1, r6, ror #12
     234:	06010402 	streq	r0, [r1], -r2, lsl #8
     238:	00910666 	addseq	r0, r1, r6, ror #12
     23c:	06010402 	streq	r0, [r1], -r2, lsl #8
     240:	00910666 	addseq	r0, r1, r6, ror #12
     244:	06010402 	streq	r0, [r1], -r2, lsl #8
     248:	00910666 	addseq	r0, r1, r6, ror #12
     24c:	06010402 	streq	r0, [r1], -r2, lsl #8
     250:	02910666 	addseq	r0, r1, #106954752	; 0x6600000
     254:	01010007 	tsteq	r1, r7
     258:	00000204 	andeq	r0, r0, r4, lsl #4
     25c:	009a0002 	addseq	r0, sl, r2
     260:	01020000 	mrseq	r0, (UNDEF: 2)
     264:	000d0efb 	strdeq	r0, [sp], -fp
     268:	01010101 	tsteq	r1, r1, lsl #2
     26c:	01000000 	mrseq	r0, (UNDEF: 0)
     270:	2e010000 	cdpcs	0, 0, cr0, cr1, cr0, {0}
     274:	434d2f2e 	movtmi	r2, #57134	; 0xdf2e
     278:	2e004c41 	cdpcs	12, 0, cr4, cr0, cr1, {2}
     27c:	434d2f2e 	movtmi	r2, #57134	; 0xdf2e
     280:	492f4c41 	stmdbmi	pc!, {r0, r6, sl, fp, lr}	; <UNPREDICTABLE>
     284:	2e2f636e 	cdpcs	3, 2, cr6, cr15, cr14, {3}
     288:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
     28c:	7265532f 	rsbvc	r5, r5, #-1140850688	; 0xbc000000
     290:	65636976 	strbvs	r6, [r3, #-2422]!	; 0xfffff68a
     294:	2e2e0073 	mcrcs	0, 1, r0, cr14, cr3, {3}
     298:	41434d2f 	cmpmi	r3, pc, lsr #26
     29c:	6e492f4c 	cdpvs	15, 4, cr2, cr9, cr12, {2}
     2a0:	2e2e0063 	cdpcs	0, 2, cr0, cr14, cr3, {3}
     2a4:	41434d2f 	cmpmi	r3, pc, lsr #26
     2a8:	2e2e2f4c 	cdpcs	15, 2, cr2, cr14, cr12, {2}
     2ac:	7265532f 	rsbvc	r5, r5, #-1140850688	; 0xbc000000
     2b0:	65636976 	strbvs	r6, [r3, #-2422]!	; 0xfffff68a
     2b4:	47000073 	smlsdxmi	r0, r3, r0, r0
     2b8:	2e4f4950 			; <UNDEFINED> instruction: 0x2e4f4950
     2bc:	00010063 	andeq	r0, r1, r3, rrx
     2c0:	616c5000 	cmnvs	ip, r0
     2c4:	726f6674 	rsbvc	r6, pc, #116, 12	; 0x7400000
     2c8:	79545f6d 	ldmdbvc	r4, {r0, r2, r3, r5, r6, r8, r9, sl, fp, ip, lr}^
     2cc:	2e736570 	mrccs	5, 3, r6, cr3, cr0, {3}
     2d0:	00020068 	andeq	r0, r2, r8, rrx
     2d4:	6d747300 	ldclvs	3, cr7, [r4, #-0]
     2d8:	31663233 	cmncc	r6, r3, lsr r2
     2dc:	36633330 			; <UNDEFINED> instruction: 0x36633330
     2e0:	0200682e 	andeq	r6, r0, #3014656	; 0x2e0000
     2e4:	50470000 	subpl	r0, r7, r0
     2e8:	682e4f49 	stmdavs	lr!, {r0, r3, r6, r8, r9, sl, fp, lr}
     2ec:	00000300 	andeq	r0, r0, r0, lsl #6
     2f0:	6c697455 	cfstrdvs	mvd7, [r9], #-340	; 0xfffffeac
     2f4:	00682e73 	rsbeq	r2, r8, r3, ror lr
     2f8:	00000004 	andeq	r0, r0, r4
     2fc:	58020500 	stmdapl	r2, {r8, sl}
     300:	03080007 	movweq	r0, #32775	; 0x8007
     304:	025a0117 	subseq	r0, sl, #-1073741819	; 0xc0000005
     308:	30301438 	eorscc	r1, r0, r8, lsr r4
     30c:	30303030 	eorscc	r3, r0, r0, lsr r0
     310:	30303230 	eorscc	r3, r0, r0, lsr r2
     314:	30303030 	eorscc	r3, r0, r0, lsr r0
     318:	02213030 	eoreq	r3, r1, #48	; 0x30
     31c:	01010005 	tsteq	r1, r5
     320:	20020500 	andcs	r0, r2, r0, lsl #10
     324:	03080008 	movweq	r0, #32776	; 0x8008
     328:	4d0100d2 	stcmi	0, cr0, [r1, #-840]	; 0xfffffcb8
     32c:	01040200 	mrseq	r0, R12_usr
     330:	4c065806 	stcmi	8, cr5, [r6], {6}
     334:	02004c67 	andeq	r4, r0, #26368	; 0x6700
     338:	58060104 	stmdapl	r6, {r2, r8}
     33c:	4c674c06 	stclmi	12, cr4, [r7], #-24	; 0xffffffe8
     340:	01040200 	mrseq	r0, R12_usr
     344:	4c065806 	stcmi	8, cr5, [r6], {6}
     348:	02004c67 	andeq	r4, r0, #26368	; 0x6700
     34c:	58060104 	stmdapl	r6, {r2, r8}
     350:	4c674c06 	stclmi	12, cr4, [r7], #-24	; 0xffffffe8
     354:	01040200 	mrseq	r0, R12_usr
     358:	4c065806 	stcmi	8, cr5, [r6], {6}
     35c:	674c4067 	strbvs	r4, [ip, -r7, rrx]
     360:	02002f40 	andeq	r2, r0, #64, 30	; 0x100
     364:	4a060104 	bmi	18077c <_Min_Stack_Size+0x18037c>
     368:	02040200 	andeq	r0, r4, #0, 4
     36c:	0402003c 	streq	r0, [r2], #-60	; 0xffffffc4
     370:	02003c04 	andeq	r3, r0, #4, 24	; 0x400
     374:	23060404 	movwcs	r0, #25604	; 0x6404
     378:	04040200 	streq	r0, [r4], #-512	; 0xfffffe00
     37c:	04020031 	streq	r0, [r2], #-49	; 0xffffffcf
     380:	0200e704 	andeq	lr, r0, #4, 14	; 0x100000
     384:	4a060104 	bmi	18079c <_Min_Stack_Size+0x18039c>
     388:	eb304d06 	bl	c137a8 <_Min_Stack_Size+0xc133a8>
     38c:	04020031 	streq	r0, [r2], #-49	; 0xffffffcf
     390:	064a0601 	strbeq	r0, [sl], -r1, lsl #12
     394:	0200864c 	andeq	r8, r0, #76, 12	; 0x4c00000
     398:	4a060104 	bmi	1807b0 <_Min_Stack_Size+0x1803b0>
     39c:	4d314d06 	ldcmi	13, cr4, [r1, #-24]!	; 0xffffffe8
     3a0:	200a039b 	mulcs	sl, fp, r3
     3a4:	039e7603 	orrseq	r7, lr, #3145728	; 0x300000
     3a8:	e5342011 	ldr	r2, [r4, #-17]!	; 0xffffffef
     3ac:	120222d8 	andne	r2, r2, #216, 4	; 0x8000000d
     3b0:	00010100 	andeq	r0, r1, r0, lsl #2
     3b4:	00000205 	andeq	r0, r0, r5, lsl #4
     3b8:	c7030000 	strgt	r0, [r3, -r0]
     3bc:	4b4d0101 	blmi	13407c8 <_Min_Stack_Size+0x13403c8>
     3c0:	661b0367 	ldrvs	r0, [fp], -r7, ror #6
     3c4:	4c206803 	stcmi	8, cr6, [r0], #-12
     3c8:	66150367 	ldrvs	r0, [r5], -r7, ror #6
     3cc:	4c206e03 	stcmi	14, cr6, [r0], #-12
     3d0:	660f0367 	strvs	r0, [pc], -r7, ror #6
     3d4:	4c207403 	cfstrsmi	mvf7, [r0], #-12
     3d8:	66090367 	strvs	r0, [r9], -r7, ror #6
     3dc:	0269671c 	rsbeq	r6, r9, #28, 14	; 0x700000
     3e0:	01010010 	tsteq	r1, r0, lsl r0
     3e4:	00020500 	andeq	r0, r2, r0, lsl #10
     3e8:	03000000 	movweq	r0, #0
     3ec:	4d0101f6 	stfmis	f0, [r1, #-984]	; 0xfffffc28
     3f0:	02233483 	eoreq	r3, r3, #-2097152000	; 0x83000000
     3f4:	01010005 	tsteq	r1, r5
     3f8:	00020500 	andeq	r0, r2, r0, lsl #10
     3fc:	03000000 	movweq	r0, #0
     400:	4d010292 	sfmmi	f0, 4, [r1, #-584]	; 0xfffffdb8
     404:	0005023e 	andeq	r0, r5, lr, lsr r2
     408:	05000101 	streq	r0, [r0, #-257]	; 0xfffffeff
     40c:	00000002 	andeq	r0, r0, r2
     410:	02a90300 	adceq	r0, r9, #0, 6
     414:	033f6901 	teqeq	pc, #16384	; 0x4000
     418:	5b1d5809 	blpl	756444 <_Min_Stack_Size+0x756044>
     41c:	01000502 	tsteq	r0, r2, lsl #10
     420:	02050001 	andeq	r0, r5, #1
     424:	00000000 	andeq	r0, r0, r0
     428:	0102c903 	tsteq	r2, r3, lsl #18
     42c:	05023e69 	streq	r3, [r2, #-3689]	; 0xfffff197
     430:	00010100 	andeq	r0, r1, r0, lsl #2
     434:	00000205 	andeq	r0, r0, r5, lsl #4
     438:	dd030000 	stcle	0, cr0, [r3, #-0]
     43c:	9f4d0102 	svcls	0x004d0102
     440:	01000502 	tsteq	r0, r2, lsl #10
     444:	02050001 	andeq	r0, r5, #1
     448:	00000000 	andeq	r0, r0, r0
     44c:	0102f203 	tsteq	r2, r3, lsl #4	; <UNPREDICTABLE>
     450:	9e09034e 	cdpls	3, 0, cr0, cr9, cr14, {2}
     454:	3e848484 	cdpcc	4, 8, cr8, cr4, cr4, {4}
     458:	02233376 	eoreq	r3, r3, #-671088639	; 0xd8000001
     45c:	01010005 	tsteq	r1, r5
     460:	000002d5 	ldrdeq	r0, [r0], -r5
     464:	00a40002 	adceq	r0, r4, r2
     468:	01020000 	mrseq	r0, (UNDEF: 2)
     46c:	000d0efb 	strdeq	r0, [sp], -fp
     470:	01010101 	tsteq	r1, r1, lsl #2
     474:	01000000 	mrseq	r0, (UNDEF: 0)
     478:	2e010000 	cdpcs	0, 0, cr0, cr1, cr0, {0}
     47c:	434d2f2e 	movtmi	r2, #57134	; 0xdf2e
     480:	2e004c41 	cdpcs	12, 0, cr4, cr0, cr1, {2}
     484:	434d2f2e 	movtmi	r2, #57134	; 0xdf2e
     488:	492f4c41 	stmdbmi	pc!, {r0, r6, sl, fp, lr}	; <UNPREDICTABLE>
     48c:	2e2f636e 	cdpcs	3, 2, cr6, cr15, cr14, {3}
     490:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
     494:	7265532f 	rsbvc	r5, r5, #-1140850688	; 0xbc000000
     498:	65636976 	strbvs	r6, [r3, #-2422]!	; 0xfffff68a
     49c:	2e2e0073 	mcrcs	0, 1, r0, cr14, cr3, {3}
     4a0:	41434d2f 	cmpmi	r3, pc, lsr #26
     4a4:	6e492f4c 	cdpvs	15, 4, cr2, cr9, cr12, {2}
     4a8:	2e2e0063 	cdpcs	0, 2, cr0, cr14, cr3, {3}
     4ac:	41434d2f 	cmpmi	r3, pc, lsr #26
     4b0:	2e2e2f4c 	cdpcs	15, 2, cr2, cr14, cr12, {2}
     4b4:	7265532f 	rsbvc	r5, r5, #-1140850688	; 0xbc000000
     4b8:	65636976 	strbvs	r6, [r3, #-2422]!	; 0xfffff68a
     4bc:	47000073 	smlsdxmi	r0, r3, r0, r0
     4c0:	2e4d5450 	mcrcs	4, 2, r5, cr13, cr0, {2}
     4c4:	00010063 	andeq	r0, r1, r3, rrx
     4c8:	616c5000 	cmnvs	ip, r0
     4cc:	726f6674 	rsbvc	r6, pc, #116, 12	; 0x7400000
     4d0:	79545f6d 	ldmdbvc	r4, {r0, r2, r3, r5, r6, r8, r9, sl, fp, ip, lr}^
     4d4:	2e736570 	mrccs	5, 3, r6, cr3, cr0, {3}
     4d8:	00020068 	andeq	r0, r2, r8, rrx
     4dc:	6d747300 	ldclvs	3, cr7, [r4, #-0]
     4e0:	31663233 	cmncc	r6, r3, lsr r2
     4e4:	36633330 			; <UNDEFINED> instruction: 0x36633330
     4e8:	0200682e 	andeq	r6, r0, #3014656	; 0x2e0000
     4ec:	50470000 	subpl	r0, r7, r0
     4f0:	682e4f49 	stmdavs	lr!, {r0, r3, r6, r8, r9, sl, fp, lr}
     4f4:	00000300 	andeq	r0, r0, r0, lsl #6
     4f8:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
     4fc:	0300682e 	movweq	r6, #2094	; 0x82e
     500:	74550000 	ldrbvc	r0, [r5], #-0
     504:	2e736c69 	cdpcs	12, 7, cr6, cr3, cr9, {3}
     508:	00040068 	andeq	r0, r4, r8, rrx
     50c:	05000000 	streq	r0, [r0, #-0]
     510:	00000002 	andeq	r0, r0, r2
     514:	01330300 	teqeq	r3, r0, lsl #6
     518:	2f2f2f4d 	svccs	0x002f2f4d
     51c:	2f314b2f 	svccs	0x00314b2f
     520:	765a3330 			; <UNDEFINED> instruction: 0x765a3330
     524:	6c5a765a 	mrrcvs	6, 5, r7, sl, cr10
     528:	302d2f52 	eorcc	r2, sp, r2, asr pc
     52c:	032b312c 			; <UNDEFINED> instruction: 0x032b312c
     530:	3e3e740c 	cdpcc	4, 3, cr7, cr14, cr12, {0}
     534:	3e3e2f2f 	cdpcc	15, 3, cr2, cr14, cr15, {1}
     538:	3e3e2f2f 	cdpcc	15, 3, cr2, cr14, cr15, {1}
     53c:	2f402f2f 	svccs	0x00402f2f
     540:	00bc312f 	adcseq	r3, ip, pc, lsr #2
     544:	06010402 	streq	r0, [r1], -r2, lsl #8
     548:	765a0658 			; <UNDEFINED> instruction: 0x765a0658
     54c:	01040200 	mrseq	r0, R12_usr
     550:	5a065806 	bpl	196570 <_Min_Stack_Size+0x196170>
     554:	c7670868 	strbgt	r0, [r7, -r8, ror #16]!
     558:	a23bc73e 	eorsge	ip, fp, #16252928	; 0xf80000
     55c:	00a1c7d7 	ldrdeq	ip, [r1], r7	; <UNPREDICTABLE>
     560:	03020402 	movweq	r0, #9218	; 0x2402
     564:	02008254 	andeq	r8, r0, #84, 4	; 0x40000005
     568:	3c060104 	stfccs	f0, [r6], {4}
     56c:	4a300306 	bmi	c0118c <_Min_Stack_Size+0xc00d8c>
     570:	3e2f2f2f 	cdpcc	15, 2, cr2, cr15, cr15, {1}
     574:	3e2f2f3e 	mcrcc	15, 1, r2, cr15, cr14, {1}
     578:	3e2f2f3e 	mcrcc	15, 1, r2, cr15, cr14, {1}
     57c:	942f2f3e 	strtls	r2, [pc], #-3902	; 584 <_Min_Stack_Size+0x184>
     580:	84302f2f 	ldrthi	r2, [r0], #-3887	; 0xfffff0d1
     584:	3e9d3d08 	cdpcc	13, 9, cr3, cr13, cr8, {0}
     588:	3aab3e9d 	bcc	fead0004 <_estack+0xdeacb004>
     58c:	00abbba3 	adceq	fp, fp, r3, lsr #23
     590:	03020402 	movweq	r0, #9218	; 0x2402
     594:	02009e5f 	andeq	r9, r0, #1520	; 0x5f0
     598:	3c060104 	stfccs	f0, [r6], {4}
     59c:	4a320306 	bmi	c811bc <_Min_Stack_Size+0xc80dbc>
     5a0:	3b2f3b83 	blcc	bcf3b4 <_Min_Stack_Size+0xbcefb4>
     5a4:	5a895a7a 	bpl	fe256f94 <_estack+0xde251f94>
     5a8:	76595a83 	ldrbvc	r5, [r9], -r3, lsl #21
     5ac:	5a76595a 	bpl	1d96b1c <_Min_Stack_Size+0x1d9671c>
     5b0:	59596a59 	ldmdbpl	r9, {r0, r3, r4, r6, r9, fp, sp, lr}^
     5b4:	5a595959 	bpl	1656b20 <_Min_Stack_Size+0x1656720>
     5b8:	000c0222 	andeq	r0, ip, r2, lsr #4
     5bc:	05000101 	streq	r0, [r0, #-257]	; 0xfffffeff
     5c0:	00000002 	andeq	r0, r0, r2
     5c4:	028a0300 	addeq	r0, sl, #0, 6
     5c8:	67594d01 	ldrbvs	r4, [r9, -r1, lsl #26]
     5cc:	03660e03 	cmneq	r6, #3, 28	; 0x30
     5d0:	675a2075 			; <UNDEFINED> instruction: 0x675a2075
     5d4:	675a1b6e 	ldrbvs	r1, [sl, -lr, ror #22]
     5d8:	000b0268 	andeq	r0, fp, r8, ror #4
     5dc:	05000101 	streq	r0, [r0, #-257]	; 0xfffffeff
     5e0:	00000002 	andeq	r0, r0, r2
     5e4:	02ad0300 	adceq	r0, sp, #0, 6
     5e8:	4c5a4d01 	mrrcmi	13, 0, r4, sl, cr1
     5ec:	01040200 	mrseq	r0, R12_usr
     5f0:	4d06ba06 	vstrmi	s22, [r6, #-24]	; 0xffffffe8
     5f4:	922555d7 	eorls	r5, r5, #901775360	; 0x35c00000
     5f8:	040200d7 	streq	r0, [r2], #-215	; 0xffffff29
     5fc:	58750302 	ldmdapl	r5!, {r1, r8, r9}^
     600:	01040200 	mrseq	r0, R12_usr
     604:	03065806 	movweq	r5, #26630	; 0x6806
     608:	034a00f6 	movteq	r0, #41206	; 0xa0f6
     60c:	68207f9b 	stmdavs	r0!, {r0, r1, r3, r4, r7, r8, r9, sl, fp, ip, sp, lr}
     610:	5a68754d 	bpl	1a1db4c <_Min_Stack_Size+0x1a1d74c>
     614:	754d5b75 	strbvc	r5, [sp, #-2933]	; 0xfffff48b
     618:	5b755a68 	blpl	1d56fc0 <_Min_Stack_Size+0x1d56bc0>
     61c:	5a68755b 	bpl	1a1db90 <_Min_Stack_Size+0x1a1d790>
     620:	755b5b75 	ldrbvc	r5, [fp, #-2933]	; 0xfffff48b
     624:	03583b03 	cmpeq	r8, #3072	; 0xc00
     628:	02002047 	andeq	r2, r0, #71	; 0x47
     62c:	00680204 	rsbeq	r0, r8, r4, lsl #4
     630:	75020402 	strvc	r0, [r2, #-1026]	; 0xfffffbfe
     634:	02040200 	andeq	r0, r4, #0, 4
     638:	03583603 	cmpeq	r8, #3145728	; 0x300000
     63c:	4d68204e 	stclmi	0, cr2, [r8, #-312]!	; 0xfffffec8
     640:	755a6875 	ldrbvc	r6, [sl, #-2165]	; 0xfffff78b
     644:	68754d5b 	ldmdavs	r5!, {r0, r1, r3, r4, r6, r8, sl, fp, lr}^
     648:	5b5b755a 	blpl	16ddbb8 <_Min_Stack_Size+0x16dd7b8>
     64c:	755a6875 	ldrbvc	r6, [sl, #-2165]	; 0xfffff78b
     650:	60755b5b 	rsbsvs	r5, r5, fp, asr fp
     654:	5a207a03 	bpl	81ee68 <_Min_Stack_Size+0x81ea68>
     658:	2b025b75 	blcs	97434 <_Min_Stack_Size+0x97034>
     65c:	00010100 	andeq	r0, r1, r0, lsl #2
     660:	00000205 	andeq	r0, r0, r5, lsl #4
     664:	ab030000 	blge	c066c <_Min_Stack_Size+0xc026c>
     668:	674e0103 	strbvs	r0, [lr, -r3, lsl #2]
     66c:	01000502 	tsteq	r0, r2, lsl #10
     670:	02050001 	andeq	r0, r5, #1
     674:	00000000 	andeq	r0, r0, r0
     678:	0103b203 	tsteq	r3, r3, lsl #4
     67c:	0502674e 	streq	r6, [r2, #-1870]	; 0xfffff8b2
     680:	00010100 	andeq	r0, r1, r0, lsl #2
     684:	00000205 	andeq	r0, r0, r5, lsl #4
     688:	b9030000 	stmdblt	r3, {}	; <UNPREDICTABLE>
     68c:	3d670103 	stfcce	f0, [r7, #-12]!
     690:	01000502 	tsteq	r0, r2, lsl #10
     694:	02050001 	andeq	r0, r5, #1
     698:	00000000 	andeq	r0, r0, r0
     69c:	0103bc03 	tsteq	r3, r3, lsl #24
     6a0:	022f3d4b 	eoreq	r3, pc, #4800	; 0x12c0
     6a4:	01010005 	tsteq	r1, r5
     6a8:	00020500 	andeq	r0, r2, r0, lsl #10
     6ac:	03000000 	movweq	r0, #0
     6b0:	670103c1 	strvs	r0, [r1, -r1, asr #7]
     6b4:	00050259 	andeq	r0, r5, r9, asr r2
     6b8:	05000101 	streq	r0, [r0, #-257]	; 0xfffffeff
     6bc:	00000002 	andeq	r0, r0, r2
     6c0:	03c40300 	biceq	r0, r4, #0, 6
     6c4:	4b3d4b01 	blmi	f532d0 <_Min_Stack_Size+0xf52ed0>
     6c8:	01000502 	tsteq	r0, r2, lsl #10
     6cc:	02050001 	andeq	r0, r5, #1
     6d0:	00000000 	andeq	r0, r0, r0
     6d4:	0103ca03 	tsteq	r3, r3, lsl #20
     6d8:	05027584 	streq	r7, [r2, #-1412]	; 0xfffffa7c
     6dc:	00010100 	andeq	r0, r1, r0, lsl #2
     6e0:	00000205 	andeq	r0, r0, r5, lsl #4
     6e4:	cf030000 	svcgt	0x00030000
     6e8:	75680103 	strbvc	r0, [r8, #-259]!	; 0xfffffefd
     6ec:	01000502 	tsteq	r0, r2, lsl #10
     6f0:	02050001 	andeq	r0, r5, #1
     6f4:	08000a3c 	stmdaeq	r0, {r2, r3, r4, r5, r9, fp}
     6f8:	0103d503 	tsteq	r3, r3, lsl #10
     6fc:	8686792f 	strhi	r7, [r6], pc, lsr #18
     700:	3e86793f 			; <UNDEFINED> instruction: 0x3e86793f
     704:	01000402 	tsteq	r0, r2, lsl #8
     708:	02050001 	andeq	r0, r5, #1
     70c:	08000aa0 	stmdaeq	r0, {r5, r7, r9, fp}
     710:	0103f403 	tsteq	r3, r3, lsl #8	; <UNPREDICTABLE>
     714:	6a6a6b2f 	bvs	1a9b3d8 <_Min_Stack_Size+0x1a9afd8>
     718:	3e6a6b3f 	vmovcc.8	d10[5], r6
     71c:	01000602 	tsteq	r0, r2, lsl #12
     720:	02050001 	andeq	r0, r5, #1
     724:	08000af8 	stmdaeq	r0, {r3, r4, r5, r6, r7, r9, fp}
     728:	01049303 	tsteq	r4, r3, lsl #6
     72c:	6a6a6b2f 	bvs	1a9b3f0 <_Min_Stack_Size+0x1a9aff0>
     730:	3e6a6b3f 	vmovcc.8	d10[5], r6
     734:	01000602 	tsteq	r0, r2, lsl #12
     738:	00046401 	andeq	r6, r4, r1, lsl #8
     73c:	ab000200 	blge	f44 <_Min_Stack_Size+0xb44>
     740:	02000000 	andeq	r0, r0, #0
     744:	0d0efb01 	vstreq	d15, [lr, #-4]
     748:	01010100 	mrseq	r0, (UNDEF: 17)
     74c:	00000001 	andeq	r0, r0, r1
     750:	01000001 	tsteq	r0, r1
     754:	4d2f2e2e 	stcmi	14, cr2, [pc, #-184]!	; 6a4 <_Min_Stack_Size+0x2a4>
     758:	004c4143 	subeq	r4, ip, r3, asr #2
     75c:	4d2f2e2e 	stcmi	14, cr2, [pc, #-184]!	; 6ac <_Min_Stack_Size+0x2ac>
     760:	2f4c4143 	svccs	0x004c4143
     764:	2f636e49 	svccs	0x00636e49
     768:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
     76c:	65532f2e 	ldrbvs	r2, [r3, #-3886]	; 0xfffff0d2
     770:	63697672 	cmnvs	r9, #119537664	; 0x7200000
     774:	2e007365 	cdpcs	3, 0, cr7, cr0, cr5, {3}
     778:	434d2f2e 	movtmi	r2, #57134	; 0xdf2e
     77c:	492f4c41 	stmdbmi	pc!, {r0, r6, sl, fp, lr}	; <UNPREDICTABLE>
     780:	2e00636e 	cdpcs	3, 0, cr6, cr0, cr14, {3}
     784:	434d2f2e 	movtmi	r2, #57134	; 0xdf2e
     788:	2e2f4c41 	cdpcs	12, 2, cr4, cr15, cr1, {2}
     78c:	65532f2e 	ldrbvs	r2, [r3, #-3886]	; 0xfffff0d2
     790:	63697672 	cmnvs	r9, #119537664	; 0x7200000
     794:	00007365 	andeq	r7, r0, r5, ror #6
     798:	2e433249 	cdpcs	2, 4, cr3, cr3, cr9, {2}
     79c:	00010063 	andeq	r0, r1, r3, rrx
     7a0:	616c5000 	cmnvs	ip, r0
