mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
     7a4:	726f6674 	rsbvc	r6, pc, #116, 12	; 0x7400000
     7a8:	79545f6d 	ldmdbvc	r4, {r0, r2, r3, r5, r6, r8, r9, sl, fp, ip, lr}^
     7ac:	2e736570 	mrccs	5, 3, r6, cr3, cr0, {3}
     7b0:	00020068 	andeq	r0, r2, r8, rrx
     7b4:	6d747300 	ldclvs	3, cr7, [r4, #-0]
     7b8:	31663233 	cmncc	r6, r3, lsr r2
     7bc:	36633330 			; <UNDEFINED> instruction: 0x36633330
     7c0:	0200682e 	andeq	r6, r0, #3014656	; 0x2e0000
     7c4:	50470000 	subpl	r0, r7, r0
     7c8:	682e4f49 	stmdavs	lr!, {r0, r3, r6, r8, r9, sl, fp, lr}
     7cc:	00000300 	andeq	r0, r0, r0, lsl #6
     7d0:	2e433249 	cdpcs	2, 4, cr3, cr3, cr9, {2}
     7d4:	00030068 	andeq	r0, r3, r8, rrx
     7d8:	69745500 	ldmdbvs	r4!, {r8, sl, ip, lr}^
     7dc:	682e736c 	stmdavs	lr!, {r2, r3, r5, r6, r8, r9, ip, sp, lr}
     7e0:	00000400 	andeq	r0, r0, r0, lsl #8
     7e4:	2e434352 	mcrcs	3, 2, r4, cr3, cr2, {2}
     7e8:	00030068 	andeq	r0, r3, r8, rrx
     7ec:	05000000 	streq	r0, [r0, #-0]
     7f0:	00000002 	andeq	r0, r0, r2
     7f4:	011f0300 	tsteq	pc, r0, lsl #6
     7f8:	302f5b50 	eorcc	r5, pc, r0, asr fp	; <UNPREDICTABLE>
     7fc:	3e2f412f 	sufccep	f4, f7, #10.0
     800:	302f422f 	eorcc	r4, pc, pc, lsr #4
     804:	5959302f 	ldmdbpl	r9, {r0, r1, r2, r3, r5, ip, sp}^
     808:	01000802 	tsteq	r0, r2, lsl #16
     80c:	02050001 	andeq	r0, r5, #1
     810:	00000000 	andeq	r0, r0, r0
     814:	0100c603 	tsteq	r0, r3, lsl #12
     818:	2275e75a 	rsbscs	lr, r5, #23592960	; 0x1680000
     81c:	22752267 	rsbscs	r2, r5, #1879048198	; 0x70000006
     820:	02212275 	eoreq	r2, r1, #1342177287	; 0x50000007
     824:	0101000a 	tsteq	r1, sl
     828:	00020500 	andeq	r0, r2, r0, lsl #10
     82c:	03000000 	movweq	r0, #0
     830:	4d0100ee 	stcmi	0, cr0, [r1, #-952]	; 0xfffffc48
     834:	673d2f68 	ldrvs	r2, [sp, -r8, ror #30]!
     838:	59755941 	ldmdbpl	r5!, {r0, r6, r8, fp, ip, lr}^
     83c:	6b6b526c 	blvs	1ad51f4 <_Min_Stack_Size+0x1ad4df4>
     840:	75876c9f 	strvc	r6, [r7, #3231]	; 0xc9f
     844:	68675f2d 	stmdavs	r7!, {r0, r2, r3, r5, r8, r9, sl, fp, ip, lr}^
     848:	4ba34b9f 	blmi	fe8d36cc <_estack+0xde8ce6cc>
     84c:	4b4b4b4b 	blmi	12d3580 <_Min_Stack_Size+0x12d3180>
     850:	2f8a3e4c 	svccs	0x008a3e4c
     854:	01000e02 	tsteq	r0, r2, lsl #28
     858:	02050001 	andeq	r0, r5, #1
     85c:	00000000 	andeq	r0, r0, r0
     860:	0101d403 	tsteq	r1, r3, lsl #8
     864:	69675b4d 	stmdbvs	r7!, {r0, r2, r3, r6, r8, r9, fp, ip, lr}^
     868:	66110367 	ldrvs	r0, [r1], -r7, ror #6
     86c:	67207703 	strvs	r7, [r0, -r3, lsl #14]!
     870:	026a6769 	rsbeq	r6, sl, #27525120	; 0x1a40000
     874:	0101000e 	tsteq	r1, lr
     878:	00020500 	andeq	r0, r2, r0, lsl #10
     87c:	03000000 	movweq	r0, #0
     880:	4c0101f3 	stfmis	f0, [r1], {243}	; 0xf3
     884:	0402004d 	streq	r0, [r2], #-77	; 0xffffffb3
     888:	06580601 	ldrbeq	r0, [r8], -r1, lsl #12
     88c:	005a6768 	subseq	r6, sl, r8, ror #14
     890:	06010402 	streq	r0, [r1], -r2, lsl #8
     894:	67680658 			; <UNDEFINED> instruction: 0x67680658
     898:	944c844d 	strbls	r8, [ip], #-1101	; 0xfffffbb3
     89c:	04020096 	streq	r0, [r2], #-150	; 0xffffff6a
     8a0:	06580601 	ldrbeq	r0, [r8], -r1, lsl #12
     8a4:	004c6768 	subeq	r6, ip, r8, ror #14
     8a8:	06010402 	streq	r0, [r1], -r2, lsl #8
     8ac:	67680658 			; <UNDEFINED> instruction: 0x67680658
     8b0:	4d87843f 	cfstrsmi	mvf8, [r7, #252]	; 0xfc
     8b4:	01040200 	mrseq	r0, R12_usr
     8b8:	68065806 	stmdavs	r6, {r1, r2, fp, ip, lr}
     8bc:	02005b67 	andeq	r5, r0, #105472	; 0x19c00
     8c0:	58060104 	stmdapl	r6, {r2, r8}
     8c4:	4d676806 	stclmi	8, cr6, [r7, #-24]!	; 0xffffffe8
     8c8:	03821303 	orreq	r1, r2, #201326592	; 0xc000000
     8cc:	02002072 	andeq	r2, r0, #114	; 0x72
     8d0:	58060104 	stmdapl	r6, {r2, r8}
     8d4:	4c676806 	stclmi	8, cr6, [r7], #-24	; 0xffffffe8
     8d8:	01040200 	mrseq	r0, R12_usr
     8dc:	68065806 	stmdavs	r6, {r1, r2, fp, ip, lr}
     8e0:	02853f67 	addeq	r3, r5, #412	; 0x19c
     8e4:	01010019 	tsteq	r1, r9, lsl r0
     8e8:	00020500 	andeq	r0, r2, r0, lsl #10
     8ec:	03000000 	movweq	r0, #0
     8f0:	680102d6 	stmdavs	r1, {r1, r2, r4, r6, r7, r9}
     8f4:	41ca3e30 	bicmi	r3, sl, r0, lsr lr
     8f8:	022132e6 	eoreq	r3, r1, #1610612750	; 0x6000000e
     8fc:	01010005 	tsteq	r1, r5
     900:	00020500 	andeq	r0, r2, r0, lsl #10
     904:	03000000 	movweq	r0, #0
     908:	890102fe 	stmdbhi	r1, {r1, r2, r3, r4, r5, r6, r7, r9}
     90c:	0402003f 	streq	r0, [r2], #-63	; 0xffffffc1
     910:	06200601 	strteq	r0, [r0], -r1, lsl #12
     914:	1e863d79 	mcrne	13, 4, r3, cr6, cr9, {3}
     918:	00040284 	andeq	r0, r4, r4, lsl #5
     91c:	05000101 	streq	r0, [r0, #-257]	; 0xfffffeff
     920:	00000002 	andeq	r0, r0, r2
     924:	03a30300 			; <UNDEFINED> instruction: 0x03a30300
     928:	853d6901 	ldrhi	r6, [sp, #-2305]!	; 0xfffff6ff
     92c:	0502831f 	streq	r8, [r2, #-799]	; 0xfffffce1
     930:	00010100 	andeq	r0, r1, r0, lsl #2
     934:	00000205 	andeq	r0, r0, r5, lsl #4
     938:	bd030000 	stclt	0, cr0, [r3, #-0]
     93c:	3d870103 	stfccs	f0, [r7, #12]
     940:	05024c59 	streq	r4, [r2, #-3161]	; 0xfffff3a7
     944:	00010100 	andeq	r0, r1, r0, lsl #2
     948:	00000205 	andeq	r0, r0, r5, lsl #4
     94c:	ca030000 	bgt	c0954 <_Min_Stack_Size+0xc0554>
     950:	3e670103 	powccs	f0, f7, f3
     954:	04020075 	streq	r0, [r2], #-117	; 0xffffff8b
     958:	00200601 	eoreq	r0, r0, r1, lsl #12
     95c:	06020402 	streq	r0, [r2], -r2, lsl #8
     960:	04020071 	streq	r0, [r2], #-113	; 0xffffff8f
     964:	063c0601 	ldrteq	r0, [ip], -r1, lsl #12
     968:	0004024f 	andeq	r0, r4, pc, asr #4
     96c:	05000101 	streq	r0, [r0, #-257]	; 0xfffffeff
     970:	00000002 	andeq	r0, r0, r2
     974:	03d50300 	bicseq	r0, r5, #0, 6
     978:	3f307501 	svccc	0x00307501
     97c:	00404c4b 	subeq	r4, r0, fp, asr #24
     980:	06010402 	streq	r0, [r1], -r2, lsl #8
     984:	5b760620 	blpl	1d8220c <_Min_Stack_Size+0x1d81e0c>
     988:	02003d85 	andeq	r3, r0, #8512	; 0x2140
     98c:	004e0204 	subeq	r0, lr, r4, lsl #4
     990:	03020402 	movweq	r0, #9218	; 0x2402
     994:	0200826f 	andeq	r8, r0, #-268435450	; 0xf0000006
     998:	3c060104 	stfccs	f0, [r6], {4}
     99c:	58160306 	ldmdapl	r6, {r1, r2, r8, r9}
     9a0:	4d4b853f 	cfstr64mi	mvdx8, [fp, #-252]	; 0xffffff04
     9a4:	01040200 	mrseq	r0, R12_usr
     9a8:	77062006 	strvc	r2, [r6, -r6]
     9ac:	21684d3d 	cmncs	r8, sp, lsr sp
     9b0:	01000402 	tsteq	r0, r2, lsl #8
     9b4:	02050001 	andeq	r0, r5, #1
     9b8:	00000000 	andeq	r0, r0, r0
     9bc:	0104a403 	tsteq	r4, r3, lsl #8
     9c0:	007b3484 	rsbseq	r3, fp, r4, lsl #9
     9c4:	06010402 	streq	r0, [r1], -r2, lsl #8
     9c8:	4b7a0620 	blmi	1e82250 <_Min_Stack_Size+0x1e81e50>
     9cc:	0402006d 	streq	r0, [r2], #-109	; 0xffffff93
     9d0:	06200601 	strteq	r0, [r0], -r1, lsl #12
     9d4:	00504b7a 	subseq	r4, r0, sl, ror fp
     9d8:	06010402 	streq	r0, [r1], -r2, lsl #8
     9dc:	00750620 	rsbseq	r0, r5, r0, lsr #12
     9e0:	06010402 	streq	r0, [r1], -r2, lsl #8
     9e4:	00750620 	rsbseq	r0, r5, r0, lsr #12
     9e8:	06010402 	streq	r0, [r1], -r2, lsl #8
     9ec:	00750620 	rsbseq	r0, r5, r0, lsr #12
     9f0:	06010402 	streq	r0, [r1], -r2, lsl #8
     9f4:	5e7a0620 	cdppl	6, 7, cr0, cr10, cr0, {1}
     9f8:	01040200 	mrseq	r0, R12_usr
     9fc:	76062006 	strvc	r2, [r6], -r6
     a00:	01040200 	mrseq	r0, R12_usr
     a04:	78062006 	stmdavc	r6, {r1, r2, sp}
     a08:	02214c4b 	eoreq	r4, r1, #19200	; 0x4b00
     a0c:	01010004 	tsteq	r1, r4
     a10:	00020500 	andeq	r0, r2, r0, lsl #10
     a14:	03000000 	movweq	r0, #0
     a18:	84010582 	strhi	r0, [r1], #-1410	; 0xfffffa7e
     a1c:	00778631 	rsbseq	r8, r7, r1, lsr r6
     a20:	06010402 	streq	r0, [r1], -r2, lsl #8
     a24:	4b780620 	blmi	1e022ac <_Min_Stack_Size+0x1e01eac>
     a28:	0402006b 	streq	r0, [r2], #-107	; 0xffffff95
     a2c:	06200601 	strteq	r0, [r0], -r1, lsl #12
     a30:	02217676 	eoreq	r7, r1, #123731968	; 0x7600000
     a34:	01010004 	tsteq	r1, r4
     a38:	00020500 	andeq	r0, r2, r0, lsl #10
     a3c:	03000000 	movweq	r0, #0
     a40:	670105ae 	strvs	r0, [r1, -lr, lsr #11]
     a44:	0005024b 	andeq	r0, r5, fp, asr #4
     a48:	05000101 	streq	r0, [r0, #-257]	; 0xfffffeff
     a4c:	00000002 	andeq	r0, r0, r2
     a50:	05c10300 	strbeq	r0, [r1, #768]	; 0x300
     a54:	024b4b01 	subeq	r4, fp, #1024	; 0x400
     a58:	01010005 	tsteq	r1, r5
     a5c:	00020500 	andeq	r0, r2, r0, lsl #10
     a60:	03000000 	movweq	r0, #0
     a64:	670105c6 	strvs	r0, [r1, -r6, asr #11]
     a68:	841e893f 	ldrhi	r8, [lr], #-2367	; 0xfffff6c1
     a6c:	01000502 	tsteq	r0, r2, lsl #10
     a70:	02050001 	andeq	r0, r5, #1
     a74:	08000b50 	stmdaeq	r0, {r4, r6, r8, r9, fp}
     a78:	0105da03 	tsteq	r5, r3, lsl #20
     a7c:	5959333e 	ldmdbpl	r9, {r1, r2, r3, r4, r5, r8, r9, ip, sp}^
     a80:	0402005b 	streq	r0, [r2], #-91	; 0xffffffa5
     a84:	063c0601 	ldrteq	r0, [ip], -r1, lsl #12
     a88:	59504b42 	ldmdbpl	r0, {r1, r6, r8, r9, fp, lr}^
     a8c:	01040200 	mrseq	r0, R12_usr
     a90:	03063c06 	movweq	r3, #27654	; 0x6c06
     a94:	526d3c09 	rsbpl	r3, sp, #2304	; 0x900
     a98:	04020059 	streq	r0, [r2], #-89	; 0xffffffa7
     a9c:	003c0601 	eorseq	r0, ip, r1, lsl #12
     aa0:	3c020402 	cfstrscc	mvf0, [r2], {2}
     aa4:	686e3f06 	stmdavs	lr!, {r1, r2, r8, r9, sl, fp, ip, sp}^
     aa8:	02005952 	andeq	r5, r0, #1343488	; 0x148000
     aac:	3c060104 	stfccs	f0, [r6], {4}
     ab0:	02040200 	andeq	r0, r4, #0, 4
     ab4:	6d3f063c 	ldcvs	6, cr0, [pc, #-240]!	; 9cc <_Min_Stack_Size+0x5cc>
     ab8:	02224e68 	eoreq	r4, r2, #104, 28	; 0x680
     abc:	01010008 	tsteq	r1, r8
     ac0:	48020500 	stmdami	r2, {r8, sl}
     ac4:	0308000c 	movweq	r0, #32780	; 0x800c
     ac8:	400106b7 			; <UNDEFINED> instruction: 0x400106b7
     acc:	0200595c 	andeq	r5, r0, #92, 18	; 0x170000
     ad0:	3c060104 	stfccs	f0, [r6], {4}
     ad4:	4e694106 	powmie	f4, f1, f6
     ad8:	04020059 	streq	r0, [r2], #-89	; 0xffffffa7
     adc:	063c0601 	ldrteq	r0, [ip], -r1, lsl #12
     ae0:	59506941 	ldmdbpl	r0, {r0, r6, r8, fp, sp, lr}^
     ae4:	01040200 	mrseq	r0, R12_usr
     ae8:	41063c06 	tstmi	r6, r6, lsl #24
     aec:	00594e69 	subseq	r4, r9, r9, ror #28
     af0:	06010402 	streq	r0, [r1], -r2, lsl #8
     af4:	6941063c 	stmdbvs	r1, {r2, r3, r4, r5, r9, sl}^
     af8:	0200594e 	andeq	r5, r0, #1277952	; 0x138000
     afc:	3c060104 	stfccs	f0, [r6], {4}
     b00:	4c694106 	stfmie	f4, [r9], #-24	; 0xffffffe8
     b04:	01000902 	tsteq	r0, r2, lsl #18
     b08:	02050001 	andeq	r0, r5, #1
     b0c:	08000d3c 	stmdaeq	r0, {r2, r3, r4, r5, r8, sl, fp}
     b10:	01078403 	tsteq	r7, r3, lsl #8
     b14:	5959333f 	ldmdbpl	r9, {r0, r1, r2, r3, r4, r5, r8, r9, ip, sp}^
     b18:	0402005b 	streq	r0, [r2], #-91	; 0xffffffa5
     b1c:	063c0601 	ldrteq	r0, [ip], -r1, lsl #12
     b20:	59504b42 	ldmdbpl	r0, {r1, r6, r8, r9, fp, lr}^
     b24:	01040200 	mrseq	r0, R12_usr
     b28:	03063c06 	movweq	r3, #27654	; 0x6c06
     b2c:	526d3c09 	rsbpl	r3, sp, #2304	; 0x900
     b30:	04020059 	streq	r0, [r2], #-89	; 0xffffffa7
     b34:	003c0601 	eorseq	r0, ip, r1, lsl #12
     b38:	3c020402 	cfstrscc	mvf0, [r2], {2}
     b3c:	686e3f06 	stmdavs	lr!, {r1, r2, r8, r9, sl, fp, ip, sp}^
     b40:	02005952 	andeq	r5, r0, #1343488	; 0x148000
     b44:	3c060104 	stfccs	f0, [r6], {4}
     b48:	02040200 	andeq	r0, r4, #0, 4
     b4c:	6d3f063c 	ldcvs	6, cr0, [pc, #-240]!	; a64 <_Min_Stack_Size+0x664>
     b50:	02234e68 	eoreq	r4, r3, #104, 28	; 0x680
     b54:	0101000a 	tsteq	r1, sl
     b58:	38020500 	stmdacc	r2, {r8, sl}
     b5c:	0308000e 	movweq	r0, #32782	; 0x800e
     b60:	400107e3 	andmi	r0, r1, r3, ror #15
     b64:	0200595c 	andeq	r5, r0, #92, 18	; 0x170000
     b68:	3c060104 	stfccs	f0, [r6], {4}
     b6c:	4e694106 	powmie	f4, f1, f6
     b70:	04020059 	streq	r0, [r2], #-89	; 0xffffffa7
     b74:	063c0601 	ldrteq	r0, [ip], -r1, lsl #12
     b78:	59506941 	ldmdbpl	r0, {r0, r6, r8, fp, sp, lr}^
     b7c:	01040200 	mrseq	r0, R12_usr
     b80:	41063c06 	tstmi	r6, r6, lsl #24
     b84:	00594e69 	subseq	r4, r9, r9, ror #28
     b88:	06010402 	streq	r0, [r1], -r2, lsl #8
     b8c:	6941063c 	stmdbvs	r1, {r2, r3, r4, r5, r9, sl}^
     b90:	0200594e 	andeq	r5, r0, #1277952	; 0x138000
     b94:	3c060104 	stfccs	f0, [r6], {4}
     b98:	4c694106 	stfmie	f4, [r9], #-24	; 0xffffffe8
     b9c:	01000b02 	tsteq	r0, r2, lsl #22
     ba0:	0001ff01 	andeq	pc, r1, r1, lsl #30
     ba4:	a2000200 	andge	r0, r0, #0, 4
     ba8:	02000000 	andeq	r0, r0, #0
     bac:	0d0efb01 	vstreq	d15, [lr, #-4]
     bb0:	01010100 	mrseq	r0, (UNDEF: 17)
     bb4:	00000001 	andeq	r0, r0, r1
     bb8:	01000001 	tsteq	r0, r1
     bbc:	4d2f2e2e 	stcmi	14, cr2, [pc, #-184]!	; b0c <_Min_Stack_Size+0x70c>
     bc0:	004c4143 	subeq	r4, ip, r3, asr #2
     bc4:	4d2f2e2e 	stcmi	14, cr2, [pc, #-184]!	; b14 <_Min_Stack_Size+0x714>
     bc8:	2f4c4143 	svccs	0x004c4143
     bcc:	2f636e49 	svccs	0x00636e49
     bd0:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
     bd4:	65532f2e 	ldrbvs	r2, [r3, #-3886]	; 0xfffff0d2
     bd8:	63697672 	cmnvs	r9, #119537664	; 0x7200000
     bdc:	2e007365 	cdpcs	3, 0, cr7, cr0, cr5, {3}
     be0:	434d2f2e 	movtmi	r2, #57134	; 0xdf2e
     be4:	492f4c41 	stmdbmi	pc!, {r0, r6, sl, fp, lr}	; <UNPREDICTABLE>
     be8:	2e00636e 	cdpcs	3, 0, cr6, cr0, cr14, {3}
     bec:	434d2f2e 	movtmi	r2, #57134	; 0xdf2e
     bf0:	2e2f4c41 	cdpcs	12, 2, cr4, cr15, cr1, {2}
     bf4:	65532f2e 	ldrbvs	r2, [r3, #-3886]	; 0xfffff0d2
     bf8:	63697672 	cmnvs	r9, #119537664	; 0x7200000
     bfc:	00007365 	andeq	r7, r0, r5, ror #6
     c00:	2e495053 	mcrcs	0, 2, r5, cr9, cr3, {2}
     c04:	00010063 	andeq	r0, r1, r3, rrx
     c08:	616c5000 	cmnvs	ip, r0
     c0c:	726f6674 	rsbvc	r6, pc, #116, 12	; 0x7400000
     c10:	79545f6d 	ldmdbvc	r4, {r0, r2, r3, r5, r6, r8, r9, sl, fp, ip, lr}^
     c14:	2e736570 	mrccs	5, 3, r6, cr3, cr0, {3}
     c18:	00020068 	andeq	r0, r2, r8, rrx
     c1c:	6d747300 	ldclvs	3, cr7, [r4, #-0]
     c20:	31663233 	cmncc	r6, r3, lsr r2
     c24:	36633330 			; <UNDEFINED> instruction: 0x36633330
     c28:	0200682e 	andeq	r6, r0, #3014656	; 0x2e0000
     c2c:	50470000 	subpl	r0, r7, r0
     c30:	682e4f49 	stmdavs	lr!, {r0, r3, r6, r8, r9, sl, fp, lr}
     c34:	00000300 	andeq	r0, r0, r0, lsl #6
     c38:	2e495053 	mcrcs	0, 2, r5, cr9, cr3, {2}
     c3c:	00030068 	andeq	r0, r3, r8, rrx
     c40:	69745500 	ldmdbvs	r4!, {r8, sl, ip, lr}^
     c44:	682e736c 	stmdavs	lr!, {r2, r3, r5, r6, r8, r9, ip, sp, lr}
     c48:	00000400 	andeq	r0, r0, r0, lsl #8
     c4c:	02050000 	andeq	r0, r5, #0
     c50:	00000000 	andeq	r0, r0, r0
     c54:	4d012503 	cfstr32mi	mvfx2, [r1, #-12]
     c58:	7659332f 	ldrbvc	r3, [r9], -pc, lsr #6
     c5c:	5dcd5f6b 	stclpl	15, cr5, [sp, #428]	; 0x1ac
     c60:	005a955d 	subseq	r9, sl, sp, asr r5
     c64:	06010402 	streq	r0, [r1], -r2, lsl #8
     c68:	684b064a 	stmdavs	fp, {r1, r3, r6, r9, sl}^
     c6c:	5a5b4d5d 	bpl	16d41e8 <_Min_Stack_Size+0x16d3de8>
     c70:	6d4b784b 	stclvs	8, cr7, [fp, #-300]	; 0xfffffed4
     c74:	0e02504b 	cdpeq	0, 0, cr5, cr2, cr11, {2}
     c78:	00010100 	andeq	r0, r1, r0, lsl #2
     c7c:	00000205 	andeq	r0, r0, r5, lsl #4
     c80:	86030000 	strhi	r0, [r3], -r0
     c84:	5b4d0101 	blpl	1341090 <_Min_Stack_Size+0x1340c90>
     c88:	03696967 	cmneq	r9, #1687552	; 0x19c000
     c8c:	77033c10 	smladvc	r3, r0, ip, r3
     c90:	69696720 	stmdbvs	r9!, {r5, r8, r9, sl, sp, lr}^
     c94:	000e023e 	andeq	r0, lr, lr, lsr r2
     c98:	05000101 	streq	r0, [r0, #-257]	; 0xfffffeff
     c9c:	00000002 	andeq	r0, r0, r2
     ca0:	01b20300 			; <UNDEFINED> instruction: 0x01b20300
     ca4:	2f5b5001 	svccs	0x005b5001
     ca8:	2f312f31 	svccs	0x00312f31
     cac:	2f412f31 	svccs	0x00412f31
     cb0:	2f3f2f3f 	svccs	0x003f2f3f
     cb4:	4c432f3f 	mcrrmi	15, 3, r2, r3, cr15
     cb8:	2f4c3e2f 	svccs	0x004c3e2f
     cbc:	5f4c5f30 	svcpl	0x004c5f30
     cc0:	006b3d3d 	rsbeq	r3, fp, sp, lsr sp
     cc4:	06010402 	streq	r0, [r1], -r2, lsl #8
     cc8:	51590658 	cmppl	r9, r8, asr r6
     ccc:	09033d3d 	stmdbeq	r3, {r0, r2, r3, r4, r5, r8, sl, fp, ip, sp}
     cd0:	02004c58 	andeq	r4, r0, #88, 24	; 0x5800
     cd4:	58060104 	stmdapl	r6, {r2, r8}
     cd8:	2f515906 	svccs	0x00515906
     cdc:	2f5f6b2f 	svccs	0x005f6b2f
     ce0:	4c4c602f 	mcrrmi	0, 2, r6, ip, cr15
     ce4:	12032f2f 	andne	r2, r3, #47, 30	; 0xbc
     ce8:	20700358 	rsbscs	r0, r0, r8, asr r3
     cec:	032f2f4c 			; <UNDEFINED> instruction: 0x032f2f4c
     cf0:	7903580c 	stmdbvc	r3, {r2, r3, fp, ip, lr}
     cf4:	2f2f4c20 	svccs	0x002f4c20
     cf8:	000b025b 	andeq	r0, fp, fp, asr r2
     cfc:	05000101 	streq	r0, [r0, #-257]	; 0xfffffeff
     d00:	00000002 	andeq	r0, r0, r2
     d04:	02e30300 	rsceq	r0, r3, #0, 6
     d08:	003e7701 	eorseq	r7, lr, r1, lsl #14
     d0c:	06010402 	streq	r0, [r1], -r2, lsl #8
     d10:	5a770620 	bpl	1dc2598 <_Min_Stack_Size+0x1dc2198>
     d14:	01040200 	mrseq	r0, R12_usr
     d18:	76062006 	strvc	r2, [r6], -r6
     d1c:	01000502 	tsteq	r0, r2, lsl #10
     d20:	02050001 	andeq	r0, r5, #1
     d24:	00000000 	andeq	r0, r0, r0
     d28:	01038303 	tsteq	r3, r3, lsl #6
     d2c:	02003e77 	andeq	r3, r0, #1904	; 0x770
     d30:	20060104 	andcs	r0, r6, r4, lsl #2
     d34:	02687706 	rsbeq	r7, r8, #1572864	; 0x180000
     d38:	01010005 	tsteq	r1, r5
     d3c:	00020500 	andeq	r0, r2, r0, lsl #10
     d40:	03000000 	movweq	r0, #0
     d44:	7701039c 			; <UNDEFINED> instruction: 0x7701039c
     d48:	04026868 	streq	r6, [r2], #-2152	; 0xfffff798
     d4c:	00010100 	andeq	r0, r1, r0, lsl #2
     d50:	00000205 	andeq	r0, r0, r5, lsl #4
     d54:	b5030000 	strlt	r0, [r3, #-0]
     d58:	305a0103 	subscc	r0, sl, r3, lsl #2
     d5c:	38756722 	ldmdacc	r5!, {r1, r5, r8, r9, sl, sp, lr}^
     d60:	0302226c 	movweq	r2, #8812	; 0x226c
     d64:	00010100 	andeq	r0, r1, r0, lsl #2
     d68:	00000205 	andeq	r0, r0, r5, lsl #4
     d6c:	d3030000 	movwle	r0, #12288	; 0x3000
     d70:	305a0103 	subscc	r0, sl, r3, lsl #2
     d74:	75672275 	strbvc	r2, [r7, #-629]!	; 0xfffffd8b
     d78:	025a4238 	subseq	r4, sl, #56, 4	; 0x80000003
     d7c:	01010004 	tsteq	r1, r4
     d80:	30020500 	andcc	r0, r2, r0, lsl #10
     d84:	0308000f 	movweq	r0, #32783	; 0x800f
     d88:	300103e7 	andcc	r0, r1, r7, ror #7
     d8c:	0005023d 	andeq	r0, r5, sp, lsr r2
     d90:	05000101 	streq	r0, [r0, #-257]	; 0xfffffeff
     d94:	000f4402 	andeq	r4, pc, r2, lsl #8
     d98:	03ed0308 	mvneq	r0, #8, 6	; 0x20000000
     d9c:	023d3001 	eorseq	r3, sp, #1
     da0:	01010005 	tsteq	r1, r5
     da4:	000001f5 	strdeq	r0, [r0], -r5
     da8:	00af0002 	adceq	r0, pc, r2
     dac:	01020000 	mrseq	r0, (UNDEF: 2)
     db0:	000d0efb 	strdeq	r0, [sp], -fp
     db4:	01010101 	tsteq	r1, r1, lsl #2
     db8:	01000000 	mrseq	r0, (UNDEF: 0)
     dbc:	2e010000 	cdpcs	0, 0, cr0, cr1, cr0, {0}
     dc0:	434d2f2e 	movtmi	r2, #57134	; 0xdf2e
     dc4:	2e004c41 	cdpcs	12, 0, cr4, cr0, cr1, {2}
     dc8:	434d2f2e 	movtmi	r2, #57134	; 0xdf2e
     dcc:	492f4c41 	stmdbmi	pc!, {r0, r6, sl, fp, lr}	; <UNPREDICTABLE>
     dd0:	2e2f636e 	cdpcs	3, 2, cr6, cr15, cr14, {3}
     dd4:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
     dd8:	7265532f 	rsbvc	r5, r5, #-1140850688	; 0xbc000000
     ddc:	65636976 	strbvs	r6, [r3, #-2422]!	; 0xfffff68a
     de0:	2e2e0073 	mcrcs	0, 1, r0, cr14, cr3, {3}
     de4:	41434d2f 	cmpmi	r3, pc, lsr #26
     de8:	6e492f4c 	cdpvs	15, 4, cr2, cr9, cr12, {2}
     dec:	2e2e0063 	cdpcs	0, 2, cr0, cr14, cr3, {3}
     df0:	41434d2f 	cmpmi	r3, pc, lsr #26
     df4:	2e2e2f4c 	cdpcs	15, 2, cr2, cr14, cr12, {2}
     df8:	7265532f 	rsbvc	r5, r5, #-1140850688	; 0xbc000000
     dfc:	65636976 	strbvs	r6, [r3, #-2422]!	; 0xfffff68a
     e00:	55000073 	strpl	r0, [r0, #-115]	; 0xffffff8d
     e04:	54524153 	ldrbpl	r4, [r2], #-339	; 0xfffffead
     e08:	0100632e 	tsteq	r0, lr, lsr #6
     e0c:	6c500000 	mravs	r0, r0, acc0
     e10:	6f667461 	svcvs	0x00667461
     e14:	545f6d72 	ldrbpl	r6, [pc], #-3442	; e1c <_Min_Stack_Size+0xa1c>
     e18:	73657079 	cmnvc	r5, #121	; 0x79
     e1c:	0200682e 	andeq	r6, r0, #3014656	; 0x2e0000
     e20:	74730000 	ldrbtvc	r0, [r3], #-0
     e24:	6632336d 	ldrtvs	r3, [r2], -sp, ror #6
     e28:	63333031 	teqvs	r3, #49	; 0x31
     e2c:	00682e36 	rsbeq	r2, r8, r6, lsr lr
     e30:	47000002 	strmi	r0, [r0, -r2]
     e34:	2e4f4950 			; <UNDEFINED> instruction: 0x2e4f4950
     e38:	00030068 	andeq	r0, r3, r8, rrx
     e3c:	41535500 	cmpmi	r3, r0, lsl #10
     e40:	682e5452 	stmdavs	lr!, {r1, r4, r6, sl, ip, lr}
     e44:	00000300 	andeq	r0, r0, r0, lsl #6
     e48:	6c697455 	cfstrdvs	mvd7, [r9], #-340	; 0xfffffeac
     e4c:	00682e73 	rsbeq	r2, r8, r3, ror lr
     e50:	52000004 	andpl	r0, r0, #4
     e54:	682e4343 	stmdavs	lr!, {r0, r1, r6, r8, r9, lr}
     e58:	00000300 	andeq	r0, r0, r0, lsl #6
     e5c:	02050000 	andeq	r0, r5, #0
     e60:	00000000 	andeq	r0, r0, r0
     e64:	50012503 	andpl	r2, r1, r3, lsl #10
     e68:	5a4c675a 	bpl	131abd8 <_Min_Stack_Size+0x131a7d8>
     e6c:	42674e67 	rsbmi	r4, r7, #1648	; 0x670
     e70:	83959587 	orrshi	r9, r5, #566231040	; 0x21c00000
     e74:	4b76d75a 	blmi	1db6be4 <_Min_Stack_Size+0x1db67e4>
     e78:	9695b14c 	ldrls	fp, [r5], ip, asr #2
     e7c:	5a934d95 	bpl	fe4d44d8 <_estack+0xde4cf4d8>
     e80:	660e034b 	strvs	r0, [lr], -fp, asr #6
     e84:	5a207403 	bpl	81de98 <_Min_Stack_Size+0x81da98>
     e88:	6609034b 	strvs	r0, [r9], -fp, asr #6
     e8c:	026a4b1b 	rsbeq	r4, sl, #27648	; 0x6c00
     e90:	01010010 	tsteq	r1, r0, lsl r0
     e94:	00020500 	andeq	r0, r2, r0, lsl #10
     e98:	03000000 	movweq	r0, #0
     e9c:	4d010191 	stfmis	f0, [r1, #-580]	; 0xfffffdbc
     ea0:	6868675a 	stmdavs	r8!, {r1, r3, r4, r6, r8, r9, sl, sp, lr}^
     ea4:	033c1903 	teqeq	ip, #49152	; 0xc000
     ea8:	675b206a 	ldrbvs	r2, [fp, -sl, rrx]
     eac:	0e036868 	cdpeq	8, 0, cr6, cr3, cr8, {3}
     eb0:	2078033c 	rsbscs	r0, r8, ip, lsr r3
     eb4:	3f686867 	svccc	0x00686867
     eb8:	01000f02 	tsteq	r0, r2, lsl #30
     ebc:	02050001 	andeq	r0, r5, #1
     ec0:	00000000 	andeq	r0, r0, r0
     ec4:	0101c303 	tsteq	r1, r3, lsl #6
     ec8:	75695b4d 	strbvc	r5, [r9, #-2893]!	; 0xfffff4b3
     ecc:	5c75685c 	ldclpl	8, cr6, [r5], #-368	; 0xfffffe90
     ed0:	765c7568 	ldrbvc	r7, [ip], -r8, ror #10
     ed4:	00ca0375 	sbceq	r0, sl, r5, ror r3
     ed8:	7fbb0358 	svcvc	0x00bb0358
     edc:	75695c20 	strbvc	r5, [r9, #-3104]!	; 0xfffff3e0
     ee0:	5c75685c 	ldclpl	8, cr6, [r5], #-368	; 0xfffffe90
     ee4:	685c7568 	ldmdavs	ip, {r3, r5, r6, r8, sl, ip, sp, lr}^
     ee8:	58280375 	stmdapl	r8!, {r0, r2, r4, r5, r6, r8, r9}
     eec:	69206203 	stmdbvs	r0!, {r0, r1, r9, sp, lr}
     ef0:	75685c75 	strbvc	r5, [r8, #-3189]!	; 0xfffff38b
     ef4:	5c75685c 	ldclpl	8, cr6, [r5], #-368	; 0xfffffe90
     ef8:	025d7568 	subseq	r7, sp, #104, 10	; 0x1a000000
     efc:	01010021 	tsteq	r1, r1, lsr #32
     f00:	00020500 	andeq	r0, r2, r0, lsl #10
     f04:	03000000 	movweq	r0, #0
     f08:	770102c0 	strvc	r0, [r1, -r0, asr #5]
     f0c:	0402003e 	streq	r0, [r2], #-62	; 0xffffffc2
     f10:	06200601 	strteq	r0, [r0], -r1, lsl #12
     f14:	5a740c03 	bpl	1d03f28 <_Min_Stack_Size+0x1d03b28>
     f18:	02771d89 	rsbseq	r1, r7, #8768	; 0x2240
     f1c:	01010005 	tsteq	r1, r5
     f20:	00020500 	andeq	r0, r2, r0, lsl #10
     f24:	03000000 	movweq	r0, #0
     f28:	770102ee 	strvc	r0, [r1, -lr, ror #5]
     f2c:	0402003e 	streq	r0, [r2], #-62	; 0xffffffc2
     f30:	06200601 	strteq	r0, [r0], -r1, lsl #12
     f34:	5a740c03 	bpl	1d03f48 <_Min_Stack_Size+0x1d03b48>
     f38:	9014034c 	andsls	r0, r4, ip, asr #6
     f3c:	03207003 			; <UNDEFINED> instruction: 0x03207003
     f40:	76038210 			; <UNDEFINED> instruction: 0x76038210
     f44:	1c8a4c20 	stcne	12, cr4, [sl], {32}
     f48:	00050294 	muleq	r5, r4, r2
     f4c:	05000101 	streq	r0, [r0, #-257]	; 0xfffffeff
     f50:	00000002 	andeq	r0, r0, r2
     f54:	03a60300 			; <UNDEFINED> instruction: 0x03a60300
     f58:	02004d01 	andeq	r4, r0, #1, 26	; 0x40
     f5c:	20060104 	andcs	r0, r6, r4, lsl #2
     f60:	05027506 	streq	r7, [r2, #-1286]	; 0xfffffafa
