mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
     f64:	00010100 	andeq	r0, r1, r0, lsl #2
     f68:	0f580205 	svceq	0x00580205
     f6c:	b2030800 	andlt	r0, r3, #0, 16
     f70:	3d300103 	ldfccs	f0, [r0, #-12]!
     f74:	01000502 	tsteq	r0, r2, lsl #10
     f78:	02050001 	andeq	r0, r5, #1
     f7c:	08000f6c 	stmdaeq	r0, {r2, r3, r5, r6, r8, r9, sl, fp}
     f80:	0103b803 	tsteq	r3, r3, lsl #16
     f84:	05023d30 	streq	r3, [r2, #-3376]	; 0xfffff2d0
     f88:	00010100 	andeq	r0, r1, r0, lsl #2
     f8c:	0f800205 	svceq	0x00800205
     f90:	be030800 	cdplt	8, 0, cr0, cr3, cr0, {0}
     f94:	3d300103 	ldfccs	f0, [r0, #-12]!
     f98:	01000502 	tsteq	r0, r2, lsl #10
     f9c:	0001fc01 	andeq	pc, r1, r1, lsl #24
     fa0:	c8000200 	stmdagt	r0, {r9}
     fa4:	02000001 	andeq	r0, r0, #1
     fa8:	0d0efb01 	vstreq	d15, [lr, #-4]
     fac:	01010100 	mrseq	r0, (UNDEF: 17)
     fb0:	00000001 	andeq	r0, r0, r1
     fb4:	01000001 	tsteq	r0, r1
     fb8:	532f2e2e 			; <UNDEFINED> instruction: 0x532f2e2e
     fbc:	2e006372 	mcrcs	3, 0, r6, cr0, cr2, {3}
     fc0:	72532f2e 	subsvc	r2, r3, #46, 30	; 0xb8
     fc4:	2e2e2f63 	cdpcs	15, 2, cr2, cr14, cr3, {3}
     fc8:	7265532f 	rsbvc	r5, r5, #-1140850688	; 0xbc000000
     fcc:	65636976 	strbvs	r6, [r3, #-2422]!	; 0xfffff68a
     fd0:	2e2e0073 	mcrcs	0, 1, r0, cr14, cr3, {3}
     fd4:	6372532f 	cmnvs	r2, #-1140850688	; 0xbc000000
     fd8:	2f2e2e2f 	svccs	0x002e2e2f
     fdc:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
     fe0:	636e492f 	cmnvs	lr, #770048	; 0xbc000
     fe4:	2f2e2e00 	svccs	0x002e2e00
     fe8:	2f637253 	svccs	0x00637253
     fec:	4d2f2e2e 	stcmi	14, cr2, [pc, #-184]!	; f3c <_Min_Stack_Size+0xb3c>
     ff0:	2f4c4143 	svccs	0x004c4143
     ff4:	2f636e49 	svccs	0x00636e49
     ff8:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
     ffc:	65532f2e 	ldrbvs	r2, [r3, #-3886]	; 0xfffff0d2
    1000:	63697672 	cmnvs	r9, #119537664	; 0x7200000
    1004:	2e007365 	cdpcs	3, 0, cr7, cr0, cr5, {3}
    1008:	72532f2e 	subsvc	r2, r3, #46, 30	; 0xb8
    100c:	2e2e2f63 	cdpcs	15, 2, cr2, cr14, cr3, {3}
    1010:	4c41482f 	mcrrmi	8, 2, r4, r1, cr15
    1014:	636e492f 	cmnvs	lr, #770048	; 0xbc000
    1018:	2f2e2e00 	svccs	0x002e2e00
    101c:	2f637253 	svccs	0x00637253
    1020:	482f2e2e 	stmdami	pc!, {r1, r2, r3, r5, r9, sl, fp, sp}	; <UNPREDICTABLE>
    1024:	492f4c41 	stmdbmi	pc!, {r0, r6, sl, fp, lr}	; <UNPREDICTABLE>
    1028:	2e2f636e 	cdpcs	3, 2, cr6, cr15, cr14, {3}
    102c:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
    1030:	7265532f 	rsbvc	r5, r5, #-1140850688	; 0xbc000000
    1034:	65636976 	strbvs	r6, [r3, #-2422]!	; 0xfffff68a
    1038:	2e2e0073 	mcrcs	0, 1, r0, cr14, cr3, {3}
    103c:	6372532f 	cmnvs	r2, #-1140850688	; 0xbc000000
    1040:	2f2e2e2f 	svccs	0x002e2e2f
    1044:	2f4c4148 	svccs	0x004c4148
    1048:	2f636e49 	svccs	0x00636e49
    104c:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
    1050:	434d2f2e 	movtmi	r2, #57134	; 0xdf2e
    1054:	492f4c41 	stmdbmi	pc!, {r0, r6, sl, fp, lr}	; <UNPREDICTABLE>
    1058:	0000636e 	andeq	r6, r0, lr, ror #6
    105c:	6e69616d 	powvsez	f6, f1, #5.0
    1060:	0100632e 	tsteq	r0, lr, lsr #6
    1064:	6c500000 	mravs	r0, r0, acc0
    1068:	6f667461 	svcvs	0x00667461
    106c:	545f6d72 	ldrbpl	r6, [pc], #-3442	; 1074 <_Min_Stack_Size+0xc74>
    1070:	73657079 	cmnvc	r5, #121	; 0x79
    1074:	0200682e 	andeq	r6, r0, #3014656	; 0x2e0000
    1078:	74730000 	ldrbtvc	r0, [r3], #-0
    107c:	6632336d 	ldrtvs	r3, [r2], -sp, ror #6
    1080:	63333031 	teqvs	r3, #49	; 0x31
    1084:	00682e36 	rsbeq	r2, r8, r6, lsr lr
    1088:	47000002 	strmi	r0, [r0, -r2]
    108c:	2e4f4950 			; <UNDEFINED> instruction: 0x2e4f4950
    1090:	00030068 	andeq	r0, r3, r8, rrx
    1094:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    1098:	00682e49 	rsbeq	r2, r8, r9, asr #28
    109c:	55000003 	strpl	r0, [r0, #-3]
    10a0:	736c6974 	cmnvc	ip, #116, 18	; 0x1d0000
    10a4:	0200682e 	andeq	r6, r0, #3014656	; 0x2e0000
    10a8:	6c500000 	mravs	r0, r0, acc0
    10ac:	6f667461 	svcvs	0x00667461
    10b0:	545f6d72 	ldrbpl	r6, [pc], #-3442	; 10b8 <_Min_Stack_Size+0xcb8>
    10b4:	73657079 	cmnvc	r5, #121	; 0x79
    10b8:	0400682e 	streq	r6, [r0], #-2094	; 0xfffff7d2
    10bc:	74730000 	ldrbtvc	r0, [r3], #-0
    10c0:	6632336d 	ldrtvs	r3, [r2], -sp, ror #6
    10c4:	63333031 	teqvs	r3, #49	; 0x31
    10c8:	00682e36 	rsbeq	r2, r8, r6, lsr lr
    10cc:	55000004 	strpl	r0, [r0, #-4]
    10d0:	54524153 	ldrbpl	r4, [r2], #-339	; 0xfffffead
    10d4:	0300682e 	movweq	r6, #2094	; 0x82e
    10d8:	43520000 	cmpmi	r2, #0
    10dc:	00682e43 	rsbeq	r2, r8, r3, asr #28
    10e0:	53000003 	movwpl	r0, #3
    10e4:	682e4950 	stmdavs	lr!, {r4, r6, r8, fp, lr}
    10e8:	00000300 	andeq	r0, r0, r0, lsl #6
    10ec:	2e433249 	cdpcs	2, 4, cr3, cr3, cr9, {2}
    10f0:	00030068 	andeq	r0, r3, r8, rrx
    10f4:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    10f8:	00682e4d 	rsbeq	r2, r8, sp, asr #28
    10fc:	4c000003 	stcmi	0, cr0, [r0], {3}
    1100:	682e4443 	stmdavs	lr!, {r0, r1, r6, sl, lr}
    1104:	00000500 	andeq	r0, r0, r0, lsl #10
    1108:	74616c50 	strbtvc	r6, [r1], #-3152	; 0xfffff3b0
    110c:	6d726f66 	ldclvs	15, cr6, [r2, #-408]!	; 0xfffffe68
    1110:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    1114:	682e7365 	stmdavs	lr!, {r0, r2, r5, r6, r8, r9, ip, sp, lr}
    1118:	00000600 	andeq	r0, r0, r0, lsl #12
    111c:	4f495047 	svcmi	0x00495047
    1120:	0700682e 	streq	r6, [r0, -lr, lsr #16]
    1124:	656b0000 	strbvs	r0, [fp, #-0]!
    1128:	64617079 	strbtvs	r7, [r1], #-121	; 0xffffff87
    112c:	0500682e 	streq	r6, [r0, #-2094]	; 0xfffff7d2
    1130:	45450000 	strbmi	r0, [r5, #-0]
    1134:	4d4f5250 	sfmmi	f5, 2, [pc, #-320]	; ffc <_Min_Stack_Size+0xbfc>
    1138:	0500682e 	streq	r6, [r0, #-2094]	; 0xfffff7d2
    113c:	32490000 	subcc	r0, r9, #0
    1140:	00682e43 	rsbeq	r2, r8, r3, asr #28
    1144:	53000007 	movwpl	r0, #7
    1148:	6e657665 	cdpvs	6, 6, cr7, cr5, cr5, {3}
    114c:	6d676553 	cfstr64vs	mvdx6, [r7, #-332]!	; 0xfffffeb4
    1150:	2e746e65 	cdpcs	14, 7, cr6, cr4, cr5, {3}
    1154:	00050068 	andeq	r0, r5, r8, rrx
    1158:	72655300 	rsbvc	r5, r5, #0, 6
    115c:	682e6f76 	stmdavs	lr!, {r1, r2, r4, r5, r6, r8, r9, sl, fp, sp, lr}
    1160:	00000500 	andeq	r0, r0, r0, lsl #10
    1164:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    1168:	0700682e 	streq	r6, [r0, -lr, lsr #16]
    116c:	00000000 	andeq	r0, r0, r0
    1170:	0f940205 	svceq	0x00940205
    1174:	28030800 	stmdacs	r3, {fp}
    1178:	423f2f01 	eorsmi	r2, pc, #1, 30
    117c:	0902414f 	stmdbeq	r2, {r0, r1, r2, r3, r6, r8, lr}
    1180:	00010100 	andeq	r0, r1, r0, lsl #2
    1184:	0fc40205 	svceq	0x00c40205
    1188:	3f030800 	svccc	0x00030800
    118c:	ad2f3e01 	stcge	14, cr3, [pc, #-4]!	; 1190 <_Min_Stack_Size+0xd90>
    1190:	434d2f2f 	movtmi	r2, #57135	; 0xdf2f
    1194:	3b4b444f 	blcc	12d22d8 <_Min_Stack_Size+0x12d1ed8>
    1198:	01000902 	tsteq	r0, r2, lsl #18
    119c:	00008001 	andeq	r8, r0, r1
    11a0:	39000200 	stmdbcc	r0, {r9}
    11a4:	02000000 	andeq	r0, r0, #0
    11a8:	0d0efb01 	vstreq	d15, [lr, #-4]
    11ac:	01010100 	mrseq	r0, (UNDEF: 17)
    11b0:	00000001 	andeq	r0, r0, r1
    11b4:	01000001 	tsteq	r0, r1
    11b8:	532f2e2e 			; <UNDEFINED> instruction: 0x532f2e2e
    11bc:	74726174 	ldrbtvc	r6, [r2], #-372	; 0xfffffe8c
    11c0:	00007075 	andeq	r7, r0, r5, ror r0
    11c4:	72617473 	rsbvc	r7, r1, #1929379840	; 0x73000000
    11c8:	5f707574 	svcpl	0x00707574
    11cc:	336d7473 	cmncc	sp, #1929379840	; 0x73000000
    11d0:	30316632 	eorscc	r6, r1, r2, lsr r6
    11d4:	74386333 	ldrtvc	r6, [r8], #-819	; 0xfffffccd
    11d8:	00732e78 	rsbseq	r2, r3, r8, ror lr
    11dc:	00000001 	andeq	r0, r0, r1
    11e0:	28020500 	stmdacs	r2, {r8, sl}
    11e4:	03080010 	movweq	r0, #32784	; 0x8010
    11e8:	2221013a 	eorcs	r0, r1, #-2147483634	; 0x8000000e
    11ec:	21212131 			; <UNDEFINED> instruction: 0x21212131
    11f0:	21212321 			; <UNDEFINED> instruction: 0x21212321
    11f4:	23212123 			; <UNDEFINED> instruction: 0x23212123
    11f8:	23212121 			; <UNDEFINED> instruction: 0x23212121
    11fc:	23212321 			; <UNDEFINED> instruction: 0x23212321
    1200:	56033130 			; <UNDEFINED> instruction: 0x56033130
    1204:	2f2f3420 	svccs	0x002f3420
    1208:	2f2e0f03 	svccs	0x002e0f03
    120c:	01000202 	tsteq	r0, r2, lsl #4
    1210:	02050001 	andeq	r0, r5, #1
    1214:	08001078 	stmdaeq	r0, {r3, r4, r5, r6, ip}
    1218:	0100f303 	tsteq	r0, r3, lsl #6	; <UNPREDICTABLE>
    121c:	01000102 	tsteq	r0, r2, lsl #2
    1220:	Address 0x0000000000001220 is out of bounds.


Disassembly of section .debug_str:

