mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
00000000 <.debug_str>:
       0:	45445f5f 	strbmi	r5, [r4, #-3935]	; 0xfffff0a1
       4:	414d4943 	cmpmi	sp, r3, asr #18
       8:	49445f4c 	stmdbmi	r4, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
       c:	205f5f47 	subscs	r5, pc, r7, asr #30
      10:	5f003731 	svcpl	0x00003731
      14:	4148555f 	cmpmi	r8, pc, asr r5
      18:	4942465f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
      1c:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
      20:	5f5f0038 	svcpl	0x005f0038
      24:	31434544 	cmpcc	r3, r4, asr #10
      28:	455f3832 	ldrbmi	r3, [pc, #-2098]	; fffff7fe <_estack+0xdfffa7fe>
      2c:	4c495350 	mcrrmi	3, 5, r5, r9, cr0
      30:	5f5f4e4f 	svcpl	0x005f4e4f
      34:	2d453120 	stfcse	f3, [r5, #-128]	; 0xffffff80
      38:	4c443333 	mcrrmi	3, 3, r3, r4, cr3
      3c:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
      40:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
      44:	4f43434e 	svcmi	0x0043434e
      48:	4749464e 	strbmi	r4, [r9, -lr, asr #12]
      4c:	4c4e555f 	cfstr64mi	mvdx5, [lr], {95}	; 0x5f
      50:	454b434f 	strbmi	r4, [fp, #-847]	; 0xfffffcb1
      54:	00302044 	eorseq	r2, r0, r4, asr #32
      58:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
      5c:	5f343654 	svcpl	0x00343654
      60:	4f4e4544 	svcmi	0x004e4544
      64:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	; ffffff24 <_estack+0xdfffaf24>
      68:	5f5f4e49 	svcpl	0x005f4e49
      6c:	392e3420 	stmdbcc	lr!, {r5, sl, ip, sp}
      70:	35363034 	ldrcc	r3, [r6, #-52]!	; 0xffffffcc
      74:	38353436 	ldmdacc	r5!, {r1, r2, r4, r5, sl, ip, sp}
      78:	34323134 	ldrtcc	r3, [r2], #-308	; 0xfffffecc
      7c:	65343536 	ldrvs	r3, [r4, #-1334]!	; 0xfffffaca
      80:	3432332d 	ldrtcc	r3, [r2], #-813	; 0xfffffcd3
      84:	00343646 	eorseq	r3, r4, r6, asr #12
      88:	6e697576 	mcrvs	5, 3, r7, cr9, cr6, {3}
      8c:	5f323374 	svcpl	0x00323374
      90:	564e0074 			; <UNDEFINED> instruction: 0x564e0074
      94:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
      98:	30345152 	eorscc	r5, r4, r2, asr r1
      9c:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
      a0:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
      a4:	5f434956 	svcpl	0x00434956
      a8:	52455349 	subpl	r5, r5, #603979777	; 0x24000001
      ac:	3d7c2031 	ldclcc	0, cr2, [ip, #-196]!	; 0xffffff3c
      b0:	3c312820 	ldccc	8, cr2, [r1], #-128	; 0xffffff80
      b4:	2929383c 	stmdbcs	r9!, {r2, r3, r4, r5, fp, ip, sp}
      b8:	435f5f00 	cmpmi	pc, #0, 30
      bc:	5f524148 	svcpl	0x00524148
      c0:	49534e55 	ldmdbmi	r3, {r0, r2, r4, r6, r9, sl, fp, lr}^
      c4:	44454e47 	strbmi	r4, [r5], #-3655	; 0xfffff1b9
      c8:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
      cc:	455f5f00 	ldrbmi	r5, [pc, #-3840]	; fffff1d4 <_estack+0xdfffa1d4>
      d0:	5f5f464c 	svcpl	0x005f464c
      d4:	5f003120 	svcpl	0x00003120
      d8:	5246535f 	subpl	r5, r6, #2080374785	; 0x7c000001
      dc:	5f544341 	svcpl	0x00544341
      e0:	54494246 	strbpl	r4, [r9], #-582	; 0xfffffdba
      e4:	37205f5f 			; <UNDEFINED> instruction: 0x37205f5f
      e8:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
      ec:	4f4d5f4f 	svcmi	0x004d5f4f
      f0:	495f4544 	ldmdbmi	pc, {r2, r6, r8, sl, lr}^	; <UNPREDICTABLE>
      f4:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
      f8:	2044505f 	subcs	r5, r4, pc, asr r0
      fc:	58450033 	stmdapl	r5, {r0, r1, r4, r5}^
     100:	52434954 	subpl	r4, r3, #84, 18	; 0x150000
     104:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
     108:	3436544c 	ldrtcc	r5, [r6], #-1100	; 0xfffffbb4
     10c:	5341485f 	movtpl	r4, #6239	; 0x185f
     110:	464e495f 			; <UNDEFINED> instruction: 0x464e495f
     114:	54494e49 	strbpl	r4, [r9], #-3657	; 0xfffff1b7
     118:	205f5f59 	subscs	r5, pc, r9, asr pc	; <UNPREDICTABLE>
     11c:	5f5f0031 	svcpl	0x005f0031
     120:	43414c4c 	movtmi	r4, #7244	; 0x1c4c
     124:	5f4d5543 	svcpl	0x004d5543
     128:	5f4e494d 	svcpl	0x004e494d
     12c:	2d28205f 	stccs	0, cr2, [r8, #-380]!	; 0xfffffe84
     130:	50315830 	eorspl	r5, r1, r0, lsr r8
     134:	4c4c3133 	stfmie	f3, [ip], {51}	; 0x33
     138:	58302d4b 	ldmdapl	r0!, {r0, r1, r3, r6, r8, sl, fp, sp}
     13c:	31335031 	teqcc	r3, r1, lsr r0
     140:	294b4c4c 	stmdbcs	fp, {r2, r3, r6, sl, fp, lr}^
     144:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
     148:	754f5f4f 	strbvc	r5, [pc, #-3919]	; fffff201 <_estack+0xdfffa201>
     14c:	74757074 	ldrbtvc	r7, [r5], #-116	; 0xffffff8c
     150:	6570535f 	ldrbvs	r5, [r0, #-863]!	; 0xfffffca1
     154:	5f006465 	svcpl	0x00006465
     158:	43414c5f 	movtmi	r4, #7263	; 0x1c5f
     15c:	5f4d5543 	svcpl	0x004d5543
     160:	49535045 	ldmdbmi	r3, {r0, r2, r6, ip, lr}^
     164:	5f4e4f4c 	svcpl	0x004e4f4c
     168:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
     16c:	332d5031 			; <UNDEFINED> instruction: 0x332d5031
     170:	004b4c31 	subeq	r4, fp, r1, lsr ip
     174:	54505f5f 	ldrbpl	r5, [r0], #-3935	; 0xfffff0a1
     178:	46494452 			; <UNDEFINED> instruction: 0x46494452
     17c:	414d5f46 	cmpmi	sp, r6, asr #30
     180:	205f5f58 	subscs	r5, pc, r8, asr pc	; <UNPREDICTABLE>
     184:	66377830 			; <UNDEFINED> instruction: 0x66377830
     188:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     18c:	5f006666 	svcpl	0x00006666
     190:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
     194:	5f58414d 	svcpl	0x0058414d
     198:	29632843 	stmdbcs	r3!, {r0, r1, r6, fp, sp}^
     19c:	23206320 			; <UNDEFINED> instruction: 0x23206320
     1a0:	4c4c2023 	mcrrmi	0, 2, r2, ip, cr3
     1a4:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	; <UNPREDICTABLE>
     1a8:	414d544e 	cmpmi	sp, lr, asr #8
     1ac:	414d5f58 	cmpmi	sp, r8, asr pc
     1b0:	205f5f58 	subscs	r5, pc, r8, asr pc	; <UNPREDICTABLE>
     1b4:	66377830 			; <UNDEFINED> instruction: 0x66377830
     1b8:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     1bc:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     1c0:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     1c4:	4c4c6666 	mcrrmi	6, 6, r6, ip, cr6
     1c8:	445f5f00 	ldrbmi	r5, [pc], #-3840	; 1d0 <_Min_Heap_Size-0x30>
     1cc:	32334345 	eorscc	r4, r3, #335544321	; 0x14000001
     1d0:	4255535f 	subsmi	r5, r5, #2080374785	; 0x7c000001
     1d4:	4d524f4e 	ldclmi	15, cr4, [r2, #-312]	; 0xfffffec8
     1d8:	4d5f4c41 	ldclmi	12, cr4, [pc, #-260]	; dc <_Min_Heap_Size-0x124>
     1dc:	5f5f4e49 	svcpl	0x005f4e49
     1e0:	302e3020 	eorcc	r3, lr, r0, lsr #32
     1e4:	30303030 	eorscc	r3, r0, r0, lsr r0
     1e8:	392d4531 	pushcc	{r0, r4, r5, r8, sl, lr}
     1ec:	00464435 	subeq	r4, r6, r5, lsr r4
     1f0:	51545f5f 	cmppl	r4, pc, asr pc
     1f4:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
     1f8:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
     1fc:	5f5f0030 	svcpl	0x005f0030
     200:	36544c46 	ldrbcc	r4, [r4], -r6, asr #24
     204:	45445f34 	strbmi	r5, [r4, #-3892]	; 0xfffff0cc
     208:	414d4943 	cmpmi	sp, r3, asr #18
     20c:	49445f4c 	stmdbmi	r4, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
     210:	205f5f47 	subscs	r5, pc, r7, asr #30
     214:	47003731 	smladxmi	r0, r1, r7, r3
     218:	454f4950 	strbmi	r4, [pc, #-2384]	; fffff8d0 <_estack+0xdfffa8d0>
     21c:	47282820 	strmi	r2, [r8, -r0, lsr #16]!
     220:	5f4f4950 	svcpl	0x004f4950
     224:	65707954 	ldrbvs	r7, [r0, #-2388]!	; 0xfffff6ac
     228:	2a666564 	bcs	19997c0 <_Min_Stack_Size+0x19993c0>
     22c:	49504729 	ldmdbmi	r0, {r0, r3, r5, r8, r9, sl, lr}^
     230:	425f454f 	subsmi	r4, pc, #331350016	; 0x13c00000
     234:	29455341 	stmdbcs	r5, {r0, r6, r8, r9, ip, lr}^
     238:	415f5f00 	cmpmi	pc, r0, lsl #30
     23c:	494d4f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, lr}^
     240:	4f435f43 	svcmi	0x00435f43
     244:	4d55534e 	ldclmi	3, cr5, [r5, #-312]	; 0xfffffec8
     248:	00312045 	eorseq	r2, r1, r5, asr #32
     24c:	4c555f5f 	mrrcmi	15, 5, r5, r5, cr15	; <UNPREDICTABLE>
     250:	55434341 	strbpl	r4, [r3, #-833]	; 0xfffffcbf
     254:	42465f4d 	submi	r5, r6, #308	; 0x134
     258:	5f5f5449 	svcpl	0x005f5449
     25c:	00323320 	eorseq	r3, r2, r0, lsr #6
     260:	43575f5f 	cmpmi	r7, #380	; 0x17c
     264:	5f524148 	svcpl	0x00524148
     268:	5f58414d 	svcpl	0x0058414d
     26c:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
     270:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     274:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     278:	43520055 	cmpmi	r2, #85	; 0x55
     27c:	50475f43 	subpl	r5, r7, r3, asr #30
     280:	5f424f49 	svcpl	0x00424f49
     284:	5f4b4c43 	svcpl	0x004b4c43
     288:	29284e45 	stmdbcs	r8!, {r0, r2, r6, r9, sl, fp, lr}
     28c:	43522820 	cmpmi	r2, #32, 16	; 0x200000
     290:	413e2d43 	teqmi	lr, r3, asr #26
     294:	45324250 	ldrmi	r4, [r2, #-592]!	; 0xfffffdb0
     298:	7c20524e 	sfmvc	f5, 4, [r0], #-312	; 0xfffffec8
     29c:	3128203d 			; <UNDEFINED> instruction: 0x3128203d
     2a0:	29333c3c 	ldmdbcs	r3!, {r2, r3, r4, r5, sl, fp, ip, sp}
     2a4:	50470029 	subpl	r0, r7, r9, lsr #32
     2a8:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 18c <_Min_Heap_Size-0x74>
     2ac:	5f45444f 	svcpl	0x0045444f
     2b0:	4f5f4641 	svcmi	0x005f4641
     2b4:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
     2b8:	444f5f54 	strbmi	r5, [pc], #-3924	; 2c0 <_Min_Heap_Size+0xc0>
     2bc:	47003720 	strmi	r3, [r0, -r0, lsr #14]
     2c0:	444f4950 	strbmi	r4, [pc], #-2384	; 2c8 <_Min_Heap_Size+0xc8>
     2c4:	5341425f 	movtpl	r4, #4703	; 0x125f
     2c8:	78302045 	ldmdavc	r0!, {r0, r2, r6, sp}
     2cc:	31303034 	teqcc	r0, r4, lsr r0
     2d0:	30303431 	eorscc	r3, r0, r1, lsr r4
     2d4:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
     2d8:	31445049 	cmpcc	r4, r9, asr #32
     2dc:	45282035 	strmi	r2, [r8, #-53]!	; 0xffffffcb
     2e0:	5f495458 	svcpl	0x00495458
     2e4:	4f495047 	svcmi	0x00495047
     2e8:	70614d5f 	rsbvc	r4, r1, pc, asr sp
     2ec:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
     2f0:	7b29745f 	blvc	a5d474 <_Min_Stack_Size+0xa5d074>
     2f4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
     2f8:	2c35315f 	ldfcss	f3, [r5], #-380	; 0xfffffe84
     2fc:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
     300:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
     304:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
     308:	5f676966 	svcpl	0x00676966
     30c:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
     310:	444f4950 	strbmi	r4, [pc], #-2384	; 318 <_Min_Heap_Size+0x118>
     314:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
     318:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
     31c:	35315f4e 	ldrcc	r5, [r1, #-3918]!	; 0xfffff0b2
     320:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
     324:	4f4d5f4f 	svcmi	0x004d5f4f
     328:	415f4544 	cmpmi	pc, r4, asr #10
     32c:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
     330:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
     334:	4f495047 	svcmi	0x00495047
     338:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
     33c:	5f545550 	svcpl	0x00545550
     340:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
     344:	4f4e5f44 	svcmi	0x004e5f44
     348:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
     34c:	535f5f00 	cmppl	pc, #0, 30
     350:	4f455a49 	svcmi	0x00455a49
     354:	4f4c5f46 	svcmi	0x004c5f46
     358:	4c5f474e 	mrrcmi	7, 4, r4, pc, cr14	; <UNPREDICTABLE>
     35c:	5f474e4f 	svcpl	0x00474e4f
     360:	0038205f 	eorseq	r2, r8, pc, asr r0
     364:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
     368:	4952545f 	ldmdbmi	r2, {r0, r1, r2, r3, r4, r6, sl, ip, lr}^
     36c:	52454747 	subpl	r4, r5, #18612224	; 0x11c0000
     370:	5349525f 	movtpl	r5, #37471	; 0x925f
     374:	20474e49 	subcs	r4, r7, r9, asr #28
     378:	564e0030 			; <UNDEFINED> instruction: 0x564e0030
     37c:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
     380:	34335152 	ldrtcc	r5, [r3], #-338	; 0xfffffeae
     384:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
     388:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
     38c:	5f434956 	svcpl	0x00434956
     390:	52455349 	subpl	r5, r5, #603979777	; 0x24000001
     394:	3d7c2031 	ldclcc	0, cr2, [ip, #-196]!	; 0xffffff3c
     398:	3c312820 	ldccc	8, cr2, [r1], #-128	; 0xffffff80
     39c:	2929323c 	stmdbcs	r9!, {r2, r3, r4, r5, r9, ip, sp}
     3a0:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
     3a4:	54434152 	strbpl	r4, [r3], #-338	; 0xfffffeae
     3a8:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
     3ac:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
     3b0:	352e302d 	strcc	r3, [lr, #-45]!	; 0xffffffd3
     3b4:	2e302d52 	mrccs	13, 1, r2, cr0, cr2, {2}
     3b8:	00295235 	eoreq	r5, r9, r5, lsr r2
     3bc:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
     3c0:	3820385f 	stmdacc	r0!, {r0, r1, r2, r3, r4, r6, fp, ip, sp}
     3c4:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; fffff4cc <_estack+0xdfffa4cc>
     3c8:	43414c4c 	movtmi	r4, #7244	; 0x1c4c
     3cc:	5f4d5543 	svcpl	0x004d5543
     3d0:	5f58414d 	svcpl	0x0058414d
     3d4:	5830205f 	ldmdapl	r0!, {r0, r1, r2, r3, r4, r6, sp}
     3d8:	46464646 	strbmi	r4, [r6], -r6, asr #12
     3dc:	46464646 	strbmi	r4, [r6], -r6, asr #12
     3e0:	46464646 	strbmi	r4, [r6], -r6, asr #12
     3e4:	46464646 	strbmi	r4, [r6], -r6, asr #12
     3e8:	32332d50 	eorscc	r2, r3, #80, 26	; 0x1400
     3ec:	4b4c4c55 	blmi	1313548 <_Min_Stack_Size+0x1313148>
     3f0:	43435200 	movtmi	r5, #12800	; 0x3200
     3f4:	4950535f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
     3f8:	4c435f31 	mcrrmi	15, 3, r5, r3, cr1
     3fc:	4e455f4b 	cdpmi	15, 4, cr5, cr5, cr11, {2}
     400:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
     404:	2d434352 	stclcs	3, cr4, [r3, #-328]	; 0xfffffeb8
     408:	4250413e 	subsmi	r4, r0, #-2147483633	; 0x8000000f
     40c:	524e4532 	subpl	r4, lr, #209715200	; 0xc800000
     410:	203d7c20 	eorscs	r7, sp, r0, lsr #24
     414:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
     418:	29293231 	stmdbcs	r9!, {r0, r4, r5, r9, ip, sp}
     41c:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; fffff524 <_estack+0xdfffa524>
     420:	43434153 	movtmi	r4, #12627	; 0x3153
     424:	4d5f4d55 	ldclmi	13, cr4, [pc, #-340]	; 2d8 <_Min_Heap_Size+0xd8>
     428:	5f5f5841 	svcpl	0x005f5841
     42c:	46583020 	ldrbmi	r3, [r8], -r0, lsr #32
     430:	50464646 	subpl	r4, r6, r6, asr #12
     434:	4855382d 	ldmdami	r5, {r0, r2, r3, r5, fp, ip, sp}^
     438:	5f5f004b 	svcpl	0x005f004b
     43c:	33434544 	movtcc	r4, #13636	; 0x3544
     440:	494d5f32 	stmdbmi	sp, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
     444:	205f5f4e 	subscs	r5, pc, lr, asr #30
     448:	392d4531 	pushcc	{r0, r4, r5, r8, sl, lr}
     44c:	00464435 	subeq	r4, r6, r5, lsr r4
     450:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
     454:	58414d54 	stmdapl	r1, {r2, r4, r6, r8, sl, fp, lr}^
     458:	4449575f 	strbmi	r5, [r9], #-1887	; 0xfffff8a1
     45c:	5f5f4854 	svcpl	0x005f4854
     460:	00343620 	eorseq	r3, r4, r0, lsr #12
     464:	51535f5f 	cmppl	r3, pc, asr pc
     468:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
     46c:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
     470:	5f5f0030 	svcpl	0x005f0030
     474:	4544524f 	strbmi	r5, [r4, #-591]	; 0xfffffdb1
     478:	44505f52 	ldrbmi	r5, [r0], #-3922	; 0xfffff0ae
     47c:	4e455f50 	mcrmi	15, 2, r5, cr5, cr0, {2}
     480:	4e414944 	vmlsmi.f16	s9, s2, s8	; <UNPREDICTABLE>
     484:	33205f5f 			; <UNDEFINED> instruction: 0x33205f5f
     488:	00323134 	eorseq	r3, r2, r4, lsr r1
     48c:	52415f5f 	subpl	r5, r1, #380	; 0x17c
     490:	45465f4d 	strbmi	r5, [r6, #-3917]	; 0xfffff0b3
     494:	52555441 	subspl	r5, r5, #1090519040	; 0x41000000
     498:	44495f45 	strbmi	r5, [r9], #-3909	; 0xfffff0bb
     49c:	31205649 			; <UNDEFINED> instruction: 0x31205649
     4a0:	445f5f00 	ldrbmi	r5, [pc], #-3840	; 4a8 <_Min_Stack_Size+0xa8>
     4a4:	34364345 	ldrtcc	r4, [r6], #-837	; 0xfffffcbb
     4a8:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
     4ac:	5058455f 	subspl	r4, r8, pc, asr r5
     4b0:	33205f5f 			; <UNDEFINED> instruction: 0x33205f5f
     4b4:	5f003538 	svcpl	0x00003538
     4b8:	544c465f 	strbpl	r4, [ip], #-1631	; 0xfffff9a1
     4bc:	5341485f 	movtpl	r4, #6239	; 0x185f
     4c0:	4e45445f 	mcrmi	4, 2, r4, cr5, cr15, {2}
     4c4:	5f4d524f 	svcpl	0x004d524f
     4c8:	0031205f 	eorseq	r2, r1, pc, asr r0
     4cc:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
     4d0:	545f3854 	ldrbpl	r3, [pc], #-2132	; 4d8 <_Min_Stack_Size+0xd8>
     4d4:	5f455059 	svcpl	0x00455059
     4d8:	6973205f 	ldmdbvs	r3!, {r0, r1, r2, r3, r4, r6, sp}^
     4dc:	64656e67 	strbtvs	r6, [r5], #-3687	; 0xfffff199
     4e0:	61686320 	cmnvs	r8, r0, lsr #6
     4e4:	5f5f0072 	svcpl	0x005f0072
     4e8:	5f4d5241 	svcpl	0x004d5241
     4ec:	48435241 	stmdami	r3, {r0, r6, r9, ip, lr}^
     4f0:	4f52505f 	svcmi	0x0052505f
     4f4:	454c4946 	strbmi	r4, [ip, #-2374]	; 0xfffff6ba
     4f8:	00373720 	eorseq	r3, r7, r0, lsr #14
     4fc:	53555f5f 	cmppl	r5, #380	; 0x17c
     500:	55434341 	strbpl	r4, [r3, #-833]	; 0xfffffcbf
     504:	494d5f4d 	stmdbmi	sp, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
     508:	205f5f4e 	subscs	r5, pc, lr, asr #30
     50c:	55302e30 	ldrpl	r2, [r0, #-3632]!	; 0xfffff1d0
     510:	5f004b48 	svcpl	0x00004b48
     514:	544c465f 	strbpl	r4, [ip], #-1631	; 0xfffff9a1
     518:	445f3233 	ldrbmi	r3, [pc], #-563	; 520 <_Min_Stack_Size+0x120>
     51c:	4d494345 	stclmi	3, cr4, [r9, #-276]	; 0xfffffeec
     520:	445f4c41 	ldrbmi	r4, [pc], #-3137	; 528 <_Min_Stack_Size+0x128>
     524:	5f5f4749 	svcpl	0x005f4749
     528:	5f003920 	svcpl	0x00003920
     52c:	42444c5f 	submi	r4, r4, #24320	; 0x5f00
     530:	494d5f4c 	stmdbmi	sp, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
     534:	58455f4e 	stmdapl	r5, {r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
     538:	205f5f50 	subscs	r5, pc, r0, asr pc	; <UNPREDICTABLE>
     53c:	30312d28 	eorscc	r2, r1, r8, lsr #26
     540:	00293132 	eoreq	r3, r9, r2, lsr r1
     544:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
     548:	35314150 	ldrcc	r4, [r1, #-336]!	; 0xfffffeb0
     54c:	58452820 	stmdapl	r5, {r5, fp, sp}^
     550:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
     554:	5f4f4950 	svcpl	0x004f4950
     558:	7070614d 	rsbsvc	r6, r0, sp, asr #2
     55c:	5f676e69 	svcpl	0x00676e69
     560:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
     564:	5f495458 	svcpl	0x00495458
     568:	282c3531 	stmdacs	ip!, {r0, r4, r5, r8, sl, ip, sp}
     56c:	4f495047 	svcmi	0x00495047
     570:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
     574:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
     578:	745f6769 	ldrbvc	r6, [pc], #-1897	; 580 <_Min_Stack_Size+0x180>
     57c:	50477b29 	subpl	r7, r7, r9, lsr #22
     580:	2c414f49 	mcrrcs	15, 4, r4, r1, cr9
     584:	4f495047 	svcmi	0x00495047
     588:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
     58c:	2c35315f 	ldfcss	f3, [r5], #-380	; 0xfffffe84
     590:	4f495047 	svcmi	0x00495047
     594:	444f4d5f 	strbmi	r4, [pc], #-3423	; 59c <_Min_Stack_Size+0x19c>
     598:	46415f45 	strbmi	r5, [r1], -r5, asr #30
     59c:	504e495f 	subpl	r4, lr, pc, asr r9
     5a0:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
     5a4:	5f4f4950 	svcpl	0x004f4950
     5a8:	5054554f 	subspl	r5, r4, pc, asr #10
     5ac:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
     5b0:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
     5b4:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
     5b8:	007d7d45 	rsbseq	r7, sp, r5, asr #26
     5bc:	444c5f5f 	strbmi	r5, [ip], #-3935	; 0xfffff0a1
     5c0:	4d5f4c42 	ldclmi	12, cr4, [pc, #-264]	; 4c0 <_Min_Stack_Size+0xc0>
     5c4:	5f544e41 	svcpl	0x00544e41
     5c8:	5f474944 	svcpl	0x00474944
     5cc:	3335205f 	teqcc	r5, #95	; 0x5f
     5d0:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
     5d4:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
     5d8:	20395f4e 	eorscs	r5, r9, lr, asr #30
     5dc:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
     5e0:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
     5e4:	3029745f 	eorcc	r7, r9, pc, asr r4
     5e8:	30323078 	eorscc	r3, r2, r8, ror r0
     5ec:	5f002930 	svcpl	0x00002930
     5f0:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
     5f4:	435f3854 	cmpmi	pc, #84, 16	; 0x540000
     5f8:	20296328 	eorcs	r6, r9, r8, lsr #6
     5fc:	5f5f0063 	svcpl	0x005f0063
     600:	31544e49 	cmpcc	r4, r9, asr #28
     604:	59545f36 	ldmdbpl	r4, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
     608:	5f5f4550 	svcpl	0x005f4550
     60c:	6f687320 	svcvs	0x00687320
     610:	69207472 	stmdbvs	r0!, {r1, r4, r5, r6, sl, ip, sp, lr}
     614:	5f00746e 	svcpl	0x0000746e
     618:	544c465f 	strbpl	r4, [ip], #-1631	; 0xfffff9a1
     61c:	4d5f3436 	cfldrdmi	mvd3, [pc, #-216]	; 54c <_Min_Stack_Size+0x14c>
     620:	5f5f5841 	svcpl	0x005f5841
     624:	372e3120 	strcc	r3, [lr, -r0, lsr #2]!
     628:	39363739 	ldmdbcc	r6!, {r0, r3, r4, r5, r8, r9, sl, ip, sp}
     62c:	34333133 	ldrtcc	r3, [r3], #-307	; 0xfffffecd
     630:	33323638 	teqcc	r2, #56, 12	; 0x3800000
     634:	65373531 	ldrvs	r3, [r7, #-1329]!	; 0xfffffacf
     638:	3830332b 	ldmdacc	r0!, {r0, r1, r3, r5, r8, r9, ip, sp}
     63c:	00343646 	eorseq	r3, r4, r6, asr #12
     640:	32433249 	subcc	r3, r3, #-1879048188	; 0x90000004
     644:	5341425f 	movtpl	r4, #4703	; 0x125f
     648:	78302045 	ldmdavc	r0!, {r0, r2, r6, sp}
     64c:	30303034 	eorscc	r3, r0, r4, lsr r0
     650:	30303835 	eorscc	r3, r0, r5, lsr r8
     654:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
     658:	34435049 	strbcc	r5, [r3], #-73	; 0xffffffb7
     65c:	58452820 	stmdapl	r5, {r5, fp, sp}^
     660:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
     664:	5f4f4950 	svcpl	0x004f4950
     668:	7070614d 	rsbsvc	r6, r0, sp, asr #2
     66c:	5f676e69 	svcpl	0x00676e69
     670:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
     674:	5f495458 	svcpl	0x00495458
     678:	28202c34 	stmdacs	r0!, {r2, r4, r5, sl, fp, sp}
     67c:	4f495047 	svcmi	0x00495047
     680:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
     684:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
     688:	745f6769 	ldrbvc	r6, [pc], #-1897	; 690 <_Min_Stack_Size+0x290>
     68c:	50477b29 	subpl	r7, r7, r9, lsr #22
     690:	2c434f49 	mcrrcs	15, 4, r4, r3, cr9
     694:	4f495047 	svcmi	0x00495047
     698:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
     69c:	472c345f 			; <UNDEFINED> instruction: 0x472c345f
     6a0:	5f4f4950 	svcpl	0x004f4950
     6a4:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
     6a8:	5f46415f 	svcpl	0x0046415f
     6ac:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
     6b0:	50472c54 	subpl	r2, r7, r4, asr ip
     6b4:	4f5f4f49 	svcmi	0x005f4f49
     6b8:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
     6bc:	50535f54 	subspl	r5, r3, r4, asr pc
     6c0:	5f444545 	svcpl	0x00444545
     6c4:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
     6c8:	47007d7d 	smlsdxmi	r0, sp, sp, r7
     6cc:	5f4f4950 	svcpl	0x004f4950
     6d0:	5f4e4950 	svcpl	0x004e4950
     6d4:	28282034 	stmdacs	r8!, {r2, r4, r5, sp}
     6d8:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
     6dc:	745f3631 	ldrbvc	r3, [pc], #-1585	; 6e4 <_Min_Stack_Size+0x2e4>
     6e0:	30783029 	rsbscc	r3, r8, r9, lsr #32
     6e4:	29303130 	ldmdbcs	r0!, {r4, r5, r8, ip, sp}
     6e8:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
     6ec:	33445049 	movtcc	r5, #16457	; 0x4049
     6f0:	58452820 	stmdapl	r5, {r5, fp, sp}^
     6f4:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
     6f8:	5f4f4950 	svcpl	0x004f4950
     6fc:	7070614d 	rsbsvc	r6, r0, sp, asr #2
     700:	5f676e69 	svcpl	0x00676e69
     704:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
     708:	5f495458 	svcpl	0x00495458
     70c:	28202c33 	stmdacs	r0!, {r0, r1, r4, r5, sl, fp, sp}
     710:	4f495047 	svcmi	0x00495047
     714:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
     718:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
     71c:	745f6769 	ldrbvc	r6, [pc], #-1897	; 724 <_Min_Stack_Size+0x324>
     720:	50477b29 	subpl	r7, r7, r9, lsr #22
     724:	2c444f49 	mcrrcs	15, 4, r4, r4, cr9
     728:	4f495047 	svcmi	0x00495047
     72c:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
