mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
     730:	472c335f 			; <UNDEFINED> instruction: 0x472c335f
     734:	5f4f4950 	svcpl	0x004f4950
     738:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
     73c:	5f46415f 	svcpl	0x0046415f
     740:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
     744:	50472c54 	subpl	r2, r7, r4, asr ip
     748:	4f5f4f49 	svcmi	0x005f4f49
     74c:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
     750:	50535f54 	subspl	r5, r3, r4, asr pc
     754:	5f444545 	svcpl	0x00444545
     758:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
     75c:	5f007d7d 	svcpl	0x00007d7d
     760:	4343475f 	movtmi	r4, #14175	; 0x375f
     764:	5641485f 			; <UNDEFINED> instruction: 0x5641485f
     768:	59535f45 	ldmdbpl	r3, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
     76c:	435f434e 	cmpmi	pc, #939524097	; 0x38000001
     770:	41504d4f 	cmpmi	r0, pc, asr #26
     774:	415f4552 	cmpmi	pc, r2, asr r5	; <UNPREDICTABLE>
     778:	535f444e 	cmppl	pc, #1308622848	; 0x4e000000
     77c:	5f504157 	svcpl	0x00504157
     780:	00312031 	eorseq	r2, r1, r1, lsr r0
     784:	5f434352 	svcpl	0x00434352
     788:	344d4954 	strbcc	r4, [sp], #-2388	; 0xfffff6ac
     78c:	4b4c435f 	blmi	1311510 <_Min_Stack_Size+0x1311110>
     790:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
     794:	52282029 	eorpl	r2, r8, #41	; 0x29
     798:	3e2d4343 	cdpcc	3, 2, cr4, cr13, cr3, {2}
     79c:	31425041 	cmpcc	r2, r1, asr #32
     7a0:	20524e45 	subscs	r4, r2, r5, asr #28
     7a4:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
     7a8:	323c3c31 	eorscc	r3, ip, #12544	; 0x3100
     7ac:	54002929 	strpl	r2, [r0], #-2345	; 0xfffff6d7
     7b0:	5f324d49 	svcpl	0x00324d49
     7b4:	45534142 	ldrbmi	r4, [r3, #-322]	; 0xfffffebe
     7b8:	34783020 	ldrbtcc	r3, [r8], #-32	; 0xffffffe0
     7bc:	30303030 	eorscc	r3, r0, r0, lsr r0
     7c0:	00303030 	eorseq	r3, r0, r0, lsr r0
     7c4:	54535f5f 	ldrbpl	r5, [r3], #-3935	; 0xfffff0a1
     7c8:	485f4344 	ldmdami	pc, {r2, r6, r8, r9, lr}^	; <UNPREDICTABLE>
     7cc:	4554534f 	ldrbmi	r5, [r4, #-847]	; 0xfffffcb1
     7d0:	205f5f44 	subscs	r5, pc, r4, asr #30
     7d4:	43520031 	cmpmi	r2, #49	; 0x31
     7d8:	53555f43 	cmppl	r5, #268	; 0x10c
     7dc:	32545241 	subscc	r5, r4, #268435460	; 0x10000004
     7e0:	4b4c435f 	blmi	1311564 <_Min_Stack_Size+0x1311164>
     7e4:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
     7e8:	52282029 	eorpl	r2, r8, #41	; 0x29
     7ec:	3e2d4343 	cdpcc	3, 2, cr4, cr13, cr3, {2}
     7f0:	31425041 	cmpcc	r2, r1, asr #32
     7f4:	20524e45 	subscs	r4, r2, r5, asr #28
     7f8:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
     7fc:	313c3c31 	teqcc	ip, r1, lsr ip
     800:	00292937 	eoreq	r2, r9, r7, lsr r9
     804:	49535f5f 	ldmdbmi	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
     808:	54415f47 	strbpl	r5, [r1], #-3911	; 0xfffff0b9
     80c:	43494d4f 	movtmi	r4, #40271	; 0x9d4f
     810:	5059545f 	subspl	r5, r9, pc, asr r4
     814:	205f5f45 	subscs	r5, pc, r5, asr #30
     818:	00746e69 	rsbseq	r6, r4, r9, ror #28
     81c:	47474f54 	smlsldmi	r4, r7, r4, pc	; <UNPREDICTABLE>
     820:	425f454c 	subsmi	r4, pc, #76, 10	; 0x13000000
     824:	52285449 	eorpl	r5, r8, #1224736768	; 0x49000000
     828:	422c4745 	eormi	r4, ip, #18087936	; 0x1140000
     82c:	4f4e5449 	svcmi	0x004e5449
     830:	52282029 	eorpl	r2, r8, #41	; 0x29
     834:	5e204745 	cdppl	7, 2, cr4, cr0, cr5, {2}
     838:	3128203d 			; <UNDEFINED> instruction: 0x3128203d
     83c:	49423c3c 	stmdbmi	r2, {r2, r3, r4, r5, sl, fp, ip, sp}^
     840:	294f4e54 	stmdbcs	pc, {r2, r4, r6, r9, sl, fp, lr}^	; <UNPREDICTABLE>
     844:	5f5f0029 	svcpl	0x005f0029
     848:	5f544e49 	svcpl	0x00544e49
     84c:	54534146 	ldrbpl	r4, [r3], #-326	; 0xfffffeba
     850:	545f3436 	ldrbpl	r3, [pc], #-1078	; 858 <_Min_Stack_Size+0x458>
     854:	5f455059 	svcpl	0x00455059
     858:	6f6c205f 	svcvs	0x006c205f
     85c:	6c20676e 	stcvs	7, cr6, [r0], #-440	; 0xfffffe48
     860:	20676e6f 	rsbcs	r6, r7, pc, ror #28
     864:	00746e69 	rsbseq	r6, r4, r9, ror #28
     868:	52415f5f 	subpl	r5, r1, #380	; 0x17c
     86c:	45465f4d 	strbmi	r5, [r6, #-3917]	; 0xfffff0b3
     870:	52555441 	subspl	r5, r5, #1090519040	; 0x41000000
     874:	4f435f45 	svcmi	0x00435f45
     878:	434f5250 	movtmi	r5, #62032	; 0xf250
     87c:	00353120 	eorseq	r3, r5, r0, lsr #2
     880:	5f434352 	svcpl	0x00434352
     884:	4f495047 	svcmi	0x00495047
     888:	4c435f43 	mcrrmi	15, 4, r5, r3, cr3
     88c:	4e455f4b 	cdpmi	15, 4, cr5, cr5, cr11, {2}
     890:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
     894:	2d434352 	stclcs	3, cr4, [r3, #-328]	; 0xfffffeb8
     898:	4250413e 	subsmi	r4, r0, #-2147483633	; 0x8000000f
     89c:	524e4532 	subpl	r4, lr, #209715200	; 0xc800000
     8a0:	203d7c20 	eorscs	r7, sp, r0, lsr #24
     8a4:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
     8a8:	00292934 	eoreq	r2, r9, r4, lsr r9
     8ac:	4c4c554e 	cfstr64mi	mvdx5, [ip], {78}	; 0x4e
     8b0:	5254505f 	subspl	r5, r4, #95	; 0x5f
     8b4:	76282820 	strtvc	r2, [r8], -r0, lsr #16
     8b8:	2a64696f 	bcs	191ae7c <_Min_Stack_Size+0x191aa7c>
     8bc:	29302029 	ldmdbcs	r0!, {r0, r3, r5, sp}
     8c0:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
     8c4:	3233544c 	eorscc	r5, r3, #76, 8	; 0x4c000000
     8c8:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
     8cc:	5f30315f 	svcpl	0x0030315f
     8d0:	5f505845 	svcpl	0x00505845
     8d4:	3833205f 	ldmdacc	r3!, {r0, r1, r2, r3, r4, r6, sp}
     8d8:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
     8dc:	52495f43 	subpl	r5, r9, #268	; 0x10c
     8e0:	5f393251 	svcpl	0x00393251
     8e4:	28534944 	ldmdacs	r3, {r2, r6, r8, fp, lr}^
     8e8:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
     8ec:	5f434956 	svcpl	0x00434956
     8f0:	52454349 	subpl	r4, r5, #603979777	; 0x24000001
     8f4:	3d7c2030 	ldclcc	0, cr2, [ip, #-192]!	; 0xffffff40
     8f8:	3c312820 	ldccc	8, cr2, [r1], #-128	; 0xffffff80
     8fc:	2939323c 	ldmdbcs	r9!, {r2, r3, r4, r5, r9, ip, sp}
     900:	5f5f0029 	svcpl	0x005f0029
     904:	52465355 	subpl	r5, r6, #1409286145	; 0x54000001
     908:	5f544341 	svcpl	0x00544341
     90c:	5f58414d 	svcpl	0x0058414d
     910:	5830205f 	ldmdapl	r0!, {r0, r1, r2, r3, r4, r6, sp}
     914:	2d504646 	ldclcs	6, cr4, [r0, #-280]	; 0xfffffee8
     918:	52485538 	subpl	r5, r8, #56, 10	; 0xe000000
     91c:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; fffffa24 <_estack+0xdfffaa24>
     920:	50544e49 	subspl	r4, r4, r9, asr #28
     924:	4d5f5254 	lfmmi	f5, 2, [pc, #-336]	; 7dc <_Min_Stack_Size+0x3dc>
     928:	5f5f5841 	svcpl	0x005f5841
     92c:	66783020 	ldrbtvs	r3, [r8], -r0, lsr #32
     930:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     934:	55666666 	strbpl	r6, [r6, #-1638]!	; 0xfffff99a
     938:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
     93c:	52495f49 	subpl	r5, r9, #292	; 0x124
     940:	4e455f51 	mcrmi	15, 2, r5, cr5, cr1, {2}
     944:	454c4241 	strbmi	r4, [ip, #-577]	; 0xfffffdbf
     948:	5f003120 	svcpl	0x00003120
     94c:	544c465f 	strbpl	r4, [ip], #-1631	; 0xfffff9a1
     950:	4d5f3233 	lfmmi	f3, 2, [pc, #-204]	; 88c <_Min_Stack_Size+0x48c>
     954:	455f4e49 	ldrbmi	r4, [pc, #-3657]	; fffffb13 <_estack+0xdfffab13>
     958:	5f5f5058 	svcpl	0x005f5058
     95c:	312d2820 			; <UNDEFINED> instruction: 0x312d2820
     960:	00293532 	eoreq	r3, r9, r2, lsr r5
     964:	4f495047 	svcmi	0x00495047
     968:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
     96c:	5f545550 	svcpl	0x00545550
     970:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
     974:	30315f44 	eorscc	r5, r1, r4, asr #30
     978:	205a484d 	subscs	r4, sl, sp, asr #16
     97c:	58450031 	stmdapl	r5, {r0, r4, r5}^
     980:	43504954 	cmpmi	r0, #84, 18	; 0x150000
     984:	28203131 	stmdacs	r0!, {r0, r4, r5, r8, ip, sp}
     988:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
     98c:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
     990:	614d5f4f 	cmpvs	sp, pc, asr #30
     994:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
     998:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
     99c:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
     9a0:	31315f49 	teqcc	r1, r9, asr #30
     9a4:	5047282c 	subpl	r2, r7, ip, lsr #16
     9a8:	505f4f49 	subspl	r4, pc, r9, asr #30
     9ac:	6f436e69 	svcvs	0x00436e69
     9b0:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
     9b4:	7b29745f 	blvc	a5db38 <_Min_Stack_Size+0xa5d738>
     9b8:	4f495047 	svcmi	0x00495047
     9bc:	50472c43 	subpl	r2, r7, r3, asr #24
     9c0:	505f4f49 	subspl	r4, pc, r9, asr #30
     9c4:	315f4e49 	cmpcc	pc, r9, asr #28
     9c8:	50472c31 	subpl	r2, r7, r1, lsr ip
     9cc:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 8b0 <_Min_Stack_Size+0x4b0>
     9d0:	5f45444f 	svcpl	0x0045444f
     9d4:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
     9d8:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
     9dc:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
     9e0:	554f5f4f 	strbpl	r5, [pc, #-3919]	; fffffa99 <_estack+0xdfffaa99>
     9e4:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
     9e8:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
     9ec:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
     9f0:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
     9f4:	564e007d 			; <UNDEFINED> instruction: 0x564e007d
     9f8:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
     9fc:	37335152 			; <UNDEFINED> instruction: 0x37335152
     a00:	5349445f 	movtpl	r4, #37983	; 0x945f
     a04:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
     a08:	4349564e 	movtmi	r5, #38478	; 0x964e
     a0c:	4543495f 	strbmi	r4, [r3, #-2399]	; 0xfffff6a1
     a10:	7c203152 	stfvcs	f3, [r0], #-328	; 0xfffffeb8
     a14:	3128203d 			; <UNDEFINED> instruction: 0x3128203d
     a18:	29353c3c 	ldmdbcs	r5!, {r2, r3, r4, r5, sl, fp, ip, sp}
     a1c:	58450029 	stmdapl	r5, {r0, r3, r5}^
     a20:	315f4954 	cmpcc	pc, r4, asr r9	; <UNPREDICTABLE>
     a24:	31312031 	teqcc	r1, r1, lsr r0
     a28:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; fffffb30 <_estack+0xdfffab30>
     a2c:	4152464c 	cmpmi	r2, ip, asr #12
     a30:	465f5443 	ldrbmi	r5, [pc], -r3, asr #8
     a34:	5f544942 	svcpl	0x00544942
     a38:	3233205f 	eorscc	r2, r3, #95	; 0x5f
     a3c:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
     a40:	3436544c 	ldrtcc	r5, [r6], #-1100	; 0xfffffbb4
     a44:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
     a48:	5f30315f 	svcpl	0x0030315f
     a4c:	5f505845 	svcpl	0x00505845
     a50:	2d28205f 	stccs	0, cr2, [r8, #-380]!	; 0xfffffe84
     a54:	29373033 	ldmdbcs	r7!, {r0, r1, r4, r5, ip, sp}
     a58:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
     a5c:	33455049 	movtcc	r5, #20553	; 0x5049
     a60:	58452820 	stmdapl	r5, {r5, fp, sp}^
     a64:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
     a68:	5f4f4950 	svcpl	0x004f4950
     a6c:	7070614d 	rsbsvc	r6, r0, sp, asr #2
     a70:	5f676e69 	svcpl	0x00676e69
     a74:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
     a78:	5f495458 	svcpl	0x00495458
     a7c:	28202c33 	stmdacs	r0!, {r0, r1, r4, r5, sl, fp, sp}
     a80:	4f495047 	svcmi	0x00495047
     a84:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
     a88:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
     a8c:	745f6769 	ldrbvc	r6, [pc], #-1897	; a94 <_Min_Stack_Size+0x694>
     a90:	50477b29 	subpl	r7, r7, r9, lsr #22
     a94:	2c454f49 	mcrrcs	15, 4, r4, r5, cr9
     a98:	4f495047 	svcmi	0x00495047
     a9c:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
     aa0:	472c335f 			; <UNDEFINED> instruction: 0x472c335f
     aa4:	5f4f4950 	svcpl	0x004f4950
     aa8:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
     aac:	5f46415f 	svcpl	0x0046415f
     ab0:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
     ab4:	50472c54 	subpl	r2, r7, r4, asr ip
     ab8:	4f5f4f49 	svcmi	0x005f4f49
     abc:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
     ac0:	50535f54 	subspl	r5, r3, r4, asr pc
     ac4:	5f444545 	svcpl	0x00444545
     ac8:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
     acc:	45007d7d 	strmi	r7, [r0, #-3453]	; 0xfffff283
     ad0:	50495458 	subpl	r5, r9, r8, asr r4
     ad4:	20323145 	eorscs	r3, r2, r5, asr #2
     ad8:	54584528 	ldrbpl	r4, [r8], #-1320	; 0xfffffad8
     adc:	50475f49 	subpl	r5, r7, r9, asr #30
     ae0:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 9c4 <_Min_Stack_Size+0x5c4>
     ae4:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
     ae8:	745f676e 	ldrbvc	r6, [pc], #-1902	; af0 <_Min_Stack_Size+0x6f0>
     aec:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
     af0:	315f4954 	cmpcc	pc, r4, asr r9	; <UNPREDICTABLE>
     af4:	47282c32 			; <UNDEFINED> instruction: 0x47282c32
     af8:	5f4f4950 	svcpl	0x004f4950
     afc:	436e6950 	cmnmi	lr, #80, 18	; 0x140000
     b00:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
     b04:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
     b08:	4950477b 	ldmdbmi	r0, {r0, r1, r3, r4, r5, r6, r8, r9, sl, lr}^
     b0c:	472c454f 	strmi	r4, [ip, -pc, asr #10]!
     b10:	5f4f4950 	svcpl	0x004f4950
     b14:	5f4e4950 	svcpl	0x004e4950
     b18:	472c3231 			; <UNDEFINED> instruction: 0x472c3231
     b1c:	5f4f4950 	svcpl	0x004f4950
     b20:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
     b24:	5f46415f 	svcpl	0x0046415f
     b28:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
     b2c:	50472c54 	subpl	r2, r7, r4, asr ip
     b30:	4f5f4f49 	svcmi	0x005f4f49
     b34:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
     b38:	50535f54 	subspl	r5, r3, r4, asr pc
     b3c:	5f444545 	svcpl	0x00444545
     b40:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
     b44:	45007d7d 	strmi	r7, [r0, #-3453]	; 0xfffff283
     b48:	5f495458 	svcpl	0x00495458
     b4c:	31203331 			; <UNDEFINED> instruction: 0x31203331
     b50:	5f5f0033 	svcpl	0x005f0033
     b54:	41524653 	cmpmi	r2, r3, asr r6
     b58:	455f5443 	ldrbmi	r5, [pc, #-1091]	; 71d <_Min_Stack_Size+0x31d>
     b5c:	4c495350 	mcrrmi	3, 5, r5, r9, cr0
     b60:	5f5f4e4f 	svcpl	0x005f4e4f
     b64:	31783020 	cmncc	r8, r0, lsr #32
     b68:	48372d50 	ldmdami	r7!, {r4, r6, r8, sl, fp, sp}
     b6c:	5f5f0052 	svcpl	0x005f0052
     b70:	33544e49 	cmpcc	r4, #1168	; 0x490
     b74:	28435f32 	stmdacs	r3, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
     b78:	63202963 			; <UNDEFINED> instruction: 0x63202963
     b7c:	20232320 	eorcs	r2, r3, r0, lsr #6
     b80:	5f5f004c 	svcpl	0x005f004c
     b84:	5f515355 	svcpl	0x00515355
     b88:	54494246 	strbpl	r4, [r9], #-582	; 0xfffffdba
     b8c:	33205f5f 			; <UNDEFINED> instruction: 0x33205f5f
     b90:	5f5f0032 	svcpl	0x005f0032
     b94:	4544524f 	strbmi	r5, [r4, #-591]	; 0xfffffdb1
     b98:	49425f52 	stmdbmi	r2, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
     b9c:	4e455f47 	cdpmi	15, 4, cr5, cr5, cr7, {2}
     ba0:	4e414944 	vmlsmi.f16	s9, s2, s8	; <UNPREDICTABLE>
     ba4:	34205f5f 	strtcc	r5, [r0], #-3935	; 0xfffff0a1
     ba8:	00313233 	eorseq	r3, r1, r3, lsr r2
     bac:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
     bb0:	5f323354 	svcpl	0x00323354
     bb4:	5f58414d 	svcpl	0x0058414d
     bb8:	5f505845 	svcpl	0x00505845
     bbc:	3231205f 	eorscc	r2, r1, #95	; 0x5f
     bc0:	54460038 	strbpl	r0, [r6], #-56	; 0xffffffc8
     bc4:	45005253 	strmi	r5, [r0, #-595]	; 0xfffffdad
     bc8:	5f495458 	svcpl	0x00495458
     bcc:	31203531 			; <UNDEFINED> instruction: 0x31203531
     bd0:	564e0035 			; <UNDEFINED> instruction: 0x564e0035
     bd4:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
     bd8:	33325152 	teqcc	r2, #-2147483628	; 0x80000014
     bdc:	5349445f 	movtpl	r4, #37983	; 0x945f
     be0:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
     be4:	4349564e 	movtmi	r5, #38478	; 0x964e
     be8:	4543495f 	strbmi	r4, [r3, #-2399]	; 0xfffff6a1
     bec:	7c203052 	stcvc	0, cr3, [r0], #-328	; 0xfffffeb8
     bf0:	3128203d 			; <UNDEFINED> instruction: 0x3128203d
     bf4:	33323c3c 	teqcc	r2, #60, 24	; 0x3c00
     bf8:	5f002929 	svcpl	0x00002929
     bfc:	5148555f 	cmppl	r8, pc, asr r5
     c00:	4942465f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
     c04:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
     c08:	47003631 	smladxmi	r0, r1, r6, r3
     c0c:	5f4f4950 	svcpl	0x004f4950
     c10:	5f4e4950 	svcpl	0x004e4950
     c14:	28282038 	stmdacs	r8!, {r3, r4, r5, sp}
     c18:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
     c1c:	745f3631 	ldrbvc	r3, [pc], #-1585	; c24 <_Min_Stack_Size+0x824>
     c20:	30783029 	rsbscc	r3, r8, r9, lsr #32
     c24:	29303031 	ldmdbcs	r0!, {r0, r4, r5, ip, sp}
     c28:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
     c2c:	3436544c 	ldrtcc	r5, [r6], #-1100	; 0xfffffbb4
     c30:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
     c34:	5058455f 	subspl	r4, r8, pc, asr r5
     c38:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
     c3c:	3230312d 	eorscc	r3, r0, #1073741835	; 0x4000000b
     c40:	45002931 	strmi	r2, [r0, #-2353]	; 0xfffff6cf
     c44:	50495458 	subpl	r5, r9, r8, asr r4
     c48:	20323142 	eorscs	r3, r2, r2, asr #2
     c4c:	54584528 	ldrbpl	r4, [r8], #-1320	; 0xfffffad8
     c50:	50475f49 	subpl	r5, r7, r9, asr #30
     c54:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; b38 <_Min_Stack_Size+0x738>
     c58:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
     c5c:	745f676e 	ldrbvc	r6, [pc], #-1902	; c64 <_Min_Stack_Size+0x864>
     c60:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
     c64:	315f4954 	cmpcc	pc, r4, asr r9	; <UNPREDICTABLE>
     c68:	47282c32 			; <UNDEFINED> instruction: 0x47282c32
     c6c:	5f4f4950 	svcpl	0x004f4950
     c70:	436e6950 	cmnmi	lr, #80, 18	; 0x140000
     c74:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
     c78:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
     c7c:	4950477b 	ldmdbmi	r0, {r0, r1, r3, r4, r5, r6, r8, r9, sl, lr}^
     c80:	472c424f 	strmi	r4, [ip, -pc, asr #4]!
     c84:	5f4f4950 	svcpl	0x004f4950
     c88:	5f4e4950 	svcpl	0x004e4950
     c8c:	472c3231 			; <UNDEFINED> instruction: 0x472c3231
     c90:	5f4f4950 	svcpl	0x004f4950
     c94:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
     c98:	5f46415f 	svcpl	0x0046415f
     c9c:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
     ca0:	50472c54 	subpl	r2, r7, r4, asr ip
     ca4:	4f5f4f49 	svcmi	0x005f4f49
     ca8:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
     cac:	50535f54 	subspl	r5, r3, r4, asr pc
     cb0:	5f444545 	svcpl	0x00444545
     cb4:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
     cb8:	45007d7d 	strmi	r7, [r0, #-3453]	; 0xfffff283
     cbc:	5f495458 	svcpl	0x00495458
     cc0:	00322032 	eorseq	r2, r2, r2, lsr r0
     cc4:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
     cc8:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
     ccc:	38545341 	ldmdacc	r4, {r0, r6, r8, r9, ip, lr}^
     cd0:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
     cd4:	30205f5f 	eorcc	r5, r0, pc, asr pc
     cd8:	66666678 			; <UNDEFINED> instruction: 0x66666678
     cdc:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     ce0:	5f005566 	svcpl	0x00005566
     ce4:	4345445f 	movtmi	r4, #21599	; 0x545f
     ce8:	455f3233 	ldrbmi	r3, [pc, #-563]	; abd <_Min_Stack_Size+0x6bd>
     cec:	4c495350 	mcrrmi	3, 5, r5, r9, cr0
     cf0:	5f5f4e4f 	svcpl	0x005f4e4f
     cf4:	2d453120 	stfcse	f3, [r5, #-128]	; 0xffffff80
     cf8:	00464436 	subeq	r4, r6, r6, lsr r4
     cfc:	5f434352 	svcpl	0x00434352
     d00:	4f495047 	svcmi	0x00495047
     d04:	4c435f44 	mcrrmi	15, 4, r5, r3, cr4
     d08:	4e455f4b 	cdpmi	15, 4, cr5, cr5, cr11, {2}
     d0c:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
     d10:	2d434352 	stclcs	3, cr4, [r3, #-328]	; 0xfffffeb8
     d14:	4250413e 	subsmi	r4, r0, #-2147483633	; 0x8000000f
     d18:	524e4532 	subpl	r4, lr, #209715200	; 0xc800000
     d1c:	203d7c20 	eorscs	r7, sp, r0, lsr #24
     d20:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
     d24:	00292935 	eoreq	r2, r9, r5, lsr r9
     d28:	4f495047 	svcmi	0x00495047
     d2c:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
     d30:	2820325f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r9, ip, sp}
     d34:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
     d38:	5f363174 	svcpl	0x00363174
     d3c:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
     d40:	34303030 	ldrtcc	r3, [r0], #-48	; 0xffffffd0
     d44:	5f5f0029 	svcpl	0x005f0029
     d48:	4343414c 	movtmi	r4, #12620	; 0x314c
     d4c:	495f4d55 	ldmdbmi	pc, {r0, r2, r4, r6, r8, sl, fp, lr}^	; <UNPREDICTABLE>
     d50:	5f544942 	svcpl	0x00544942
     d54:	3233205f 	eorscc	r2, r3, #95	; 0x5f
     d58:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
     d5c:	41495f43 	cmpmi	r9, r3, asr #30
     d60:	20315242 	eorscs	r5, r1, r2, asr #4
     d64:	7576282a 	ldrbvc	r2, [r6, #-2090]!	; 0xfffff7d6
     d68:	33746e69 	cmncc	r4, #1680	; 0x690
     d6c:	2a745f32 	bcs	1d18a3c <_Min_Stack_Size+0x1d1863c>
     d70:	564e2829 	strbpl	r2, [lr], -r9, lsr #16
     d74:	425f4349 	subsmi	r4, pc, #603979777	; 0x24000001
     d78:	2b455341 	blcs	1155a84 <_Min_Stack_Size+0x1155684>
     d7c:	30327830 	eorscc	r7, r2, r0, lsr r8
     d80:	5f002934 	svcpl	0x00002934
     d84:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
     d88:	5341465f 	movtpl	r4, #5727	; 0x165f
     d8c:	5f363154 	svcpl	0x00363154
     d90:	54444957 	strbpl	r4, [r4], #-2391	; 0xfffff6a9
     d94:	205f5f48 	subscs	r5, pc, r8, asr #30
     d98:	52003233 	andpl	r3, r0, #805306371	; 0x30000003
     d9c:	545f4343 	ldrbpl	r4, [pc], #-835	; da4 <_Min_Stack_Size+0x9a4>
     da0:	5f334d49 	svcpl	0x00334d49
     da4:	5f4b4c43 	svcpl	0x004b4c43
     da8:	29284e45 	stmdbcs	r8!, {r0, r2, r6, r9, sl, fp, lr}
     dac:	43522820 	cmpmi	r2, #32, 16	; 0x200000
     db0:	413e2d43 	teqmi	lr, r3, asr #26
     db4:	45314250 	ldrmi	r4, [r1, #-592]!	; 0xfffffdb0
     db8:	7c20524e 	sfmvc	f5, 4, [r0], #-312	; 0xfffffec8
     dbc:	3128203d 			; <UNDEFINED> instruction: 0x3128203d
     dc0:	29313c3c 	ldmdbcs	r1!, {r2, r3, r4, r5, sl, fp, ip, sp}
     dc4:	58450029 	stmdapl	r5, {r0, r3, r5}^
     dc8:	375f4954 			; <UNDEFINED> instruction: 0x375f4954
     dcc:	5f003720 	svcpl	0x00003720
     dd0:	5046565f 	subpl	r5, r6, pc, asr r6
     dd4:	5f50465f 	svcpl	0x0050465f
     dd8:	0031205f 	eorseq	r2, r1, pc, asr r0
     ddc:	444c5f5f 	strbmi	r5, [ip], #-3935	; 0xfffff0a1
     de0:	4d5f4c42 	ldclmi	12, cr4, [pc, #-264]	; ce0 <_Min_Stack_Size+0x8e0>
     de4:	5f5f5841 	svcpl	0x005f5841
     de8:	372e3120 	strcc	r3, [lr, -r0, lsr #2]!
     dec:	39363739 	ldmdbcc	r6!, {r0, r3, r4, r5, r8, r9, sl, ip, sp}
     df0:	34333133 	ldrtcc	r3, [r3], #-307	; 0xfffffecd
     df4:	33323638 	teqcc	r2, #56, 12	; 0x3800000
     df8:	65373531 	ldrvs	r3, [r7, #-1329]!	; 0xfffffacf
     dfc:	3830332b 	ldmdacc	r0!, {r0, r1, r3, r5, r8, r9, ip, sp}
     e00:	5f5f004c 	svcpl	0x005f004c
     e04:	52464c4c 	subpl	r4, r6, #76, 24	; 0x4c00
     e08:	5f544341 	svcpl	0x00544341
     e0c:	5f4e494d 	svcpl	0x004e494d
     e10:	2d28205f 	stccs	0, cr2, [r8, #-380]!	; 0xfffffe84
     e14:	4c352e30 	ldcmi	14, cr2, [r5], #-192	; 0xffffff40
     e18:	302d524c 	eorcc	r5, sp, ip, asr #4
     e1c:	4c4c352e 	cfstr64mi	mvdx3, [ip], {46}	; 0x2e
     e20:	5f002952 	svcpl	0x00002952
     e24:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
     e28:	5f525450 	svcpl	0x00525450
     e2c:	5f58414d 	svcpl	0x0058414d
     e30:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
     e34:	66666637 			; <UNDEFINED> instruction: 0x66666637
     e38:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     e3c:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; ffffff44 <_estack+0xdfffaf44>
     e40:	5f544e49 	svcpl	0x00544e49
     e44:	54534146 	ldrbpl	r4, [r3], #-326	; 0xfffffeba
     e48:	4d5f3631 	ldclmi	6, cr3, [pc, #-196]	; d8c <_Min_Stack_Size+0x98c>
     e4c:	5f5f5841 	svcpl	0x005f5841
     e50:	66783020 	ldrbtvs	r3, [r8], -r0, lsr #32
     e54:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     e58:	55666666 	strbpl	r6, [r6, #-1638]!	; 0xfffff99a
     e5c:	445f5f00 	ldrbmi	r5, [pc], #-3840	; e64 <_Min_Stack_Size+0xa64>
     e60:	32334345 	eorscc	r4, r3, #335544321	; 0x14000001
