mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
     e64:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
     e68:	39205f5f 	stmdbcc	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
     e6c:	3939392e 	ldmdbcc	r9!, {r1, r2, r3, r5, r8, fp, ip, sp}
     e70:	45393939 	ldrmi	r3, [r9, #-2361]!	; 0xfffff6c7
     e74:	46443639 			; <UNDEFINED> instruction: 0x46443639
     e78:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; ffffff80 <_estack+0xdfffaf80>
     e7c:	43415246 	movtmi	r5, #4678	; 0x1246
     e80:	494d5f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
     e84:	205f5f4e 	subscs	r5, pc, lr, asr #30
     e88:	55302e30 	ldrpl	r2, [r0, #-3632]!	; 0xfffff1d0
     e8c:	58450052 	stmdapl	r5, {r1, r4, r6}^
     e90:	45504954 	ldrbmi	r4, [r0, #-2388]	; 0xfffff6ac
     e94:	45282034 	strmi	r2, [r8, #-52]!	; 0xffffffcc
     e98:	5f495458 	svcpl	0x00495458
     e9c:	4f495047 	svcmi	0x00495047
     ea0:	70614d5f 	rsbvc	r4, r1, pc, asr sp
     ea4:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
     ea8:	7b29745f 	blvc	a5e02c <_Min_Stack_Size+0xa5dc2c>
     eac:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
     eb0:	202c345f 	eorcs	r3, ip, pc, asr r4
     eb4:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
     eb8:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
     ebc:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
     ec0:	5f676966 	svcpl	0x00676966
     ec4:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
     ec8:	454f4950 	strbmi	r4, [pc, #-2384]	; 580 <_Min_Stack_Size+0x180>
     ecc:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
     ed0:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
     ed4:	2c345f4e 	ldccs	15, cr5, [r4], #-312	; 0xfffffec8
     ed8:	4f495047 	svcmi	0x00495047
     edc:	444f4d5f 	strbmi	r4, [pc], #-3423	; ee4 <_Min_Stack_Size+0xae4>
     ee0:	46415f45 	strbmi	r5, [r1], -r5, asr #30
     ee4:	504e495f 	subpl	r4, lr, pc, asr r9
     ee8:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
     eec:	5f4f4950 	svcpl	0x004f4950
     ef0:	5054554f 	subspl	r5, r4, pc, asr #10
     ef4:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
     ef8:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
     efc:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
     f00:	007d7d45 	rsbseq	r7, sp, r5, asr #26
     f04:	5f434352 	svcpl	0x00434352
     f08:	324d4954 	subcc	r4, sp, #84, 18	; 0x150000
     f0c:	4b4c435f 	blmi	1311c90 <_Min_Stack_Size+0x1311890>
     f10:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
     f14:	52282029 	eorpl	r2, r8, #41	; 0x29
     f18:	3e2d4343 	cdpcc	3, 2, cr4, cr13, cr3, {2}
     f1c:	31425041 	cmpcc	r2, r1, asr #32
     f20:	20524e45 	subscs	r4, r2, r5, asr #28
     f24:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
     f28:	303c3c31 	eorscc	r3, ip, r1, lsr ip
     f2c:	5f002929 	svcpl	0x00002929
     f30:	544c465f 	strbpl	r4, [ip], #-1631	; 0xfffff9a1
     f34:	5f583233 	svcpl	0x00583233
     f38:	5f534148 	svcpl	0x00534148
     f3c:	49464e49 	stmdbmi	r6, {r0, r3, r6, r9, sl, fp, lr}^
     f40:	5954494e 	ldmdbpl	r4, {r1, r2, r3, r6, r8, fp, lr}^
     f44:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
     f48:	4c414600 	mcrrmi	6, 0, r4, r1, cr0
     f4c:	28204553 	stmdacs	r0!, {r0, r1, r4, r6, r8, sl, lr}
     f50:	6f6f6228 	svcvs	0x006f6228
     f54:	6e61656c 	cdpvs	5, 6, cr6, cr1, cr12, {3}
     f58:	29302029 	ldmdbcs	r0!, {r0, r3, r5, sp}
     f5c:	42454400 	submi	r4, r5, #0, 8
     f60:	31204755 			; <UNDEFINED> instruction: 0x31204755
     f64:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
     f68:	46415f49 	strbmi	r5, [r1], -r9, asr #30
     f6c:	455f4f49 	ldrbmi	r4, [pc, #-3913]	; 2b <_Min_Heap_Size-0x1d5>
     f70:	43495458 	movtmi	r5, #37976	; 0x9458
     f74:	68735f52 	ldmdavs	r3!, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
     f78:	00746669 	rsbseq	r6, r4, r9, ror #12
     f7c:	43415f5f 	movtmi	r5, #8031	; 0x1f5f
     f80:	5f4d5543 	svcpl	0x004d5543
     f84:	54494246 	strbpl	r4, [r9], #-582	; 0xfffffdba
     f88:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
     f8c:	58450035 	stmdapl	r5, {r0, r2, r4, r5}^
     f90:	45504954 	ldrbmi	r4, [r0, #-2388]	; 0xfffff6ac
     f94:	45282039 	strmi	r2, [r8, #-57]!	; 0xffffffc7
     f98:	5f495458 	svcpl	0x00495458
     f9c:	4f495047 	svcmi	0x00495047
     fa0:	70614d5f 	rsbvc	r4, r1, pc, asr sp
     fa4:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
     fa8:	7b29745f 	blvc	a5e12c <_Min_Stack_Size+0xa5dd2c>
     fac:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
     fb0:	202c395f 	eorcs	r3, ip, pc, asr r9
     fb4:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
     fb8:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
     fbc:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
     fc0:	5f676966 	svcpl	0x00676966
     fc4:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
     fc8:	454f4950 	strbmi	r4, [pc, #-2384]	; 680 <_Min_Stack_Size+0x280>
     fcc:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
     fd0:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
     fd4:	2c395f4e 	ldccs	15, cr5, [r9], #-312	; 0xfffffec8
     fd8:	4f495047 	svcmi	0x00495047
     fdc:	444f4d5f 	strbmi	r4, [pc], #-3423	; fe4 <_Min_Stack_Size+0xbe4>
     fe0:	46415f45 	strbmi	r5, [r1], -r5, asr #30
     fe4:	504e495f 	subpl	r4, lr, pc, asr r9
     fe8:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
     fec:	5f4f4950 	svcpl	0x004f4950
     ff0:	5054554f 	subspl	r5, r4, pc, asr #10
     ff4:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
     ff8:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
     ffc:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    1000:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    1004:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    1008:	20364450 	eorscs	r4, r6, r0, asr r4
    100c:	54584528 	ldrbpl	r4, [r8], #-1320	; 0xfffffad8
    1010:	50475f49 	subpl	r5, r7, r9, asr #30
    1014:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; ef8 <_Min_Stack_Size+0xaf8>
    1018:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
    101c:	745f676e 	ldrbvc	r6, [pc], #-1902	; 1024 <_Min_Stack_Size+0xc24>
    1020:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
    1024:	365f4954 			; <UNDEFINED> instruction: 0x365f4954
    1028:	4728202c 	strmi	r2, [r8, -ip, lsr #32]!
    102c:	5f4f4950 	svcpl	0x004f4950
    1030:	436e6950 	cmnmi	lr, #80, 18	; 0x140000
    1034:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    1038:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    103c:	4950477b 	ldmdbmi	r0, {r0, r1, r3, r4, r5, r6, r8, r9, sl, lr}^
    1040:	472c444f 	strmi	r4, [ip, -pc, asr #8]!
    1044:	5f4f4950 	svcpl	0x004f4950
    1048:	5f4e4950 	svcpl	0x004e4950
    104c:	50472c36 	subpl	r2, r7, r6, lsr ip
    1050:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; f34 <_Min_Stack_Size+0xb34>
    1054:	5f45444f 	svcpl	0x0045444f
    1058:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    105c:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    1060:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    1064:	554f5f4f 	strbpl	r5, [pc, #-3919]	; 11d <_Min_Heap_Size-0xe3>
    1068:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    106c:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    1070:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    1074:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    1078:	5f5f007d 	svcpl	0x005f007d
    107c:	43434155 	movtmi	r4, #12629	; 0x3155
    1080:	495f4d55 	ldmdbmi	pc, {r0, r2, r4, r6, r8, sl, fp, lr}^	; <UNPREDICTABLE>
    1084:	5f544942 	svcpl	0x00544942
    1088:	3631205f 			; <UNDEFINED> instruction: 0x3631205f
    108c:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    1090:	37455049 	strbcc	r5, [r5, -r9, asr #32]
    1094:	58452820 	stmdapl	r5, {r5, fp, sp}^
    1098:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
    109c:	5f4f4950 	svcpl	0x004f4950
    10a0:	7070614d 	rsbsvc	r6, r0, sp, asr #2
    10a4:	5f676e69 	svcpl	0x00676e69
    10a8:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
    10ac:	5f495458 	svcpl	0x00495458
    10b0:	28202c37 	stmdacs	r0!, {r0, r1, r2, r4, r5, sl, fp, sp}
    10b4:	4f495047 	svcmi	0x00495047
    10b8:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    10bc:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    10c0:	745f6769 	ldrbvc	r6, [pc], #-1897	; 10c8 <_Min_Stack_Size+0xcc8>
    10c4:	50477b29 	subpl	r7, r7, r9, lsr #22
    10c8:	2c454f49 	mcrrcs	15, 4, r4, r5, cr9
    10cc:	4f495047 	svcmi	0x00495047
    10d0:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    10d4:	472c375f 			; <UNDEFINED> instruction: 0x472c375f
    10d8:	5f4f4950 	svcpl	0x004f4950
    10dc:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    10e0:	5f46415f 	svcpl	0x0046415f
    10e4:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    10e8:	50472c54 	subpl	r2, r7, r4, asr ip
    10ec:	4f5f4f49 	svcmi	0x005f4f49
    10f0:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    10f4:	50535f54 	subspl	r5, r3, r4, asr pc
    10f8:	5f444545 	svcpl	0x00444545
    10fc:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
    1100:	47007d7d 	smlsdxmi	r0, sp, sp, r7
    1104:	5f4f4950 	svcpl	0x004f4950
    1108:	5f4e4950 	svcpl	0x004e4950
    110c:	28282030 	stmdacs	r8!, {r4, r5, sp}
    1110:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    1114:	745f3631 	ldrbvc	r3, [pc], #-1585	; 111c <_Min_Stack_Size+0xd1c>
    1118:	30783029 	rsbscc	r3, r8, r9, lsr #32
    111c:	29313030 	ldmdbcs	r1!, {r4, r5, ip, sp}
    1120:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    1124:	36455049 	strbcc	r5, [r5], -r9, asr #32
    1128:	58452820 	stmdapl	r5, {r5, fp, sp}^
    112c:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
    1130:	5f4f4950 	svcpl	0x004f4950
    1134:	7070614d 	rsbsvc	r6, r0, sp, asr #2
    1138:	5f676e69 	svcpl	0x00676e69
    113c:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
    1140:	5f495458 	svcpl	0x00495458
    1144:	28202c36 	stmdacs	r0!, {r1, r2, r4, r5, sl, fp, sp}
    1148:	4f495047 	svcmi	0x00495047
    114c:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    1150:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    1154:	745f6769 	ldrbvc	r6, [pc], #-1897	; 115c <_Min_Stack_Size+0xd5c>
    1158:	50477b29 	subpl	r7, r7, r9, lsr #22
    115c:	2c454f49 	mcrrcs	15, 4, r4, r5, cr9
    1160:	4f495047 	svcmi	0x00495047
    1164:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    1168:	472c365f 			; <UNDEFINED> instruction: 0x472c365f
    116c:	5f4f4950 	svcpl	0x004f4950
    1170:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    1174:	5f46415f 	svcpl	0x0046415f
    1178:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    117c:	50472c54 	subpl	r2, r7, r4, asr ip
    1180:	4f5f4f49 	svcmi	0x005f4f49
    1184:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    1188:	50535f54 	subspl	r5, r3, r4, asr pc
    118c:	5f444545 	svcpl	0x00444545
    1190:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
    1194:	45007d7d 	strmi	r7, [r0, #-3453]	; 0xfffff283
    1198:	50495458 	subpl	r5, r9, r8, asr r4
    119c:	28203545 	stmdacs	r0!, {r0, r2, r6, r8, sl, ip, sp}
    11a0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    11a4:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    11a8:	614d5f4f 	cmpvs	sp, pc, asr #30
    11ac:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    11b0:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    11b4:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    11b8:	2c355f49 	ldccs	15, cr5, [r5], #-292	; 0xfffffedc
    11bc:	50472820 	subpl	r2, r7, r0, lsr #16
    11c0:	505f4f49 	subspl	r4, pc, r9, asr #30
    11c4:	6f436e69 	svcvs	0x00436e69
    11c8:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    11cc:	7b29745f 	blvc	a5e350 <_Min_Stack_Size+0xa5df50>
    11d0:	4f495047 	svcmi	0x00495047
    11d4:	50472c45 	subpl	r2, r7, r5, asr #24
    11d8:	505f4f49 	subspl	r4, pc, r9, asr #30
    11dc:	355f4e49 	ldrbcc	r4, [pc, #-3657]	; 39b <_Min_Heap_Size+0x19b>
    11e0:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    11e4:	4f4d5f4f 	svcmi	0x004d5f4f
    11e8:	415f4544 	cmpmi	pc, r4, asr #10
    11ec:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    11f0:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    11f4:	4f495047 	svcmi	0x00495047
    11f8:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    11fc:	5f545550 	svcpl	0x00545550
    1200:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    1204:	4f4e5f44 	svcmi	0x004e5f44
    1208:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    120c:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	; <UNPREDICTABLE>
    1210:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    1214:	36545341 	ldrbcc	r5, [r4], -r1, asr #6
    1218:	414d5f34 	cmpmi	sp, r4, lsr pc
    121c:	205f5f58 	subscs	r5, pc, r8, asr pc	; <UNPREDICTABLE>
    1220:	66377830 			; <UNDEFINED> instruction: 0x66377830
    1224:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    1228:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    122c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    1230:	4c4c6666 	mcrrmi	6, 6, r6, ip, cr6
    1234:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    1238:	3233544c 	eorscc	r5, r3, #76, 8	; 0x4c000000
    123c:	45445f58 	strbmi	r5, [r4, #-3928]	; 0xfffff0a8
    1240:	414d4943 	cmpmi	sp, r3, asr #18
    1244:	49445f4c 	stmdbmi	r4, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    1248:	205f5f47 	subscs	r5, pc, r7, asr #30
    124c:	5f003731 	svcpl	0x00003731
    1250:	4c42445f 	cfstrdmi	mvd4, [r2], {95}	; 0x5f
    1254:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    1258:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    125c:	756f6428 	strbvc	r6, [pc, #-1064]!	; e3c <_Min_Stack_Size+0xa3c>
    1260:	29656c62 	stmdbcs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    1264:	32322e32 	eorscc	r2, r2, #800	; 0x320
    1268:	33373035 	teqcc	r7, #53	; 0x35
    126c:	35383538 	ldrcc	r3, [r8, #-1336]!	; 0xfffffac8
    1270:	30323730 	eorscc	r3, r2, r0, lsr r7
    1274:	2d653431 	cfstrdcs	mvd3, [r5, #-196]!	; 0xffffff3c
    1278:	4c383033 	ldcmi	0, cr3, [r8], #-204	; 0xffffff34
    127c:	5f5f0029 	svcpl	0x005f0029
    1280:	33544c46 	cmpcc	r4, #17920	; 0x4600
    1284:	485f5832 	ldmdami	pc, {r1, r4, r5, fp, ip, lr}^	; <UNPREDICTABLE>
    1288:	515f5341 	cmppl	pc, r1, asr #6
    128c:	54454955 	strbpl	r4, [r5], #-2389	; 0xfffff6ab
    1290:	4e414e5f 	mcrmi	14, 2, r4, cr1, cr15, {2}
    1294:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    1298:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    129c:	32455049 	subcc	r5, r5, #73	; 0x49
    12a0:	58452820 	stmdapl	r5, {r5, fp, sp}^
    12a4:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
    12a8:	5f4f4950 	svcpl	0x004f4950
    12ac:	7070614d 	rsbsvc	r6, r0, sp, asr #2
    12b0:	5f676e69 	svcpl	0x00676e69
    12b4:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
    12b8:	5f495458 	svcpl	0x00495458
    12bc:	28202c32 	stmdacs	r0!, {r1, r4, r5, sl, fp, sp}
    12c0:	4f495047 	svcmi	0x00495047
    12c4:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    12c8:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    12cc:	745f6769 	ldrbvc	r6, [pc], #-1897	; 12d4 <_Min_Stack_Size+0xed4>
    12d0:	50477b29 	subpl	r7, r7, r9, lsr #22
    12d4:	2c454f49 	mcrrcs	15, 4, r4, r5, cr9
    12d8:	4f495047 	svcmi	0x00495047
    12dc:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    12e0:	472c325f 			; <UNDEFINED> instruction: 0x472c325f
    12e4:	5f4f4950 	svcpl	0x004f4950
    12e8:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    12ec:	5f46415f 	svcpl	0x0046415f
    12f0:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    12f4:	50472c54 	subpl	r2, r7, r4, asr ip
    12f8:	4f5f4f49 	svcmi	0x005f4f49
    12fc:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    1300:	50535f54 	subspl	r5, r3, r4, asr pc
    1304:	5f444545 	svcpl	0x00444545
    1308:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
    130c:	47007d7d 	smlsdxmi	r0, sp, sp, r7
    1310:	5f4f4950 	svcpl	0x004f4950
    1314:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    1318:	5f46415f 	svcpl	0x0046415f
    131c:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    1320:	00382054 	eorseq	r2, r8, r4, asr r0
    1324:	49535f5f 	ldmdbmi	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    1328:	575f455a 			; <UNDEFINED> instruction: 0x575f455a
    132c:	48544449 	ldmdami	r4, {r0, r3, r6, sl, lr}^
    1330:	33205f5f 			; <UNDEFINED> instruction: 0x33205f5f
    1334:	5f5f0032 	svcpl	0x005f0032
    1338:	31434544 	cmpcc	r3, r4, asr #10
    133c:	4d5f3832 	ldclmi	8, cr3, [pc, #-200]	; 127c <_Min_Stack_Size+0xe7c>
    1340:	455f4e49 	ldrbmi	r4, [pc, #-3657]	; 4ff <_Min_Stack_Size+0xff>
    1344:	5f5f5058 	svcpl	0x005f5058
    1348:	362d2820 	strtcc	r2, [sp], -r0, lsr #16
    134c:	29323431 	ldmdbcs	r2!, {r0, r4, r5, sl, ip, sp}
    1350:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	; <UNPREDICTABLE>
    1354:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    1358:	38545341 	ldmdacc	r4, {r0, r6, r8, r9, ip, lr}^
    135c:	5059545f 	subspl	r5, r9, pc, asr r4
    1360:	205f5f45 	subscs	r5, pc, r5, asr #30
    1364:	00746e69 	rsbseq	r6, r4, r9, ror #28
    1368:	44555f5f 	ldrbmi	r5, [r5], #-3935	; 0xfffff0a1
    136c:	42465f41 	submi	r5, r6, #260	; 0x104
    1370:	5f5f5449 	svcpl	0x005f5449
    1374:	00323320 	eorseq	r3, r2, r0, lsr #6
    1378:	334d4954 	movtcc	r4, #55636	; 0xd954
    137c:	5341425f 	movtpl	r4, #4703	; 0x125f
    1380:	78302045 	ldmdavc	r0!, {r0, r2, r6, sp}
    1384:	30303034 	eorscc	r3, r0, r4, lsr r0
    1388:	30303430 	eorscc	r3, r0, r0, lsr r4
    138c:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    1390:	3436544c 	ldrtcc	r5, [r6], #-1100	; 0xfffffbb4
    1394:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    1398:	5f30315f 	svcpl	0x0030315f
    139c:	5f505845 	svcpl	0x00505845
    13a0:	3033205f 	eorscc	r2, r3, pc, asr r0
    13a4:	58450038 	stmdapl	r5, {r3, r4, r5}^
    13a8:	43504954 	cmpmi	r0, #84, 18	; 0x150000
    13ac:	45282037 	strmi	r2, [r8, #-55]!	; 0xffffffc9
    13b0:	5f495458 	svcpl	0x00495458
    13b4:	4f495047 	svcmi	0x00495047
    13b8:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    13bc:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    13c0:	7b29745f 	blvc	a5e544 <_Min_Stack_Size+0xa5e144>
    13c4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    13c8:	202c375f 	eorcs	r3, ip, pc, asr r7
    13cc:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    13d0:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    13d4:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    13d8:	5f676966 	svcpl	0x00676966
    13dc:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    13e0:	434f4950 	movtmi	r4, #63824	; 0xf950
    13e4:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    13e8:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    13ec:	2c375f4e 	ldccs	15, cr5, [r7], #-312	; 0xfffffec8
    13f0:	4f495047 	svcmi	0x00495047
    13f4:	444f4d5f 	strbmi	r4, [pc], #-3423	; 13fc <_Min_Stack_Size+0xffc>
    13f8:	46415f45 	strbmi	r5, [r1], -r5, asr #30
    13fc:	504e495f 	subpl	r4, lr, pc, asr r9
    1400:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
    1404:	5f4f4950 	svcpl	0x004f4950
    1408:	5054554f 	subspl	r5, r4, pc, asr #10
    140c:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    1410:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
    1414:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    1418:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    141c:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    1420:	414d544e 	cmpmi	sp, lr, asr #8
    1424:	28435f58 	stmdacs	r3, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    1428:	63202963 			; <UNDEFINED> instruction: 0x63202963
    142c:	20232320 	eorcs	r2, r3, r0, lsr #6
    1430:	004c4c55 	subeq	r4, ip, r5, asr ip
    1434:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    1438:	20394450 	eorscs	r4, r9, r0, asr r4
    143c:	54584528 	ldrbpl	r4, [r8], #-1320	; 0xfffffad8
    1440:	50475f49 	subpl	r5, r7, r9, asr #30
    1444:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 1328 <_Min_Stack_Size+0xf28>
    1448:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
    144c:	745f676e 	ldrbvc	r6, [pc], #-1902	; 1454 <_Min_Stack_Size+0x1054>
    1450:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
    1454:	395f4954 	ldmdbcc	pc, {r2, r4, r6, r8, fp, lr}^	; <UNPREDICTABLE>
    1458:	4728202c 	strmi	r2, [r8, -ip, lsr #32]!
    145c:	5f4f4950 	svcpl	0x004f4950
    1460:	436e6950 	cmnmi	lr, #80, 18	; 0x140000
    1464:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    1468:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    146c:	4950477b 	ldmdbmi	r0, {r0, r1, r3, r4, r5, r6, r8, r9, sl, lr}^
    1470:	472c444f 	strmi	r4, [ip, -pc, asr #8]!
    1474:	5f4f4950 	svcpl	0x004f4950
    1478:	5f4e4950 	svcpl	0x004e4950
    147c:	50472c39 	subpl	r2, r7, r9, lsr ip
    1480:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 1364 <_Min_Stack_Size+0xf64>
    1484:	5f45444f 	svcpl	0x0045444f
    1488:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    148c:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    1490:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    1494:	554f5f4f 	strbpl	r5, [pc, #-3919]	; 54d <_Min_Stack_Size+0x14d>
    1498:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    149c:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    14a0:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    14a4:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    14a8:	5f5f007d 	svcpl	0x005f007d
    14ac:	455a4953 	ldrbmi	r4, [sl, #-2387]	; 0xfffff6ad
    14b0:	505f464f 	subspl	r4, pc, pc, asr #12
    14b4:	544e494f 	strbpl	r4, [lr], #-2383	; 0xfffff6b1
    14b8:	5f5f5245 	svcpl	0x005f5245
    14bc:	5f003420 	svcpl	0x00003420
    14c0:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
    14c4:	41454c5f 	cmpmi	r5, pc, asr ip
    14c8:	5f385453 	svcpl	0x00385453
    14cc:	45505954 	ldrbmi	r5, [r0, #-2388]	; 0xfffff6ac
    14d0:	73205f5f 			; <UNDEFINED> instruction: 0x73205f5f
    14d4:	656e6769 	strbvs	r6, [lr, #-1897]!	; 0xfffff897
    14d8:	68632064 	stmdavs	r3!, {r2, r5, r6, sp}^
    14dc:	45007261 	strmi	r7, [r0, #-609]	; 0xfffffd9f
    14e0:	50495458 	subpl	r5, r9, r8, asr r4
    14e4:	28203744 	stmdacs	r0!, {r2, r6, r8, r9, sl, ip, sp}
    14e8:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    14ec:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    14f0:	614d5f4f 	cmpvs	sp, pc, asr #30
    14f4:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    14f8:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    14fc:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    1500:	2c375f49 	ldccs	15, cr5, [r7], #-292	; 0xfffffedc
    1504:	50472820 	subpl	r2, r7, r0, lsr #16
    1508:	505f4f49 	subspl	r4, pc, r9, asr #30
    150c:	6f436e69 	svcvs	0x00436e69
    1510:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    1514:	7b29745f 	blvc	a5e698 <_Min_Stack_Size+0xa5e298>
    1518:	4f495047 	svcmi	0x00495047
    151c:	50472c44 	subpl	r2, r7, r4, asr #24
    1520:	505f4f49 	subspl	r4, pc, r9, asr #30
    1524:	375f4e49 	ldrbcc	r4, [pc, -r9, asr #28]
    1528:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    152c:	4f4d5f4f 	svcmi	0x004d5f4f
    1530:	415f4544 	cmpmi	pc, r4, asr #10
    1534:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    1538:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    153c:	4f495047 	svcmi	0x00495047
    1540:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    1544:	5f545550 	svcpl	0x00545550
    1548:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    154c:	4f4e5f44 	svcmi	0x004e5f44
    1550:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    1554:	475f5f00 	ldrbmi	r5, [pc, -r0, lsl #30]
    1558:	415f4343 	cmpmi	pc, r3, asr #6
    155c:	494d4f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, lr}^
    1560:	4f425f43 	svcmi	0x00425f43
    1564:	4c5f4c4f 	mrrcmi	12, 4, r4, pc, cr15	; <UNPREDICTABLE>
    1568:	5f4b434f 	svcpl	0x004b434f
    156c:	45455246 	strbmi	r5, [r5, #-582]	; 0xfffffdba
    1570:	5f003220 	svcpl	0x00003220
    1574:	4343475f 	movtmi	r4, #14175	; 0x375f
    1578:	5641485f 			; <UNDEFINED> instruction: 0x5641485f
    157c:	57445f45 	strbpl	r5, [r4, -r5, asr #30]
