mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    1580:	32465241 	subcc	r5, r6, #268435460	; 0x10000004
    1584:	4946435f 	stmdbmi	r6, {r0, r1, r2, r3, r4, r6, r8, r9, lr}^
    1588:	4d53415f 	ldfmie	f4, [r3, #-380]	; 0xfffffe84
    158c:	45003120 	strmi	r3, [r0, #-288]	; 0xfffffee0
    1590:	50495458 	subpl	r5, r9, r8, asr r4
    1594:	28203544 	stmdacs	r0!, {r2, r6, r8, sl, ip, sp}
    1598:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    159c:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    15a0:	614d5f4f 	cmpvs	sp, pc, asr #30
    15a4:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    15a8:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    15ac:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    15b0:	2c355f49 	ldccs	15, cr5, [r5], #-292	; 0xfffffedc
    15b4:	50472820 	subpl	r2, r7, r0, lsr #16
    15b8:	505f4f49 	subspl	r4, pc, r9, asr #30
    15bc:	6f436e69 	svcvs	0x00436e69
    15c0:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    15c4:	7b29745f 	blvc	a5e748 <_Min_Stack_Size+0xa5e348>
    15c8:	4f495047 	svcmi	0x00495047
    15cc:	50472c44 	subpl	r2, r7, r4, asr #24
    15d0:	505f4f49 	subspl	r4, pc, r9, asr #30
    15d4:	355f4e49 	ldrbcc	r4, [pc, #-3657]	; 793 <_Min_Stack_Size+0x393>
    15d8:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    15dc:	4f4d5f4f 	svcmi	0x004d5f4f
    15e0:	415f4544 	cmpmi	pc, r4, asr #10
    15e4:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    15e8:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    15ec:	4f495047 	svcmi	0x00495047
    15f0:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    15f4:	5f545550 	svcpl	0x00545550
    15f8:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    15fc:	4f4e5f44 	svcmi	0x004e5f44
    1600:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    1604:	43435200 	movtmi	r5, #12800	; 0x3200
    1608:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    160c:	435f454f 	cmpmi	pc, #331350016	; 0x13c00000
    1610:	455f4b4c 	ldrbmi	r4, [pc, #-2892]	; acc <_Min_Stack_Size+0x6cc>
    1614:	2029284e 	eorcs	r2, r9, lr, asr #16
    1618:	43435228 	movtmi	r5, #12840	; 0x3228
    161c:	50413e2d 	subpl	r3, r1, sp, lsr #28
    1620:	4e453242 	cdpmi	2, 4, cr3, cr5, cr2, {2}
    1624:	3d7c2052 	ldclcc	0, cr2, [ip, #-328]!	; 0xfffffeb8
    1628:	3c312820 	ldccc	8, cr2, [r1], #-128	; 0xffffff80
    162c:	2929363c 	stmdbcs	r9!, {r2, r3, r4, r5, r9, sl, ip, sp}
    1630:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    1634:	34445049 	strbcc	r5, [r4], #-73	; 0xffffffb7
    1638:	58452820 	stmdapl	r5, {r5, fp, sp}^
    163c:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
    1640:	5f4f4950 	svcpl	0x004f4950
    1644:	7070614d 	rsbsvc	r6, r0, sp, asr #2
    1648:	5f676e69 	svcpl	0x00676e69
    164c:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
    1650:	5f495458 	svcpl	0x00495458
    1654:	28202c34 	stmdacs	r0!, {r2, r4, r5, sl, fp, sp}
    1658:	4f495047 	svcmi	0x00495047
    165c:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    1660:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    1664:	745f6769 	ldrbvc	r6, [pc], #-1897	; 166c <_Min_Stack_Size+0x126c>
    1668:	50477b29 	subpl	r7, r7, r9, lsr #22
    166c:	2c444f49 	mcrrcs	15, 4, r4, r4, cr9
    1670:	4f495047 	svcmi	0x00495047
    1674:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    1678:	472c345f 			; <UNDEFINED> instruction: 0x472c345f
    167c:	5f4f4950 	svcpl	0x004f4950
    1680:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    1684:	5f46415f 	svcpl	0x0046415f
    1688:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    168c:	50472c54 	subpl	r2, r7, r4, asr ip
    1690:	4f5f4f49 	svcmi	0x005f4f49
    1694:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    1698:	50535f54 	subspl	r5, r3, r4, asr pc
    169c:	5f444545 	svcpl	0x00444545
    16a0:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
    16a4:	5f007d7d 	svcpl	0x00007d7d
    16a8:	4d52415f 	ldfmie	f4, [r2, #-380]	; 0xfffffe84
    16ac:	4f454e5f 	svcmi	0x00454e5f
    16b0:	005f5f4e 	subseq	r5, pc, lr, asr #30
    16b4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    16b8:	20324450 	eorscs	r4, r2, r0, asr r4
    16bc:	54584528 	ldrbpl	r4, [r8], #-1320	; 0xfffffad8
    16c0:	50475f49 	subpl	r5, r7, r9, asr #30
    16c4:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 15a8 <_Min_Stack_Size+0x11a8>
    16c8:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
    16cc:	745f676e 	ldrbvc	r6, [pc], #-1902	; 16d4 <_Min_Stack_Size+0x12d4>
    16d0:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
    16d4:	325f4954 	subscc	r4, pc, #84, 18	; 0x150000
    16d8:	4728202c 	strmi	r2, [r8, -ip, lsr #32]!
    16dc:	5f4f4950 	svcpl	0x004f4950
    16e0:	436e6950 	cmnmi	lr, #80, 18	; 0x140000
    16e4:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    16e8:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    16ec:	4950477b 	ldmdbmi	r0, {r0, r1, r3, r4, r5, r6, r8, r9, sl, lr}^
    16f0:	472c444f 	strmi	r4, [ip, -pc, asr #8]!
    16f4:	5f4f4950 	svcpl	0x004f4950
    16f8:	5f4e4950 	svcpl	0x004e4950
    16fc:	50472c32 	subpl	r2, r7, r2, lsr ip
    1700:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 15e4 <_Min_Stack_Size+0x11e4>
    1704:	5f45444f 	svcpl	0x0045444f
    1708:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    170c:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    1710:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    1714:	554f5f4f 	strbpl	r5, [pc, #-3919]	; 7cd <_Min_Stack_Size+0x3cd>
    1718:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    171c:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    1720:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    1724:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    1728:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
    172c:	44504954 	ldrbmi	r4, [r0], #-2388	; 0xfffff6ac
    1730:	45282031 	strmi	r2, [r8, #-49]!	; 0xffffffcf
    1734:	5f495458 	svcpl	0x00495458
    1738:	4f495047 	svcmi	0x00495047
    173c:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    1740:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    1744:	7b29745f 	blvc	a5e8c8 <_Min_Stack_Size+0xa5e4c8>
    1748:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    174c:	202c315f 	eorcs	r3, ip, pc, asr r1
    1750:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    1754:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    1758:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    175c:	5f676966 	svcpl	0x00676966
    1760:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    1764:	444f4950 	strbmi	r4, [pc], #-2384	; 176c <_Min_Stack_Size+0x136c>
    1768:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    176c:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    1770:	2c315f4e 	ldccs	15, cr5, [r1], #-312	; 0xfffffec8
    1774:	4f495047 	svcmi	0x00495047
    1778:	444f4d5f 	strbmi	r4, [pc], #-3423	; 1780 <_Min_Stack_Size+0x1380>
    177c:	46415f45 	strbmi	r5, [r1], -r5, asr #30
    1780:	504e495f 	subpl	r4, lr, pc, asr r9
    1784:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
    1788:	5f4f4950 	svcpl	0x004f4950
    178c:	5054554f 	subspl	r5, r4, pc, asr #10
    1790:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    1794:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
    1798:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    179c:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    17a0:	48545f5f 	ldmdami	r4, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    17a4:	5f424d55 	svcpl	0x00424d55
    17a8:	45544e49 	ldrbmi	r4, [r4, #-3657]	; 0xfffff1b7
    17ac:	524f5752 	subpl	r5, pc, #21495808	; 0x1480000
    17b0:	205f5f4b 	subscs	r5, pc, fp, asr #30
    17b4:	5f5f0031 	svcpl	0x005f0031
    17b8:	464c4c55 			; <UNDEFINED> instruction: 0x464c4c55
    17bc:	54434152 	strbpl	r4, [r3], #-338	; 0xfffffeae
    17c0:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    17c4:	30205f5f 	eorcc	r5, r0, pc, asr pc
    17c8:	46464658 			; <UNDEFINED> instruction: 0x46464658
    17cc:	46464646 	strbmi	r4, [r6], -r6, asr #12
    17d0:	46464646 	strbmi	r4, [r6], -r6, asr #12
    17d4:	46464646 	strbmi	r4, [r6], -r6, asr #12
    17d8:	362d5046 	strtcc	r5, [sp], -r6, asr #32
    17dc:	4c4c5534 	cfstr64mi	mvdx5, [ip], {52}	; 0x34
    17e0:	58450052 	stmdapl	r5, {r1, r4, r6}^
    17e4:	505f4954 	subspl	r4, pc, r4, asr r9	; <UNPREDICTABLE>
    17e8:	6f436e69 	svcvs	0x00436e69
    17ec:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    17f0:	00727450 	rsbseq	r7, r2, r0, asr r4
    17f4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    17f8:	33314350 	teqcc	r1, #80, 6	; 0x40000001
    17fc:	58452820 	stmdapl	r5, {r5, fp, sp}^
    1800:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
    1804:	5f4f4950 	svcpl	0x004f4950
    1808:	7070614d 	rsbsvc	r6, r0, sp, asr #2
    180c:	5f676e69 	svcpl	0x00676e69
    1810:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
    1814:	5f495458 	svcpl	0x00495458
    1818:	282c3331 	stmdacs	ip!, {r0, r4, r5, r8, r9, ip, sp}
    181c:	4f495047 	svcmi	0x00495047
    1820:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    1824:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    1828:	745f6769 	ldrbvc	r6, [pc], #-1897	; 1830 <_Min_Stack_Size+0x1430>
    182c:	50477b29 	subpl	r7, r7, r9, lsr #22
    1830:	2c434f49 	mcrrcs	15, 4, r4, r3, cr9
    1834:	4f495047 	svcmi	0x00495047
    1838:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    183c:	2c33315f 	ldfcss	f3, [r3], #-380	; 0xfffffe84
    1840:	4f495047 	svcmi	0x00495047
    1844:	444f4d5f 	strbmi	r4, [pc], #-3423	; 184c <_Min_Stack_Size+0x144c>
    1848:	46415f45 	strbmi	r5, [r1], -r5, asr #30
    184c:	504e495f 	subpl	r4, lr, pc, asr r9
    1850:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
    1854:	5f4f4950 	svcpl	0x004f4950
    1858:	5054554f 	subspl	r5, r4, pc, asr #10
    185c:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    1860:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
    1864:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    1868:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    186c:	52535452 	subspl	r5, r3, #1375731712	; 0x52000000
    1870:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    1874:	38435049 	stmdacc	r3, {r0, r3, r6, ip, lr}^
    1878:	58452820 	stmdapl	r5, {r5, fp, sp}^
    187c:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
    1880:	5f4f4950 	svcpl	0x004f4950
    1884:	7070614d 	rsbsvc	r6, r0, sp, asr #2
    1888:	5f676e69 	svcpl	0x00676e69
    188c:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
    1890:	5f495458 	svcpl	0x00495458
    1894:	28202c38 	stmdacs	r0!, {r3, r4, r5, sl, fp, sp}
    1898:	4f495047 	svcmi	0x00495047
    189c:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    18a0:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    18a4:	745f6769 	ldrbvc	r6, [pc], #-1897	; 18ac <_Min_Stack_Size+0x14ac>
    18a8:	50477b29 	subpl	r7, r7, r9, lsr #22
    18ac:	2c434f49 	mcrrcs	15, 4, r4, r3, cr9
    18b0:	4f495047 	svcmi	0x00495047
    18b4:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    18b8:	472c385f 			; <UNDEFINED> instruction: 0x472c385f
    18bc:	5f4f4950 	svcpl	0x004f4950
    18c0:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    18c4:	5f46415f 	svcpl	0x0046415f
    18c8:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    18cc:	50472c54 	subpl	r2, r7, r4, asr ip
    18d0:	4f5f4f49 	svcmi	0x005f4f49
    18d4:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    18d8:	50535f54 	subspl	r5, r3, r4, asr pc
    18dc:	5f444545 	svcpl	0x00444545
    18e0:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
    18e4:	5f007d7d 	svcpl	0x00007d7d
    18e8:	544c465f 	strbpl	r4, [ip], #-1631	; 0xfffff9a1
    18ec:	5f583233 	svcpl	0x00583233
    18f0:	5f4e494d 	svcpl	0x004e494d
    18f4:	455f3031 	ldrbmi	r3, [pc, #-49]	; 18cb <_Min_Stack_Size+0x14cb>
    18f8:	5f5f5058 	svcpl	0x005f5058
    18fc:	332d2820 			; <UNDEFINED> instruction: 0x332d2820
    1900:	00293730 	eoreq	r3, r9, r0, lsr r7
    1904:	32433249 	subcc	r3, r3, #-1879048188	; 0x90000004
    1908:	49282820 	stmdbmi	r8!, {r5, fp, sp}
    190c:	545f4332 	ldrbpl	r4, [pc], #-818	; 1914 <_Min_Stack_Size+0x1514>
    1910:	64657079 	strbtvs	r7, [r5], #-121	; 0xffffff87
    1914:	292a6665 	stmdbcs	sl!, {r0, r2, r5, r6, r9, sl, sp, lr}
    1918:	32433249 	subcc	r3, r3, #-1879048188	; 0x90000004
    191c:	5341425f 	movtpl	r4, #4703	; 0x125f
    1920:	5f002945 	svcpl	0x00002945
    1924:	4148435f 	cmpmi	r8, pc, asr r3
    1928:	5f323352 	svcpl	0x00323352
    192c:	45505954 	ldrbmi	r5, [r0, #-2388]	; 0xfffff6ac
    1930:	6c205f5f 	stcvs	15, cr5, [r0], #-380	; 0xfffffe84
    1934:	20676e6f 	rsbcs	r6, r7, pc, ror #28
    1938:	69736e75 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, sl, fp, sp, lr}^
    193c:	64656e67 	strbtvs	r6, [r5], #-3687	; 0xfffff199
    1940:	746e6920 	strbtvc	r6, [lr], #-2336	; 0xfffff6e0
    1944:	415f5f00 	cmpmi	pc, r0, lsl #30
    1948:	465f4d52 			; <UNDEFINED> instruction: 0x465f4d52
    194c:	55544145 	ldrbpl	r4, [r4, #-325]	; 0xfffffebb
    1950:	465f4552 			; <UNDEFINED> instruction: 0x465f4552
    1954:	5f363150 	svcpl	0x00363150
    1958:	54434556 	strbpl	r4, [r3], #-1366	; 0xfffffaaa
    195c:	415f524f 	cmpmi	pc, pc, asr #4
    1960:	48544952 	ldmdami	r4, {r1, r4, r6, r8, fp, lr}^
    1964:	4954454d 	ldmdbmi	r4, {r0, r2, r3, r6, r8, sl, lr}^
    1968:	58450043 	stmdapl	r5, {r0, r1, r6}^
    196c:	43504954 	cmpmi	r0, #84, 18	; 0x150000
    1970:	45282036 	strmi	r2, [r8, #-54]!	; 0xffffffca
    1974:	5f495458 	svcpl	0x00495458
    1978:	4f495047 	svcmi	0x00495047
    197c:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    1980:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    1984:	7b29745f 	blvc	a5eb08 <_Min_Stack_Size+0xa5e708>
    1988:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    198c:	202c365f 	eorcs	r3, ip, pc, asr r6
    1990:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    1994:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    1998:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    199c:	5f676966 	svcpl	0x00676966
    19a0:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    19a4:	434f4950 	movtmi	r4, #63824	; 0xf950
    19a8:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    19ac:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    19b0:	2c365f4e 	ldccs	15, cr5, [r6], #-312	; 0xfffffec8
    19b4:	4f495047 	svcmi	0x00495047
    19b8:	444f4d5f 	strbmi	r4, [pc], #-3423	; 19c0 <_Min_Stack_Size+0x15c0>
    19bc:	46415f45 	strbmi	r5, [r1], -r5, asr #30
    19c0:	504e495f 	subpl	r4, lr, pc, asr r9
    19c4:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
    19c8:	5f4f4950 	svcpl	0x004f4950
    19cc:	5054554f 	subspl	r5, r4, pc, asr #10
    19d0:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    19d4:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
    19d8:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    19dc:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    19e0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    19e4:	20354350 	eorscs	r4, r5, r0, asr r3
    19e8:	54584528 	ldrbpl	r4, [r8], #-1320	; 0xfffffad8
    19ec:	50475f49 	subpl	r5, r7, r9, asr #30
    19f0:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 18d4 <_Min_Stack_Size+0x14d4>
    19f4:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
    19f8:	745f676e 	ldrbvc	r6, [pc], #-1902	; 1a00 <_Min_Stack_Size+0x1600>
    19fc:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
    1a00:	355f4954 	ldrbcc	r4, [pc, #-2388]	; 10b4 <_Min_Stack_Size+0xcb4>
    1a04:	4728202c 	strmi	r2, [r8, -ip, lsr #32]!
    1a08:	5f4f4950 	svcpl	0x004f4950
    1a0c:	436e6950 	cmnmi	lr, #80, 18	; 0x140000
    1a10:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    1a14:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    1a18:	4950477b 	ldmdbmi	r0, {r0, r1, r3, r4, r5, r6, r8, r9, sl, lr}^
    1a1c:	472c434f 	strmi	r4, [ip, -pc, asr #6]!
    1a20:	5f4f4950 	svcpl	0x004f4950
    1a24:	5f4e4950 	svcpl	0x004e4950
    1a28:	50472c35 	subpl	r2, r7, r5, lsr ip
    1a2c:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 1910 <_Min_Stack_Size+0x1510>
    1a30:	5f45444f 	svcpl	0x0045444f
    1a34:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    1a38:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    1a3c:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    1a40:	554f5f4f 	strbpl	r5, [pc, #-3919]	; af9 <_Min_Stack_Size+0x6f9>
    1a44:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    1a48:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    1a4c:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    1a50:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    1a54:	5f5f007d 	svcpl	0x005f007d
    1a58:	544e4955 	strbpl	r4, [lr], #-2389	; 0xfffff6ab
    1a5c:	5341465f 	movtpl	r4, #5727	; 0x165f
    1a60:	5f323354 	svcpl	0x00323354
    1a64:	5f58414d 	svcpl	0x0058414d
    1a68:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    1a6c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    1a70:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    1a74:	58450055 	stmdapl	r5, {r0, r2, r4, r6}^
    1a78:	43504954 	cmpmi	r0, #84, 18	; 0x150000
    1a7c:	45282033 	strmi	r2, [r8, #-51]!	; 0xffffffcd
    1a80:	5f495458 	svcpl	0x00495458
    1a84:	4f495047 	svcmi	0x00495047
    1a88:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    1a8c:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    1a90:	7b29745f 	blvc	a5ec14 <_Min_Stack_Size+0xa5e814>
    1a94:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    1a98:	202c335f 	eorcs	r3, ip, pc, asr r3
    1a9c:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    1aa0:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    1aa4:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    1aa8:	5f676966 	svcpl	0x00676966
    1aac:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    1ab0:	434f4950 	movtmi	r4, #63824	; 0xf950
    1ab4:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    1ab8:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    1abc:	2c335f4e 	ldccs	15, cr5, [r3], #-312	; 0xfffffec8
    1ac0:	4f495047 	svcmi	0x00495047
    1ac4:	444f4d5f 	strbmi	r4, [pc], #-3423	; 1acc <_Min_Stack_Size+0x16cc>
    1ac8:	46415f45 	strbmi	r5, [r1], -r5, asr #30
    1acc:	504e495f 	subpl	r4, lr, pc, asr r9
    1ad0:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
    1ad4:	5f4f4950 	svcpl	0x004f4950
    1ad8:	5054554f 	subspl	r5, r4, pc, asr #10
    1adc:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    1ae0:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
    1ae4:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    1ae8:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    1aec:	49535f5f 	ldmdbmi	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    1af0:	464f455a 			; <UNDEFINED> instruction: 0x464f455a
    1af4:	4e4f4c5f 	mcrmi	12, 2, r4, cr15, cr15, {2}
    1af8:	205f5f47 	subscs	r5, pc, r7, asr #30
    1afc:	58450034 	stmdapl	r5, {r2, r4, r5}^
    1b00:	43504954 	cmpmi	r0, #84, 18	; 0x150000
    1b04:	45282032 	strmi	r2, [r8, #-50]!	; 0xffffffce
    1b08:	5f495458 	svcpl	0x00495458
    1b0c:	4f495047 	svcmi	0x00495047
    1b10:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    1b14:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    1b18:	7b29745f 	blvc	a5ec9c <_Min_Stack_Size+0xa5e89c>
    1b1c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    1b20:	202c325f 	eorcs	r3, ip, pc, asr r2
    1b24:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    1b28:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    1b2c:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    1b30:	5f676966 	svcpl	0x00676966
    1b34:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    1b38:	434f4950 	movtmi	r4, #63824	; 0xf950
    1b3c:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    1b40:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    1b44:	2c325f4e 	ldccs	15, cr5, [r2], #-312	; 0xfffffec8
    1b48:	4f495047 	svcmi	0x00495047
    1b4c:	444f4d5f 	strbmi	r4, [pc], #-3423	; 1b54 <_Min_Stack_Size+0x1754>
    1b50:	46415f45 	strbmi	r5, [r1], -r5, asr #30
    1b54:	504e495f 	subpl	r4, lr, pc, asr r9
    1b58:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
    1b5c:	5f4f4950 	svcpl	0x004f4950
    1b60:	5054554f 	subspl	r5, r4, pc, asr #10
    1b64:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    1b68:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
    1b6c:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    1b70:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    1b74:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    1b78:	20314350 	eorscs	r4, r1, r0, asr r3
    1b7c:	54584528 	ldrbpl	r4, [r8], #-1320	; 0xfffffad8
    1b80:	50475f49 	subpl	r5, r7, r9, asr #30
    1b84:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 1a68 <_Min_Stack_Size+0x1668>
    1b88:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
    1b8c:	745f676e 	ldrbvc	r6, [pc], #-1902	; 1b94 <_Min_Stack_Size+0x1794>
    1b90:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
    1b94:	315f4954 	cmpcc	pc, r4, asr r9	; <UNPREDICTABLE>
    1b98:	4728202c 	strmi	r2, [r8, -ip, lsr #32]!
    1b9c:	5f4f4950 	svcpl	0x004f4950
    1ba0:	436e6950 	cmnmi	lr, #80, 18	; 0x140000
    1ba4:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    1ba8:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    1bac:	4950477b 	ldmdbmi	r0, {r0, r1, r3, r4, r5, r6, r8, r9, sl, lr}^
    1bb0:	472c434f 	strmi	r4, [ip, -pc, asr #6]!
    1bb4:	5f4f4950 	svcpl	0x004f4950
    1bb8:	5f4e4950 	svcpl	0x004e4950
    1bbc:	50472c31 	subpl	r2, r7, r1, lsr ip
    1bc0:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 1aa4 <_Min_Stack_Size+0x16a4>
    1bc4:	5f45444f 	svcpl	0x0045444f
    1bc8:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    1bcc:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    1bd0:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    1bd4:	554f5f4f 	strbpl	r5, [pc, #-3919]	; c8d <_Min_Stack_Size+0x88d>
    1bd8:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    1bdc:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    1be0:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    1be4:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    1be8:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
    1bec:	43504954 	cmpmi	r0, #84, 18	; 0x150000
    1bf0:	45282030 	strmi	r2, [r8, #-48]!	; 0xffffffd0
    1bf4:	5f495458 	svcpl	0x00495458
    1bf8:	4f495047 	svcmi	0x00495047
    1bfc:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    1c00:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    1c04:	7b29745f 	blvc	a5ed88 <_Min_Stack_Size+0xa5e988>
    1c08:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    1c0c:	202c305f 	eorcs	r3, ip, pc, asr r0
    1c10:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    1c14:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    1c18:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    1c1c:	5f676966 	svcpl	0x00676966
    1c20:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    1c24:	434f4950 	movtmi	r4, #63824	; 0xf950
    1c28:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    1c2c:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    1c30:	2c305f4e 	ldccs	15, cr5, [r0], #-312	; 0xfffffec8
    1c34:	4f495047 	svcmi	0x00495047
    1c38:	444f4d5f 	strbmi	r4, [pc], #-3423	; 1c40 <_Min_Stack_Size+0x1840>
    1c3c:	46415f45 	strbmi	r5, [r1], -r5, asr #30
    1c40:	504e495f 	subpl	r4, lr, pc, asr r9
    1c44:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
    1c48:	5f4f4950 	svcpl	0x004f4950
    1c4c:	5054554f 	subspl	r5, r4, pc, asr #10
    1c50:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    1c54:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
    1c58:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    1c5c:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    1c60:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
    1c64:	5458455f 	ldrbpl	r4, [r8], #-1375	; 0xfffffaa1
    1c68:	6e495f49 	cdpvs	15, 4, cr5, cr9, cr9, {2}
    1c6c:	54007469 	strpl	r7, [r0], #-1129	; 0xfffffb97
    1c70:	20334d49 	eorscs	r4, r3, r9, asr #26
    1c74:	50472828 	subpl	r2, r7, r8, lsr #16
    1c78:	545f4d54 	ldrbpl	r4, [pc], #-3412	; 1c80 <_Min_Stack_Size+0x1880>
    1c7c:	64657079 	strbtvs	r7, [r5], #-121	; 0xffffff87
    1c80:	292a6665 	stmdbcs	sl!, {r0, r2, r5, r6, r9, sl, sp, lr}
