mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    1c84:	334d4954 	movtcc	r4, #55636	; 0xd954
    1c88:	5341425f 	movtpl	r4, #4703	; 0x125f
    1c8c:	5f002945 	svcpl	0x00002945
    1c90:	5a49535f 	bpl	1256a14 <_Min_Stack_Size+0x1256614>
    1c94:	5f464f45 	svcpl	0x00464f45
    1c98:	42554f44 	subsmi	r4, r5, #68, 30	; 0x110
    1c9c:	5f5f454c 	svcpl	0x005f454c
    1ca0:	5f003820 	svcpl	0x00003820
    1ca4:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
    1ca8:	41454c5f 	cmpmi	r5, pc, asr ip
    1cac:	32335453 	eorscc	r5, r3, #1392508928	; 0x53000000
    1cb0:	4449575f 	strbmi	r5, [r9], #-1887	; 0xfffff8a1
    1cb4:	5f5f4854 	svcpl	0x005f4854
    1cb8:	00323320 	eorseq	r3, r2, r0, lsr #6
    1cbc:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    1cc0:	20384250 	eorscs	r4, r8, r0, asr r2
    1cc4:	54584528 	ldrbpl	r4, [r8], #-1320	; 0xfffffad8
    1cc8:	50475f49 	subpl	r5, r7, r9, asr #30
    1ccc:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 1bb0 <_Min_Stack_Size+0x17b0>
    1cd0:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
    1cd4:	745f676e 	ldrbvc	r6, [pc], #-1902	; 1cdc <_Min_Stack_Size+0x18dc>
    1cd8:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
    1cdc:	385f4954 	ldmdacc	pc, {r2, r4, r6, r8, fp, lr}^	; <UNPREDICTABLE>
    1ce0:	4728202c 	strmi	r2, [r8, -ip, lsr #32]!
    1ce4:	5f4f4950 	svcpl	0x004f4950
    1ce8:	436e6950 	cmnmi	lr, #80, 18	; 0x140000
    1cec:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    1cf0:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    1cf4:	4950477b 	ldmdbmi	r0, {r0, r1, r3, r4, r5, r6, r8, r9, sl, lr}^
    1cf8:	472c424f 	strmi	r4, [ip, -pc, asr #4]!
    1cfc:	5f4f4950 	svcpl	0x004f4950
    1d00:	5f4e4950 	svcpl	0x004e4950
    1d04:	50472c38 	subpl	r2, r7, r8, lsr ip
    1d08:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 1bec <_Min_Stack_Size+0x17ec>
    1d0c:	5f45444f 	svcpl	0x0045444f
    1d10:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    1d14:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    1d18:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    1d1c:	554f5f4f 	strbpl	r5, [pc, #-3919]	; dd5 <_Min_Stack_Size+0x9d5>
    1d20:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    1d24:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    1d28:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    1d2c:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    1d30:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
    1d34:	42504954 	subsmi	r4, r0, #84, 18	; 0x150000
    1d38:	45282037 	strmi	r2, [r8, #-55]!	; 0xffffffc9
    1d3c:	5f495458 	svcpl	0x00495458
    1d40:	4f495047 	svcmi	0x00495047
    1d44:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    1d48:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    1d4c:	7b29745f 	blvc	a5eed0 <_Min_Stack_Size+0xa5ead0>
    1d50:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    1d54:	202c375f 	eorcs	r3, ip, pc, asr r7
    1d58:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    1d5c:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    1d60:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    1d64:	5f676966 	svcpl	0x00676966
    1d68:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    1d6c:	424f4950 	submi	r4, pc, #80, 18	; 0x140000
    1d70:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    1d74:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    1d78:	2c375f4e 	ldccs	15, cr5, [r7], #-312	; 0xfffffec8
    1d7c:	4f495047 	svcmi	0x00495047
    1d80:	444f4d5f 	strbmi	r4, [pc], #-3423	; 1d88 <_Min_Stack_Size+0x1988>
    1d84:	46415f45 	strbmi	r5, [r1], -r5, asr #30
    1d88:	504e495f 	subpl	r4, lr, pc, asr r9
    1d8c:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
    1d90:	5f4f4950 	svcpl	0x004f4950
    1d94:	5054554f 	subspl	r5, r4, pc, asr #10
    1d98:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    1d9c:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
    1da0:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    1da4:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    1da8:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    1dac:	20384550 	eorscs	r4, r8, r0, asr r5
    1db0:	54584528 	ldrbpl	r4, [r8], #-1320	; 0xfffffad8
    1db4:	50475f49 	subpl	r5, r7, r9, asr #30
    1db8:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 1c9c <_Min_Stack_Size+0x189c>
    1dbc:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
    1dc0:	745f676e 	ldrbvc	r6, [pc], #-1902	; 1dc8 <_Min_Stack_Size+0x19c8>
    1dc4:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
    1dc8:	385f4954 	ldmdacc	pc, {r2, r4, r6, r8, fp, lr}^	; <UNPREDICTABLE>
    1dcc:	4728202c 	strmi	r2, [r8, -ip, lsr #32]!
    1dd0:	5f4f4950 	svcpl	0x004f4950
    1dd4:	436e6950 	cmnmi	lr, #80, 18	; 0x140000
    1dd8:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    1ddc:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    1de0:	4950477b 	ldmdbmi	r0, {r0, r1, r3, r4, r5, r6, r8, r9, sl, lr}^
    1de4:	472c454f 	strmi	r4, [ip, -pc, asr #10]!
    1de8:	5f4f4950 	svcpl	0x004f4950
    1dec:	5f4e4950 	svcpl	0x004e4950
    1df0:	50472c38 	subpl	r2, r7, r8, lsr ip
    1df4:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 1cd8 <_Min_Stack_Size+0x18d8>
    1df8:	5f45444f 	svcpl	0x0045444f
    1dfc:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    1e00:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    1e04:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    1e08:	554f5f4f 	strbpl	r5, [pc, #-3919]	; ec1 <_Min_Stack_Size+0xac1>
    1e0c:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    1e10:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    1e14:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    1e18:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    1e1c:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
    1e20:	42504954 	subsmi	r4, r0, #84, 18	; 0x150000
    1e24:	45282036 	strmi	r2, [r8, #-54]!	; 0xffffffca
    1e28:	5f495458 	svcpl	0x00495458
    1e2c:	4f495047 	svcmi	0x00495047
    1e30:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    1e34:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    1e38:	7b29745f 	blvc	a5efbc <_Min_Stack_Size+0xa5ebbc>
    1e3c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    1e40:	202c365f 	eorcs	r3, ip, pc, asr r6
    1e44:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    1e48:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    1e4c:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    1e50:	5f676966 	svcpl	0x00676966
    1e54:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    1e58:	424f4950 	submi	r4, pc, #80, 18	; 0x140000
    1e5c:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    1e60:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    1e64:	2c365f4e 	ldccs	15, cr5, [r6], #-312	; 0xfffffec8
    1e68:	4f495047 	svcmi	0x00495047
    1e6c:	444f4d5f 	strbmi	r4, [pc], #-3423	; 1e74 <_Min_Stack_Size+0x1a74>
    1e70:	46415f45 	strbmi	r5, [r1], -r5, asr #30
    1e74:	504e495f 	subpl	r4, lr, pc, asr r9
    1e78:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
    1e7c:	5f4f4950 	svcpl	0x004f4950
    1e80:	5054554f 	subspl	r5, r4, pc, asr #10
    1e84:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    1e88:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
    1e8c:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    1e90:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    1e94:	4349564e 	movtmi	r5, #38478	; 0x964e
    1e98:	5152495f 	cmppl	r2, pc, asr r9
    1e9c:	455f3933 	ldrbmi	r3, [pc, #-2355]	; 1571 <_Min_Stack_Size+0x1171>
    1ea0:	2029284e 	eorcs	r2, r9, lr, asr #16
    1ea4:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    1ea8:	53495f43 	movtpl	r5, #40771	; 0x9f43
    1eac:	20315245 	eorscs	r5, r1, r5, asr #4
    1eb0:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    1eb4:	373c3c31 			; <UNDEFINED> instruction: 0x373c3c31
    1eb8:	45002929 	strmi	r2, [r0, #-2345]	; 0xfffff6d7
    1ebc:	50495458 	subpl	r5, r9, r8, asr r4
    1ec0:	28203542 	stmdacs	r0!, {r1, r6, r8, sl, ip, sp}
    1ec4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    1ec8:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    1ecc:	614d5f4f 	cmpvs	sp, pc, asr #30
    1ed0:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    1ed4:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    1ed8:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    1edc:	2c355f49 	ldccs	15, cr5, [r5], #-292	; 0xfffffedc
    1ee0:	50472820 	subpl	r2, r7, r0, lsr #16
    1ee4:	505f4f49 	subspl	r4, pc, r9, asr #30
    1ee8:	6f436e69 	svcvs	0x00436e69
    1eec:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    1ef0:	7b29745f 	blvc	a5f074 <_Min_Stack_Size+0xa5ec74>
    1ef4:	4f495047 	svcmi	0x00495047
    1ef8:	50472c42 	subpl	r2, r7, r2, asr #24
    1efc:	505f4f49 	subspl	r4, pc, r9, asr #30
    1f00:	355f4e49 	ldrbcc	r4, [pc, #-3657]	; 10bf <_Min_Stack_Size+0xcbf>
    1f04:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    1f08:	4f4d5f4f 	svcmi	0x004d5f4f
    1f0c:	415f4544 	cmpmi	pc, r4, asr #10
    1f10:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    1f14:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    1f18:	4f495047 	svcmi	0x00495047
    1f1c:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    1f20:	5f545550 	svcpl	0x00545550
    1f24:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    1f28:	4f4e5f44 	svcmi	0x004e5f44
    1f2c:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    1f30:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    1f34:	34425049 	strbcc	r5, [r2], #-73	; 0xffffffb7
    1f38:	58452820 	stmdapl	r5, {r5, fp, sp}^
    1f3c:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
    1f40:	5f4f4950 	svcpl	0x004f4950
    1f44:	7070614d 	rsbsvc	r6, r0, sp, asr #2
    1f48:	5f676e69 	svcpl	0x00676e69
    1f4c:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
    1f50:	5f495458 	svcpl	0x00495458
    1f54:	28202c34 	stmdacs	r0!, {r2, r4, r5, sl, fp, sp}
    1f58:	4f495047 	svcmi	0x00495047
    1f5c:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    1f60:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    1f64:	745f6769 	ldrbvc	r6, [pc], #-1897	; 1f6c <_Min_Stack_Size+0x1b6c>
    1f68:	50477b29 	subpl	r7, r7, r9, lsr #22
    1f6c:	2c424f49 	mcrrcs	15, 4, r4, r2, cr9
    1f70:	4f495047 	svcmi	0x00495047
    1f74:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    1f78:	472c345f 			; <UNDEFINED> instruction: 0x472c345f
    1f7c:	5f4f4950 	svcpl	0x004f4950
    1f80:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    1f84:	5f46415f 	svcpl	0x0046415f
    1f88:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    1f8c:	50472c54 	subpl	r2, r7, r4, asr ip
    1f90:	4f5f4f49 	svcmi	0x005f4f49
    1f94:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    1f98:	50535f54 	subspl	r5, r3, r4, asr pc
    1f9c:	5f444545 	svcpl	0x00444545
    1fa0:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
    1fa4:	45007d7d 	strmi	r7, [r0, #-3453]	; 0xfffff283
    1fa8:	50495458 	subpl	r5, r9, r8, asr r4
    1fac:	28203342 	stmdacs	r0!, {r1, r6, r8, r9, ip, sp}
    1fb0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    1fb4:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    1fb8:	614d5f4f 	cmpvs	sp, pc, asr #30
    1fbc:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    1fc0:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    1fc4:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    1fc8:	2c335f49 	ldccs	15, cr5, [r3], #-292	; 0xfffffedc
    1fcc:	50472820 	subpl	r2, r7, r0, lsr #16
    1fd0:	505f4f49 	subspl	r4, pc, r9, asr #30
    1fd4:	6f436e69 	svcvs	0x00436e69
    1fd8:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    1fdc:	7b29745f 	blvc	a5f160 <_Min_Stack_Size+0xa5ed60>
    1fe0:	4f495047 	svcmi	0x00495047
    1fe4:	50472c42 	subpl	r2, r7, r2, asr #24
    1fe8:	505f4f49 	subspl	r4, pc, r9, asr #30
    1fec:	335f4e49 	cmpcc	pc, #1168	; 0x490
    1ff0:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    1ff4:	4f4d5f4f 	svcmi	0x004d5f4f
    1ff8:	415f4544 	cmpmi	pc, r4, asr #10
    1ffc:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    2000:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    2004:	4f495047 	svcmi	0x00495047
    2008:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    200c:	5f545550 	svcpl	0x00545550
    2010:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    2014:	4f4e5f44 	svcmi	0x004e5f44
    2018:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    201c:	445f5f00 	ldrbmi	r5, [pc], #-3840	; 2024 <_Min_Stack_Size+0x1c24>
    2020:	34364345 	ldrtcc	r4, [r6], #-837	; 0xfffffcbb
    2024:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    2028:	39205f5f 	stmdbcc	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    202c:	3939392e 	ldmdbcc	r9!, {r1, r2, r3, r5, r8, fp, ip, sp}
    2030:	39393939 	ldmdbcc	r9!, {r0, r3, r4, r5, r8, fp, ip, sp}
    2034:	39393939 	ldmdbcc	r9!, {r0, r3, r4, r5, r8, fp, ip, sp}
    2038:	39393939 	ldmdbcc	r9!, {r0, r3, r4, r5, r8, fp, ip, sp}
    203c:	34383345 	ldrtcc	r3, [r8], #-837	; 0xfffffcbb
    2040:	45004444 	strmi	r4, [r0, #-1092]	; 0xfffffbbc
    2044:	50495458 	subpl	r5, r9, r8, asr r4
    2048:	28203242 	stmdacs	r0!, {r1, r6, r9, ip, sp}
    204c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    2050:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    2054:	614d5f4f 	cmpvs	sp, pc, asr #30
    2058:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    205c:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    2060:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    2064:	2c325f49 	ldccs	15, cr5, [r2], #-292	; 0xfffffedc
    2068:	50472820 	subpl	r2, r7, r0, lsr #16
    206c:	505f4f49 	subspl	r4, pc, r9, asr #30
    2070:	6f436e69 	svcvs	0x00436e69
    2074:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    2078:	7b29745f 	blvc	a5f1fc <_Min_Stack_Size+0xa5edfc>
    207c:	4f495047 	svcmi	0x00495047
    2080:	50472c42 	subpl	r2, r7, r2, asr #24
    2084:	505f4f49 	subspl	r4, pc, r9, asr #30
    2088:	325f4e49 	subscc	r4, pc, #1168	; 0x490
    208c:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    2090:	4f4d5f4f 	svcmi	0x004d5f4f
    2094:	415f4544 	cmpmi	pc, r4, asr #10
    2098:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    209c:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    20a0:	4f495047 	svcmi	0x00495047
    20a4:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    20a8:	5f545550 	svcpl	0x00545550
    20ac:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    20b0:	4f4e5f44 	svcmi	0x004e5f44
    20b4:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    20b8:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    20bc:	31425049 	cmpcc	r2, r9, asr #32
    20c0:	58452820 	stmdapl	r5, {r5, fp, sp}^
    20c4:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
    20c8:	5f4f4950 	svcpl	0x004f4950
    20cc:	7070614d 	rsbsvc	r6, r0, sp, asr #2
    20d0:	5f676e69 	svcpl	0x00676e69
    20d4:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
    20d8:	5f495458 	svcpl	0x00495458
    20dc:	28202c31 	stmdacs	r0!, {r0, r4, r5, sl, fp, sp}
    20e0:	4f495047 	svcmi	0x00495047
    20e4:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    20e8:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    20ec:	745f6769 	ldrbvc	r6, [pc], #-1897	; 20f4 <_Min_Stack_Size+0x1cf4>
    20f0:	50477b29 	subpl	r7, r7, r9, lsr #22
    20f4:	2c424f49 	mcrrcs	15, 4, r4, r2, cr9
    20f8:	4f495047 	svcmi	0x00495047
    20fc:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    2100:	472c315f 			; <UNDEFINED> instruction: 0x472c315f
    2104:	5f4f4950 	svcpl	0x004f4950
    2108:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    210c:	5f46415f 	svcpl	0x0046415f
    2110:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    2114:	50472c54 	subpl	r2, r7, r4, asr ip
    2118:	4f5f4f49 	svcmi	0x005f4f49
    211c:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    2120:	50535f54 	subspl	r5, r3, r4, asr pc
    2124:	5f444545 	svcpl	0x00444545
    2128:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
    212c:	45007d7d 	strmi	r7, [r0, #-3453]	; 0xfffff283
    2130:	50495458 	subpl	r5, r9, r8, asr r4
    2134:	28203042 	stmdacs	r0!, {r1, r6, ip, sp}
    2138:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    213c:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    2140:	614d5f4f 	cmpvs	sp, pc, asr #30
    2144:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    2148:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    214c:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    2150:	2c305f49 	ldccs	15, cr5, [r0], #-292	; 0xfffffedc
    2154:	50472820 	subpl	r2, r7, r0, lsr #16
    2158:	505f4f49 	subspl	r4, pc, r9, asr #30
    215c:	6f436e69 	svcvs	0x00436e69
    2160:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    2164:	7b29745f 	blvc	a5f2e8 <_Min_Stack_Size+0xa5eee8>
    2168:	4f495047 	svcmi	0x00495047
    216c:	50472c42 	subpl	r2, r7, r2, asr #24
    2170:	505f4f49 	subspl	r4, pc, r9, asr #30
    2174:	305f4e49 	subscc	r4, pc, r9, asr #28
    2178:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    217c:	4f4d5f4f 	svcmi	0x004d5f4f
    2180:	415f4544 	cmpmi	pc, r4, asr #10
    2184:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    2188:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    218c:	4f495047 	svcmi	0x00495047
    2190:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    2194:	5f545550 	svcpl	0x00545550
    2198:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    219c:	4f4e5f44 	svcmi	0x004e5f44
    21a0:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    21a4:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    21a8:	53495f43 	movtpl	r5, #40771	; 0x9f43
    21ac:	20315250 	eorscs	r5, r1, r0, asr r2
    21b0:	7576282a 	ldrbvc	r2, [r6, #-2090]!	; 0xfffff7d6
    21b4:	33746e69 	cmncc	r4, #1680	; 0x690
    21b8:	2a745f32 	bcs	1d19e88 <_Min_Stack_Size+0x1d19a88>
    21bc:	564e2829 	strbpl	r2, [lr], -r9, lsr #16
    21c0:	425f4349 	subsmi	r4, pc, #603979777	; 0x24000001
    21c4:	2b455341 	blcs	1156ed0 <_Min_Stack_Size+0x1156ad0>
    21c8:	30317830 	eorscc	r7, r1, r0, lsr r8
    21cc:	5f002934 	svcpl	0x00002934
    21d0:	4154555f 	cmpmi	r4, pc, asr r5
    21d4:	4942465f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
    21d8:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
    21dc:	45003436 	strmi	r3, [r0, #-1078]	; 0xfffffbca
    21e0:	50495458 	subpl	r5, r9, r8, asr r4
    21e4:	28203943 	stmdacs	r0!, {r0, r1, r6, r8, fp, ip, sp}
    21e8:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    21ec:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    21f0:	614d5f4f 	cmpvs	sp, pc, asr #30
    21f4:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    21f8:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    21fc:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    2200:	2c395f49 	ldccs	15, cr5, [r9], #-292	; 0xfffffedc
    2204:	50472820 	subpl	r2, r7, r0, lsr #16
    2208:	505f4f49 	subspl	r4, pc, r9, asr #30
    220c:	6f436e69 	svcvs	0x00436e69
    2210:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    2214:	7b29745f 	blvc	a5f398 <_Min_Stack_Size+0xa5ef98>
    2218:	4f495047 	svcmi	0x00495047
    221c:	50472c43 	subpl	r2, r7, r3, asr #24
    2220:	505f4f49 	subspl	r4, pc, r9, asr #30
    2224:	395f4e49 	ldmdbcc	pc, {r0, r3, r6, r9, sl, fp, lr}^	; <UNPREDICTABLE>
    2228:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    222c:	4f4d5f4f 	svcmi	0x004d5f4f
    2230:	415f4544 	cmpmi	pc, r4, asr #10
    2234:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    2238:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    223c:	4f495047 	svcmi	0x00495047
    2240:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    2244:	5f545550 	svcpl	0x00545550
    2248:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    224c:	4f4e5f44 	svcmi	0x004e5f44
    2250:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    2254:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    2258:	445f544c 	ldrbmi	r5, [pc], #-1100	; 2260 <_Min_Stack_Size+0x1e60>
    225c:	4d494345 	stclmi	3, cr4, [r9, #-276]	; 0xfffffeec
    2260:	445f4c41 	ldrbmi	r4, [pc], #-3137	; 2268 <_Min_Stack_Size+0x1e68>
    2264:	5f5f4749 	svcpl	0x005f4749
    2268:	5f003920 	svcpl	0x00003920
    226c:	7568745f 	strbvc	r7, [r8, #-1119]!	; 0xfffffba1
    2270:	5f5f626d 	svcpl	0x005f626d
    2274:	5f003120 	svcpl	0x00003120
    2278:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
    227c:	41454c5f 	cmpmi	r5, pc, asr ip
    2280:	32335453 	eorscc	r5, r3, #1392508928	; 0x53000000
    2284:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    2288:	30205f5f 	eorcc	r5, r0, pc, asr pc
    228c:	66663778 			; <UNDEFINED> instruction: 0x66663778
    2290:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    2294:	47004c66 	strmi	r4, [r0, -r6, ror #24]
    2298:	5f4f4950 	svcpl	0x004f4950
    229c:	5f4e4950 	svcpl	0x004e4950
    22a0:	28203231 	stmdacs	r0!, {r0, r4, r5, r9, ip, sp}
    22a4:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    22a8:	5f363174 	svcpl	0x00363174
    22ac:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    22b0:	30303031 	eorscc	r3, r0, r1, lsr r0
    22b4:	58450029 	stmdapl	r5, {r0, r3, r5}^
    22b8:	41504954 	cmpmi	r0, r4, asr r9
    22bc:	45282037 	strmi	r2, [r8, #-55]!	; 0xffffffc9
    22c0:	5f495458 	svcpl	0x00495458
    22c4:	4f495047 	svcmi	0x00495047
    22c8:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    22cc:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    22d0:	7b29745f 	blvc	a5f454 <_Min_Stack_Size+0xa5f054>
    22d4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    22d8:	202c375f 	eorcs	r3, ip, pc, asr r7
    22dc:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    22e0:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    22e4:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    22e8:	5f676966 	svcpl	0x00676966
    22ec:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    22f0:	414f4950 	cmpmi	pc, r0, asr r9	; <UNPREDICTABLE>
    22f4:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    22f8:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    22fc:	2c375f4e 	ldccs	15, cr5, [r7], #-312	; 0xfffffec8
    2300:	4f495047 	svcmi	0x00495047
    2304:	444f4d5f 	strbmi	r4, [pc], #-3423	; 230c <_Min_Stack_Size+0x1f0c>
    2308:	46415f45 	strbmi	r5, [r1], -r5, asr #30
    230c:	504e495f 	subpl	r4, lr, pc, asr r9
    2310:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
    2314:	5f4f4950 	svcpl	0x004f4950
    2318:	5054554f 	subspl	r5, r4, pc, asr #10
    231c:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    2320:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
    2324:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    2328:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    232c:	31433249 	cmpcc	r3, r9, asr #4
    2330:	49282820 	stmdbmi	r8!, {r5, fp, sp}
    2334:	545f4332 	ldrbpl	r4, [pc], #-818	; 233c <_Min_Stack_Size+0x1f3c>
    2338:	64657079 	strbtvs	r7, [r5], #-121	; 0xffffff87
    233c:	292a6665 	stmdbcs	sl!, {r0, r2, r5, r6, r9, sl, sp, lr}
    2340:	31433249 	cmpcc	r3, r9, asr #4
    2344:	5341425f 	movtpl	r4, #4703	; 0x125f
    2348:	45002945 	strmi	r2, [r0, #-2373]	; 0xfffff6bb
    234c:	50495458 	subpl	r5, r9, r8, asr r4
    2350:	28203641 	stmdacs	r0!, {r0, r6, r9, sl, ip, sp}
    2354:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    2358:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    235c:	614d5f4f 	cmpvs	sp, pc, asr #30
    2360:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    2364:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    2368:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    236c:	2c365f49 	ldccs	15, cr5, [r6], #-292	; 0xfffffedc
    2370:	50472820 	subpl	r2, r7, r0, lsr #16
    2374:	505f4f49 	subspl	r4, pc, r9, asr #30
    2378:	6f436e69 	svcvs	0x00436e69
    237c:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    2380:	7b29745f 	blvc	a5f504 <_Min_Stack_Size+0xa5f104>
    2384:	4f495047 	svcmi	0x00495047
    2388:	50472c41 	subpl	r2, r7, r1, asr #24
    238c:	505f4f49 	subspl	r4, pc, r9, asr #30
    2390:	365f4e49 	ldrbcc	r4, [pc], -r9, asr #28
    2394:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    2398:	4f4d5f4f 	svcmi	0x004d5f4f
    239c:	415f4544 	cmpmi	pc, r4, asr #10
