mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    23a0:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    23a4:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    23a8:	4f495047 	svcmi	0x00495047
    23ac:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    23b0:	5f545550 	svcpl	0x00545550
    23b4:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    23b8:	4f4e5f44 	svcmi	0x004e5f44
    23bc:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    23c0:	524f4300 	subpl	r4, pc, #0, 6
    23c4:	4d584554 	cfldr64mi	mvdx4, [r8, #-336]	; 0xfffffeb0
    23c8:	4e495f33 	mcrmi	15, 2, r5, cr9, cr3, {1}
    23cc:	4e524554 	mrcmi	5, 2, r4, cr2, cr4, {2}
    23d0:	505f4c41 	subspl	r4, pc, r1, asr #24
    23d4:	50495245 	subpl	r5, r9, r5, asr #4
    23d8:	41524548 	cmpmi	r2, r8, asr #10
    23dc:	425f534c 	subsmi	r5, pc, #76, 6	; 0x30000001
    23e0:	20455341 	subcs	r5, r5, r1, asr #6
    23e4:	30457830 	subcc	r7, r5, r0, lsr r8
    23e8:	30303031 	eorscc	r3, r0, r1, lsr r0
    23ec:	45003030 	strmi	r3, [r0, #-48]	; 0xffffffd0
    23f0:	50495458 	subpl	r5, r9, r8, asr r4
    23f4:	28203541 	stmdacs	r0!, {r0, r6, r8, sl, ip, sp}
    23f8:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    23fc:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    2400:	614d5f4f 	cmpvs	sp, pc, asr #30
    2404:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    2408:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    240c:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    2410:	2c355f49 	ldccs	15, cr5, [r5], #-292	; 0xfffffedc
    2414:	50472820 	subpl	r2, r7, r0, lsr #16
    2418:	505f4f49 	subspl	r4, pc, r9, asr #30
    241c:	6f436e69 	svcvs	0x00436e69
    2420:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    2424:	7b29745f 	blvc	a5f5a8 <_Min_Stack_Size+0xa5f1a8>
    2428:	4f495047 	svcmi	0x00495047
    242c:	50472c41 	subpl	r2, r7, r1, asr #24
    2430:	505f4f49 	subspl	r4, pc, r9, asr #30
    2434:	355f4e49 	ldrbcc	r4, [pc, #-3657]	; 15f3 <_Min_Stack_Size+0x11f3>
    2438:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    243c:	4f4d5f4f 	svcmi	0x004d5f4f
    2440:	415f4544 	cmpmi	pc, r4, asr #10
    2444:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    2448:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    244c:	4f495047 	svcmi	0x00495047
    2450:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    2454:	5f545550 	svcpl	0x00545550
    2458:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    245c:	4f4e5f44 	svcmi	0x004e5f44
    2460:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    2464:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    2468:	34415049 	strbcc	r5, [r1], #-73	; 0xffffffb7
    246c:	58452820 	stmdapl	r5, {r5, fp, sp}^
    2470:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
    2474:	5f4f4950 	svcpl	0x004f4950
    2478:	7070614d 	rsbsvc	r6, r0, sp, asr #2
    247c:	5f676e69 	svcpl	0x00676e69
    2480:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
    2484:	5f495458 	svcpl	0x00495458
    2488:	28202c34 	stmdacs	r0!, {r2, r4, r5, sl, fp, sp}
    248c:	4f495047 	svcmi	0x00495047
    2490:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    2494:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    2498:	745f6769 	ldrbvc	r6, [pc], #-1897	; 24a0 <_Min_Stack_Size+0x20a0>
    249c:	50477b29 	subpl	r7, r7, r9, lsr #22
    24a0:	2c414f49 	mcrrcs	15, 4, r4, r1, cr9
    24a4:	4f495047 	svcmi	0x00495047
    24a8:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    24ac:	472c345f 			; <UNDEFINED> instruction: 0x472c345f
    24b0:	5f4f4950 	svcpl	0x004f4950
    24b4:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    24b8:	5f46415f 	svcpl	0x0046415f
    24bc:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    24c0:	50472c54 	subpl	r2, r7, r4, asr ip
    24c4:	4f5f4f49 	svcmi	0x005f4f49
    24c8:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    24cc:	50535f54 	subspl	r5, r3, r4, asr pc
    24d0:	5f444545 	svcpl	0x00444545
    24d4:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
    24d8:	5f007d7d 	svcpl	0x00007d7d
    24dc:	554e475f 	strbpl	r4, [lr, #-1887]	; 0xfffff8a1
    24e0:	54535f43 	ldrbpl	r5, [r3], #-3907	; 0xfffff0bd
    24e4:	495f4344 	ldmdbmi	pc, {r2, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    24e8:	4e494c4e 	cdpmi	12, 4, cr4, cr9, cr14, {2}
    24ec:	205f5f45 	subscs	r5, pc, r5, asr #30
    24f0:	58450031 	stmdapl	r5, {r0, r4, r5}^
    24f4:	41504954 	cmpmi	r0, r4, asr r9
    24f8:	45282033 	strmi	r2, [r8, #-51]!	; 0xffffffcd
    24fc:	5f495458 	svcpl	0x00495458
    2500:	4f495047 	svcmi	0x00495047
    2504:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    2508:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    250c:	7b29745f 	blvc	a5f690 <_Min_Stack_Size+0xa5f290>
    2510:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    2514:	202c335f 	eorcs	r3, ip, pc, asr r3
    2518:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    251c:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    2520:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    2524:	5f676966 	svcpl	0x00676966
    2528:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    252c:	414f4950 	cmpmi	pc, r0, asr r9	; <UNPREDICTABLE>
    2530:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    2534:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    2538:	2c335f4e 	ldccs	15, cr5, [r3], #-312	; 0xfffffec8
    253c:	4f495047 	svcmi	0x00495047
    2540:	444f4d5f 	strbmi	r4, [pc], #-3423	; 2548 <_Min_Stack_Size+0x2148>
    2544:	46415f45 	strbmi	r5, [r1], -r5, asr #30
    2548:	504e495f 	subpl	r4, lr, pc, asr r9
    254c:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
    2550:	5f4f4950 	svcpl	0x004f4950
    2554:	5054554f 	subspl	r5, r4, pc, asr #10
    2558:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    255c:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
    2560:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    2564:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    2568:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    256c:	20324150 	eorscs	r4, r2, r0, asr r1
    2570:	54584528 	ldrbpl	r4, [r8], #-1320	; 0xfffffad8
    2574:	50475f49 	subpl	r5, r7, r9, asr #30
    2578:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 245c <_Min_Stack_Size+0x205c>
    257c:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
    2580:	745f676e 	ldrbvc	r6, [pc], #-1902	; 2588 <_Min_Stack_Size+0x2188>
    2584:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
    2588:	325f4954 	subscc	r4, pc, #84, 18	; 0x150000
    258c:	4728202c 	strmi	r2, [r8, -ip, lsr #32]!
    2590:	5f4f4950 	svcpl	0x004f4950
    2594:	436e6950 	cmnmi	lr, #80, 18	; 0x140000
    2598:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    259c:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    25a0:	4950477b 	ldmdbmi	r0, {r0, r1, r3, r4, r5, r6, r8, r9, sl, lr}^
    25a4:	472c414f 	strmi	r4, [ip, -pc, asr #2]!
    25a8:	5f4f4950 	svcpl	0x004f4950
    25ac:	5f4e4950 	svcpl	0x004e4950
    25b0:	50472c32 	subpl	r2, r7, r2, lsr ip
    25b4:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 2498 <_Min_Stack_Size+0x2098>
    25b8:	5f45444f 	svcpl	0x0045444f
    25bc:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    25c0:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    25c4:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    25c8:	554f5f4f 	strbpl	r5, [pc, #-3919]	; 1681 <_Min_Stack_Size+0x1281>
    25cc:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    25d0:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    25d4:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    25d8:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    25dc:	5047007d 	subpl	r0, r7, sp, ror r0
    25e0:	505f4f49 	subspl	r4, pc, r9, asr #30
    25e4:	315f4e49 	cmpcc	pc, r9, asr #28
    25e8:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    25ec:	31746e69 	cmncc	r4, r9, ror #28
    25f0:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    25f4:	30307830 	eorscc	r7, r0, r0, lsr r8
    25f8:	00293230 	eoreq	r3, r9, r0, lsr r2
    25fc:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    2600:	20314150 	eorscs	r4, r1, r0, asr r1
    2604:	54584528 	ldrbpl	r4, [r8], #-1320	; 0xfffffad8
    2608:	50475f49 	subpl	r5, r7, r9, asr #30
    260c:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 24f0 <_Min_Stack_Size+0x20f0>
    2610:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
    2614:	745f676e 	ldrbvc	r6, [pc], #-1902	; 261c <_Min_Stack_Size+0x221c>
    2618:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
    261c:	315f4954 	cmpcc	pc, r4, asr r9	; <UNPREDICTABLE>
    2620:	4728202c 	strmi	r2, [r8, -ip, lsr #32]!
    2624:	5f4f4950 	svcpl	0x004f4950
    2628:	436e6950 	cmnmi	lr, #80, 18	; 0x140000
    262c:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    2630:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    2634:	4950477b 	ldmdbmi	r0, {r0, r1, r3, r4, r5, r6, r8, r9, sl, lr}^
    2638:	472c414f 	strmi	r4, [ip, -pc, asr #2]!
    263c:	5f4f4950 	svcpl	0x004f4950
    2640:	5f4e4950 	svcpl	0x004e4950
    2644:	50472c31 	subpl	r2, r7, r1, lsr ip
    2648:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 252c <_Min_Stack_Size+0x212c>
    264c:	5f45444f 	svcpl	0x0045444f
    2650:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    2654:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    2658:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    265c:	554f5f4f 	strbpl	r5, [pc, #-3919]	; 1715 <_Min_Stack_Size+0x1315>
    2660:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    2664:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    2668:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    266c:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    2670:	5f5f007d 	svcpl	0x005f007d
    2674:	43414c4c 	movtmi	r4, #7244	; 0x1c4c
    2678:	5f4d5543 	svcpl	0x004d5543
    267c:	49535045 	ldmdbmi	r3, {r0, r2, r6, ip, lr}^
    2680:	5f4e4f4c 	svcpl	0x004e4f4c
    2684:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    2688:	332d5031 			; <UNDEFINED> instruction: 0x332d5031
    268c:	4b4c4c31 	blmi	1315758 <_Min_Stack_Size+0x1315358>
    2690:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    2694:	30415049 	subcc	r5, r1, r9, asr #32
    2698:	58452820 	stmdapl	r5, {r5, fp, sp}^
    269c:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
    26a0:	5f4f4950 	svcpl	0x004f4950
    26a4:	7070614d 	rsbsvc	r6, r0, sp, asr #2
    26a8:	5f676e69 	svcpl	0x00676e69
    26ac:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
    26b0:	5f495458 	svcpl	0x00495458
    26b4:	28202c30 	stmdacs	r0!, {r4, r5, sl, fp, sp}
    26b8:	4f495047 	svcmi	0x00495047
    26bc:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    26c0:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    26c4:	745f6769 	ldrbvc	r6, [pc], #-1897	; 26cc <_Min_Stack_Size+0x22cc>
    26c8:	50477b29 	subpl	r7, r7, r9, lsr #22
    26cc:	2c414f49 	mcrrcs	15, 4, r4, r1, cr9
    26d0:	4f495047 	svcmi	0x00495047
    26d4:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    26d8:	472c305f 			; <UNDEFINED> instruction: 0x472c305f
    26dc:	5f4f4950 	svcpl	0x004f4950
    26e0:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    26e4:	5f46415f 	svcpl	0x0046415f
    26e8:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    26ec:	50472c54 	subpl	r2, r7, r4, asr ip
    26f0:	4f5f4f49 	svcmi	0x005f4f49
    26f4:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    26f8:	50535f54 	subspl	r5, r3, r4, asr pc
    26fc:	5f444545 	svcpl	0x00444545
    2700:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
    2704:	5f007d7d 	svcpl	0x00007d7d
    2708:	554e475f 	strbpl	r4, [lr, #-1887]	; 0xfffff8a1
    270c:	41505f43 	cmpmi	r0, r3, asr #30
    2710:	4c484354 	mcrrmi	3, 5, r4, r8, cr4
    2714:	4c455645 	mcrrmi	6, 4, r5, r5, cr5
    2718:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    271c:	475f5f00 	ldrbmi	r5, [pc, -r0, lsl #30]
    2720:	415f4343 	cmpmi	pc, r3, asr #6
    2724:	494d4f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, lr}^
    2728:	48435f43 	stmdami	r3, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    272c:	32335241 	eorscc	r5, r3, #268435460	; 0x10000004
    2730:	4c5f545f 	cfldrdmi	mvd5, [pc], {95}	; 0x5f
    2734:	5f4b434f 	svcpl	0x004b434f
    2738:	45455246 	strbmi	r5, [r5, #-582]	; 0xfffffdba
    273c:	5f003220 	svcpl	0x00003220
    2740:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    2744:	454c5f54 	strbmi	r5, [ip, #-3924]	; 0xfffff0ac
    2748:	31545341 	cmpcc	r4, r1, asr #6
    274c:	414d5f36 	cmpmi	sp, r6, lsr pc
    2750:	205f5f58 	subscs	r5, pc, r8, asr pc	; <UNPREDICTABLE>
    2754:	66667830 			; <UNDEFINED> instruction: 0x66667830
    2758:	5f006666 	svcpl	0x00006666
    275c:	4341535f 	movtmi	r5, #4959	; 0x135f
    2760:	5f4d5543 	svcpl	0x004d5543
    2764:	5f58414d 	svcpl	0x0058414d
    2768:	5830205f 	ldmdapl	r0!, {r0, r1, r2, r3, r4, r6, sp}
    276c:	46464637 			; <UNDEFINED> instruction: 0x46464637
    2770:	48372d50 	ldmdami	r7!, {r4, r6, r8, sl, fp, sp}
    2774:	5f5f004b 	svcpl	0x005f004b
    2778:	465f5153 			; <UNDEFINED> instruction: 0x465f5153
    277c:	5f544942 	svcpl	0x00544942
    2780:	3133205f 	teqcc	r3, pc, asr r0
    2784:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    2788:	445f544c 	ldrbmi	r5, [pc], #-1100	; 2790 <_Min_Stack_Size+0x2390>
    278c:	5f5f4749 	svcpl	0x005f4749
    2790:	47003620 	strmi	r3, [r0, -r0, lsr #12]
    2794:	444f4950 	strbmi	r4, [pc], #-2384	; 279c <_Min_Stack_Size+0x239c>
    2798:	47282820 	strmi	r2, [r8, -r0, lsr #16]!
    279c:	5f4f4950 	svcpl	0x004f4950
    27a0:	65707954 	ldrbvs	r7, [r0, #-2388]!	; 0xfffff6ac
    27a4:	2a666564 	bcs	199bd3c <_Min_Stack_Size+0x199b93c>
    27a8:	49504729 	ldmdbmi	r0, {r0, r3, r5, r8, r9, sl, lr}^
    27ac:	425f444f 	subsmi	r4, pc, #1325400064	; 0x4f000000
    27b0:	29455341 	stmdbcs	r5, {r0, r6, r8, r9, ip, lr}^
    27b4:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    27b8:	38445049 	stmdacc	r4, {r0, r3, r6, ip, lr}^
    27bc:	58452820 	stmdapl	r5, {r5, fp, sp}^
    27c0:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
    27c4:	5f4f4950 	svcpl	0x004f4950
    27c8:	7070614d 	rsbsvc	r6, r0, sp, asr #2
    27cc:	5f676e69 	svcpl	0x00676e69
    27d0:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
    27d4:	5f495458 	svcpl	0x00495458
    27d8:	28202c38 	stmdacs	r0!, {r3, r4, r5, sl, fp, sp}
    27dc:	4f495047 	svcmi	0x00495047
    27e0:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    27e4:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    27e8:	745f6769 	ldrbvc	r6, [pc], #-1897	; 27f0 <_Min_Stack_Size+0x23f0>
    27ec:	50477b29 	subpl	r7, r7, r9, lsr #22
    27f0:	2c444f49 	mcrrcs	15, 4, r4, r4, cr9
    27f4:	4f495047 	svcmi	0x00495047
    27f8:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    27fc:	472c385f 			; <UNDEFINED> instruction: 0x472c385f
    2800:	5f4f4950 	svcpl	0x004f4950
    2804:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    2808:	5f46415f 	svcpl	0x0046415f
    280c:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    2810:	50472c54 	subpl	r2, r7, r4, asr ip
    2814:	4f5f4f49 	svcmi	0x005f4f49
    2818:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    281c:	50535f54 	subspl	r5, r3, r4, asr pc
    2820:	5f444545 	svcpl	0x00444545
    2824:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
    2828:	5f007d7d 	svcpl	0x00007d7d
    282c:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    2830:	41465f54 	cmpmi	r6, r4, asr pc
    2834:	32335453 	eorscc	r5, r3, #1392508928	; 0x53000000
    2838:	5059545f 	subspl	r5, r9, pc, asr r4
    283c:	205f5f45 	subscs	r5, pc, r5, asr #30
    2840:	69736e75 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, sl, fp, sp, lr}^
    2844:	64656e67 	strbtvs	r6, [r5], #-3687	; 0xfffff199
    2848:	746e6920 	strbtvc	r6, [lr], #-2336	; 0xfffff6e0
    284c:	535f5f00 	cmppl	pc, #0, 30
    2850:	5f434454 	svcpl	0x00434454
    2854:	5f465455 	svcpl	0x00465455
    2858:	5f5f3233 	svcpl	0x005f3233
    285c:	5f003120 	svcpl	0x00003120
    2860:	5a49535f 	bpl	12575e4 <_Min_Stack_Size+0x12571e4>
    2864:	5f464f45 	svcpl	0x00464f45
    2868:	414f4c46 	cmpmi	pc, r6, asr #24
    286c:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
    2870:	5f5f0034 	svcpl	0x005f0034
    2874:	33544c46 	cmpcc	r4, #17920	; 0x4600
    2878:	445f5832 	ldrbmi	r5, [pc], #-2098	; 2880 <_Min_Stack_Size+0x2480>
    287c:	524f4e45 	subpl	r4, pc, #1104	; 0x450
    2880:	494d5f4d 	stmdbmi	sp, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    2884:	205f5f4e 	subscs	r5, pc, lr, asr #30
    2888:	34392e34 	ldrtcc	r2, [r9], #-3636	; 0xfffff1cc
    288c:	36353630 			; <UNDEFINED> instruction: 0x36353630
    2890:	34383534 	ldrtcc	r3, [r8], #-1332	; 0xfffffacc
    2894:	36343231 			; <UNDEFINED> instruction: 0x36343231
    2898:	2d653435 	cfstrdcs	mvd3, [r5, #-212]!	; 0xffffff2c
    289c:	46343233 			; <UNDEFINED> instruction: 0x46343233
    28a0:	00783233 	rsbseq	r3, r8, r3, lsr r2
    28a4:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    28a8:	414d5f54 	cmpmi	sp, r4, asr pc
    28ac:	30315f58 	eorscc	r5, r1, r8, asr pc
    28b0:	5058455f 	subspl	r4, r8, pc, asr r5
    28b4:	33205f5f 			; <UNDEFINED> instruction: 0x33205f5f
    28b8:	5f5f0038 	svcpl	0x005f0038
    28bc:	31434544 	cmpcc	r3, r4, asr #10
    28c0:	4d5f3832 	ldclmi	8, cr3, [pc, #-200]	; 2800 <_Min_Stack_Size+0x2400>
    28c4:	5f5f5841 	svcpl	0x005f5841
    28c8:	392e3920 	stmdbcc	lr!, {r5, r8, fp, ip, sp}
    28cc:	39393939 	ldmdbcc	r9!, {r0, r3, r4, r5, r8, fp, ip, sp}
    28d0:	39393939 	ldmdbcc	r9!, {r0, r3, r4, r5, r8, fp, ip, sp}
    28d4:	39393939 	ldmdbcc	r9!, {r0, r3, r4, r5, r8, fp, ip, sp}
    28d8:	39393939 	ldmdbcc	r9!, {r0, r3, r4, r5, r8, fp, ip, sp}
    28dc:	39393939 	ldmdbcc	r9!, {r0, r3, r4, r5, r8, fp, ip, sp}
    28e0:	39393939 	ldmdbcc	r9!, {r0, r3, r4, r5, r8, fp, ip, sp}
    28e4:	39393939 	ldmdbcc	r9!, {r0, r3, r4, r5, r8, fp, ip, sp}
    28e8:	39393939 	ldmdbcc	r9!, {r0, r3, r4, r5, r8, fp, ip, sp}
    28ec:	34313645 	ldrtcc	r3, [r1], #-1605	; 0xfffff9bb
    28f0:	004c4434 	subeq	r4, ip, r4, lsr r4
    28f4:	52465f5f 	subpl	r5, r6, #380	; 0x17c
    28f8:	5f544341 	svcpl	0x00544341
    28fc:	5f58414d 	svcpl	0x0058414d
    2900:	5830205f 	ldmdapl	r0!, {r0, r1, r2, r3, r4, r6, sp}
    2904:	46464637 			; <UNDEFINED> instruction: 0x46464637
    2908:	35312d50 	ldrcc	r2, [r1, #-3408]!	; 0xfffff2b0
    290c:	5f5f0052 	svcpl	0x005f0052
    2910:	55434341 	strbpl	r4, [r3, #-833]	; 0xfffffcbf
    2914:	50455f4d 	subpl	r5, r5, sp, asr #30
    2918:	4f4c4953 	svcmi	0x004c4953
    291c:	205f5f4e 	subscs	r5, pc, lr, asr #30
    2920:	50317830 	eorspl	r7, r1, r0, lsr r8
    2924:	4b35312d 	blmi	d4ede0 <_Min_Stack_Size+0xd4e9e0>
    2928:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	; <UNPREDICTABLE>
    292c:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    2930:	33545341 	cmpcc	r4, #67108865	; 0x4000001
    2934:	414d5f32 	cmpmi	sp, r2, lsr pc
    2938:	205f5f58 	subscs	r5, pc, r8, asr pc	; <UNPREDICTABLE>
    293c:	66377830 			; <UNDEFINED> instruction: 0x66377830
    2940:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    2944:	5f006666 	svcpl	0x00006666
    2948:	4f54415f 	svcmi	0x0054415f
    294c:	5f43494d 	svcpl	0x0043494d
    2950:	5f514553 	svcpl	0x00514553
    2954:	20545343 	subscs	r5, r4, r3, asr #6
    2958:	58450035 	stmdapl	r5, {r0, r2, r4, r5}^
    295c:	44504954 	ldrbmi	r4, [r0], #-2388	; 0xfffff6ac
    2960:	28203431 	stmdacs	r0!, {r0, r4, r5, sl, ip, sp}
    2964:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    2968:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    296c:	614d5f4f 	cmpvs	sp, pc, asr #30
    2970:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    2974:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    2978:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    297c:	34315f49 	ldrtcc	r5, [r1], #-3913	; 0xfffff0b7
    2980:	5047282c 	subpl	r2, r7, ip, lsr #16
    2984:	505f4f49 	subspl	r4, pc, r9, asr #30
    2988:	6f436e69 	svcvs	0x00436e69
    298c:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    2990:	7b29745f 	blvc	a5fb14 <_Min_Stack_Size+0xa5f714>
    2994:	4f495047 	svcmi	0x00495047
    2998:	50472c44 	subpl	r2, r7, r4, asr #24
    299c:	505f4f49 	subspl	r4, pc, r9, asr #30
    29a0:	315f4e49 	cmpcc	pc, r9, asr #28
    29a4:	50472c34 	subpl	r2, r7, r4, lsr ip
    29a8:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 288c <_Min_Stack_Size+0x248c>
    29ac:	5f45444f 	svcpl	0x0045444f
    29b0:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    29b4:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    29b8:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    29bc:	554f5f4f 	strbpl	r5, [pc, #-3919]	; 1a75 <_Min_Stack_Size+0x1675>
    29c0:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    29c4:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    29c8:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    29cc:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    29d0:	5047007d 	subpl	r0, r7, sp, ror r0
    29d4:	505f4f49 	subspl	r4, pc, r9, asr #30
    29d8:	535f4e49 	cmppl	pc, #1168	; 0x490
    29dc:	31205445 			; <UNDEFINED> instruction: 0x31205445
    29e0:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 1ae8 <_Min_Stack_Size+0x16e8>
    29e4:	31544e49 	cmpcc	r4, r9, asr #28
    29e8:	414d5f36 	cmpmi	sp, r6, lsr pc
    29ec:	205f5f58 	subscs	r5, pc, r8, asr pc	; <UNPREDICTABLE>
    29f0:	66667830 			; <UNDEFINED> instruction: 0x66667830
    29f4:	5f006666 	svcpl	0x00006666
    29f8:	5f51545f 	svcpl	0x0051545f
    29fc:	54494246 	strbpl	r4, [r9], #-582	; 0xfffffdba
    2a00:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    2a04:	5f003732 	svcpl	0x00003732
    2a08:	4345445f 	movtmi	r4, #21599	; 0x545f
    2a0c:	5f383231 	svcpl	0x00383231
    2a10:	4e425553 	mcrmi	5, 2, r5, cr2, cr3, {2}
    2a14:	414d524f 	cmpmi	sp, pc, asr #4
    2a18:	494d5f4c 	stmdbmi	sp, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    2a1c:	205f5f4e 	subscs	r5, pc, lr, asr #30
    2a20:	30302e30 	eorscc	r2, r0, r0, lsr lr
    2a24:	30303030 	eorscc	r3, r0, r0, lsr r0
    2a28:	30303030 	eorscc	r3, r0, r0, lsr r0
    2a2c:	30303030 	eorscc	r3, r0, r0, lsr r0
    2a30:	30303030 	eorscc	r3, r0, r0, lsr r0
    2a34:	30303030 	eorscc	r3, r0, r0, lsr r0
    2a38:	30303030 	eorscc	r3, r0, r0, lsr r0
    2a3c:	30303030 	eorscc	r3, r0, r0, lsr r0
    2a40:	45313030 	ldrmi	r3, [r1, #-48]!	; 0xffffffd0
    2a44:	3431362d 	ldrtcc	r3, [r1], #-1581	; 0xfffff9d3
    2a48:	004c4433 	subeq	r4, ip, r3, lsr r4
    2a4c:	49535f5f 	ldmdbmi	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    2a50:	464f455a 			; <UNDEFINED> instruction: 0x464f455a
    2a54:	4f48535f 	svcmi	0x0048535f
    2a58:	5f5f5452 	svcpl	0x005f5452
    2a5c:	5f003220 	svcpl	0x00003220
    2a60:	4c4c555f 	cfstr64mi	mvdx5, [ip], {95}	; 0x5f
    2a64:	55434341 	strbpl	r4, [r3, #-833]	; 0xfffffcbf
    2a68:	42465f4d 	submi	r5, r6, #308	; 0x134
    2a6c:	5f5f5449 	svcpl	0x005f5449
    2a70:	00323320 	eorseq	r3, r2, r0, lsr #6
    2a74:	6f6f425f 	svcvs	0x006f425f
    2a78:	5845006c 	stmdapl	r5, {r2, r3, r5, r6}^
    2a7c:	41504954 	cmpmi	r0, r4, asr r9
    2a80:	28203431 	stmdacs	r0!, {r0, r4, r5, sl, ip, sp}
    2a84:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    2a88:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    2a8c:	614d5f4f 	cmpvs	sp, pc, asr #30
    2a90:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    2a94:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    2a98:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    2a9c:	34315f49 	ldrtcc	r5, [r1], #-3913	; 0xfffff0b7
    2aa0:	5047282c 	subpl	r2, r7, ip, lsr #16
    2aa4:	505f4f49 	subspl	r4, pc, r9, asr #30
    2aa8:	6f436e69 	svcvs	0x00436e69
    2aac:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    2ab0:	7b29745f 	blvc	a5fc34 <_Min_Stack_Size+0xa5f834>
    2ab4:	4f495047 	svcmi	0x00495047
    2ab8:	50472c41 	subpl	r2, r7, r1, asr #24
    2abc:	505f4f49 	subspl	r4, pc, r9, asr #30
    2ac0:	315f4e49 	cmpcc	pc, r9, asr #28
    2ac4:	50472c34 	subpl	r2, r7, r4, lsr ip
    2ac8:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 29ac <_Min_Stack_Size+0x25ac>
    2acc:	5f45444f 	svcpl	0x0045444f
    2ad0:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    2ad4:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    2ad8:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
