mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    2adc:	554f5f4f 	strbpl	r5, [pc, #-3919]	; 1b95 <_Min_Stack_Size+0x1795>
    2ae0:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    2ae4:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    2ae8:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    2aec:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    2af0:	564e007d 			; <UNDEFINED> instruction: 0x564e007d
    2af4:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    2af8:	31524553 	cmpcc	r2, r3, asr r5
    2afc:	76282a20 	strtvc	r2, [r8], -r0, lsr #20
    2b00:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    2b04:	745f3233 	ldrbvc	r3, [pc], #-563	; 2b0c <_Min_Stack_Size+0x270c>
    2b08:	4e28292a 	vmulmi.f16	s4, s16, s21	; <UNPREDICTABLE>
    2b0c:	5f434956 	svcpl	0x00434956
    2b10:	45534142 	ldrbmi	r4, [r3, #-322]	; 0xfffffebe
    2b14:	3078302b 	rsbscc	r3, r8, fp, lsr #32
    2b18:	00293430 	eoreq	r3, r9, r0, lsr r4
    2b1c:	4349564e 	movtmi	r5, #38478	; 0x964e
    2b20:	5152495f 	cmppl	r2, pc, asr r9
    2b24:	445f3034 	ldrbmi	r3, [pc], #-52	; 2b2c <_Min_Stack_Size+0x272c>
    2b28:	29285349 	stmdbcs	r8!, {r0, r3, r6, r8, r9, ip, lr}
    2b2c:	564e2820 	strbpl	r2, [lr], -r0, lsr #16
    2b30:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    2b34:	31524543 	cmpcc	r2, r3, asr #10
    2b38:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    2b3c:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    2b40:	00292938 	eoreq	r2, r9, r8, lsr r9
    2b44:	42445f5f 	submi	r5, r4, #380	; 0x17c
    2b48:	45445f4c 	strbmi	r5, [r4, #-3916]	; 0xfffff0b4
    2b4c:	414d4943 	cmpmi	sp, r3, asr #18
    2b50:	49445f4c 	stmdbmi	r4, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    2b54:	205f5f47 	subscs	r5, pc, r7, asr #30
    2b58:	5f003731 	svcpl	0x00003731
    2b5c:	5a49535f 	bpl	12578e0 <_Min_Stack_Size+0x12574e0>
    2b60:	5f464f45 	svcpl	0x00464f45
    2b64:	474e4f4c 	strbmi	r4, [lr, -ip, asr #30]
    2b68:	554f445f 	strbpl	r4, [pc, #-1119]	; 2711 <_Min_Stack_Size+0x2311>
    2b6c:	5f454c42 	svcpl	0x00454c42
    2b70:	0038205f 	eorseq	r2, r8, pc, asr r0
    2b74:	52505f5f 	subspl	r5, r0, #380	; 0x17c
    2b78:	414d4741 	cmpmi	sp, r1, asr #14
    2b7c:	4445525f 	strbmi	r5, [r5], #-607	; 0xfffffda1
    2b80:	4e494645 	cdpmi	6, 4, cr4, cr9, cr5, {2}
    2b84:	58455f45 	stmdapl	r5, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
    2b88:	4d414e54 	stclmi	14, cr4, [r1, #-336]	; 0xfffffeb0
    2b8c:	00312045 	eorseq	r2, r1, r5, asr #32
    2b90:	43575f5f 	cmpmi	r7, #380	; 0x17c
    2b94:	5f524148 	svcpl	0x00524148
    2b98:	45505954 	ldrbmi	r5, [r0, #-2388]	; 0xfffff6ac
    2b9c:	75205f5f 	strvc	r5, [r0, #-3935]!	; 0xfffff0a1
    2ba0:	6769736e 	strbvs	r7, [r9, -lr, ror #6]!
    2ba4:	2064656e 	rsbcs	r6, r4, lr, ror #10
    2ba8:	00746e69 	rsbseq	r6, r4, r9, ror #28
    2bac:	4349564e 	movtmi	r5, #38478	; 0x964e
    2bb0:	4543495f 	strbmi	r4, [r3, #-2399]	; 0xfffff6a1
    2bb4:	2a203152 	bcs	80f104 <_Min_Stack_Size+0x80ed04>
    2bb8:	69757628 	ldmdbvs	r5!, {r3, r5, r9, sl, ip, sp, lr}^
    2bbc:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    2bc0:	292a745f 	stmdbcs	sl!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    2bc4:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    2bc8:	41425f43 	cmpmi	r2, r3, asr #30
    2bcc:	302b4553 	eorcc	r4, fp, r3, asr r5
    2bd0:	34383078 	ldrtcc	r3, [r8], #-120	; 0xffffff88
    2bd4:	58450029 	stmdapl	r5, {r0, r3, r5}^
    2bd8:	5f344954 	svcpl	0x00344954
    2bdc:	48515249 	ldmdami	r1, {r0, r3, r6, r9, ip, lr}^
    2be0:	6c646e61 	stclvs	14, cr6, [r4], #-388	; 0xfffffe7c
    2be4:	45007265 	strmi	r7, [r0, #-613]	; 0xfffffd9b
    2be8:	50495458 	subpl	r5, r9, r8, asr r4
    2bec:	20353143 	eorscs	r3, r5, r3, asr #2
    2bf0:	54584528 	ldrbpl	r4, [r8], #-1320	; 0xfffffad8
    2bf4:	50475f49 	subpl	r5, r7, r9, asr #30
    2bf8:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 2adc <_Min_Stack_Size+0x26dc>
    2bfc:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
    2c00:	745f676e 	ldrbvc	r6, [pc], #-1902	; 2c08 <_Min_Stack_Size+0x2808>
    2c04:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
    2c08:	315f4954 	cmpcc	pc, r4, asr r9	; <UNPREDICTABLE>
    2c0c:	47282c35 			; <UNDEFINED> instruction: 0x47282c35
    2c10:	5f4f4950 	svcpl	0x004f4950
    2c14:	436e6950 	cmnmi	lr, #80, 18	; 0x140000
    2c18:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    2c1c:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    2c20:	4950477b 	ldmdbmi	r0, {r0, r1, r3, r4, r5, r6, r8, r9, sl, lr}^
    2c24:	472c434f 	strmi	r4, [ip, -pc, asr #6]!
    2c28:	5f4f4950 	svcpl	0x004f4950
    2c2c:	5f4e4950 	svcpl	0x004e4950
    2c30:	472c3531 			; <UNDEFINED> instruction: 0x472c3531
    2c34:	5f4f4950 	svcpl	0x004f4950
    2c38:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    2c3c:	5f46415f 	svcpl	0x0046415f
    2c40:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    2c44:	50472c54 	subpl	r2, r7, r4, asr ip
    2c48:	4f5f4f49 	svcmi	0x005f4f49
    2c4c:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    2c50:	50535f54 	subspl	r5, r3, r4, asr pc
    2c54:	5f444545 	svcpl	0x00444545
    2c58:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
    2c5c:	5f007d7d 	svcpl	0x00007d7d
    2c60:	4343475f 	movtmi	r4, #14175	; 0x375f
    2c64:	5641485f 			; <UNDEFINED> instruction: 0x5641485f
    2c68:	59535f45 	ldmdbpl	r3, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
    2c6c:	435f434e 	cmpmi	pc, #939524097	; 0x38000001
    2c70:	41504d4f 	cmpmi	r0, pc, asr #26
    2c74:	415f4552 	cmpmi	pc, r2, asr r5	; <UNPREDICTABLE>
    2c78:	535f444e 	cmppl	pc, #1308622848	; 0x4e000000
    2c7c:	5f504157 	svcpl	0x00504157
    2c80:	00312032 	eorseq	r2, r1, r2, lsr r0
    2c84:	4349564e 	movtmi	r5, #38478	; 0x964e
    2c88:	5152495f 	cmppl	r2, pc, asr r9
    2c8c:	455f3332 	ldrbmi	r3, [pc, #-818]	; 2962 <_Min_Stack_Size+0x2562>
    2c90:	2029284e 	eorcs	r2, r9, lr, asr #16
    2c94:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    2c98:	53495f43 	movtpl	r5, #40771	; 0x9f43
    2c9c:	20305245 	eorscs	r5, r0, r5, asr #4
    2ca0:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    2ca4:	323c3c31 	eorscc	r3, ip, #12544	; 0x3100
    2ca8:	00292933 	eoreq	r2, r9, r3, lsr r9
    2cac:	46535f5f 	usaxmi	r5, r3, pc	; <UNPREDICTABLE>
    2cb0:	54434152 	strbpl	r4, [r3], #-338	; 0xfffffeae
    2cb4:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    2cb8:	30205f5f 	eorcc	r5, r0, pc, asr pc
    2cbc:	50463758 	subpl	r3, r6, r8, asr r7
    2cc0:	5248372d 	subpl	r3, r8, #11796480	; 0xb40000
    2cc4:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 1dcc <_Min_Stack_Size+0x19cc>
    2cc8:	5f544e49 	svcpl	0x00544e49
    2ccc:	54534146 	ldrbpl	r4, [r3], #-326	; 0xfffffeba
    2cd0:	545f3436 	ldrbpl	r3, [pc], #-1078	; 2cd8 <_Min_Stack_Size+0x28d8>
    2cd4:	5f455059 	svcpl	0x00455059
    2cd8:	6f6c205f 	svcvs	0x006c205f
    2cdc:	6c20676e 	stcvs	7, cr6, [r0], #-440	; 0xfffffe48
    2ce0:	20676e6f 	rsbcs	r6, r7, pc, ror #28
    2ce4:	69736e75 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, sl, fp, sp, lr}^
    2ce8:	64656e67 	strbtvs	r6, [r5], #-3687	; 0xfffff199
    2cec:	746e6920 	strbtvc	r6, [lr], #-2336	; 0xfffff6e0
    2cf0:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    2cf4:	46415f49 	strbmi	r5, [r1], -r9, asr #30
    2cf8:	505f4f49 	subspl	r4, pc, r9, asr #30
    2cfc:	5674726f 	ldrbtpl	r7, [r4], -pc, ror #4
    2d00:	65756c61 	ldrbvs	r6, [r5, #-3169]!	; 0xfffff39f
    2d04:	20295828 	eorcs	r5, r9, r8, lsr #16
    2d08:	3d582828 	ldclcc	8, cr2, [r8, #-160]	; 0xffffff60
    2d0c:	4950473d 	ldmdbmi	r0, {r0, r2, r3, r4, r5, r8, r9, sl, lr}^
    2d10:	3f29414f 	svccc	0x0029414f
    2d14:	28203a30 	stmdacs	r0!, {r4, r5, r9, fp, ip, sp}
    2d18:	473d3d58 			; <UNDEFINED> instruction: 0x473d3d58
    2d1c:	424f4950 	submi	r4, pc, #80, 18	; 0x140000
    2d20:	3a313f29 	bcc	c529cc <_Min_Stack_Size+0xc525cc>
    2d24:	3d582820 	ldclcc	8, cr2, [r8, #-128]	; 0xffffff80
    2d28:	4950473d 	ldmdbmi	r0, {r0, r2, r3, r4, r5, r8, r9, sl, lr}^
    2d2c:	3f29434f 	svccc	0x0029434f
    2d30:	28203a32 	stmdacs	r0!, {r1, r4, r5, r9, fp, ip, sp}
    2d34:	473d3d58 			; <UNDEFINED> instruction: 0x473d3d58
    2d38:	444f4950 	strbmi	r4, [pc], #-2384	; 2d40 <_Min_Stack_Size+0x2940>
    2d3c:	3a333f29 	bcc	cd29e8 <_Min_Stack_Size+0xcd25e8>
    2d40:	3d582820 	ldclcc	8, cr2, [r8, #-128]	; 0xffffff80
    2d44:	4950473d 	ldmdbmi	r0, {r0, r2, r3, r4, r5, r8, r9, sl, lr}^
    2d48:	3f29454f 	svccc	0x0029454f
    2d4c:	29303a34 	ldmdbcs	r0!, {r2, r4, r5, r9, fp, ip, sp}
    2d50:	53595300 	cmppl	r9, #0, 6
    2d54:	5f4d4554 	svcpl	0x004d4554
    2d58:	4f4d454d 	svcmi	0x004d454d
    2d5c:	425f5952 	subsmi	r5, pc, #1343488	; 0x148000
    2d60:	20455341 	subcs	r5, r5, r1, asr #6
    2d64:	46317830 			; <UNDEFINED> instruction: 0x46317830
    2d68:	30464646 	subcc	r4, r6, r6, asr #12
    2d6c:	5f003030 	svcpl	0x00003030
    2d70:	544c465f 	strbpl	r4, [ip], #-1631	; 0xfffff9a1
    2d74:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    2d78:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    2d7c:	3537312e 	ldrcc	r3, [r7, #-302]!	; 0xfffffed2
    2d80:	33343934 	teqcc	r4, #52, 18	; 0xd0000
    2d84:	32383035 	eorscc	r3, r8, #53	; 0x35
    2d88:	37383232 			; <UNDEFINED> instruction: 0x37383232
    2d8c:	332d6535 			; <UNDEFINED> instruction: 0x332d6535
    2d90:	5f004638 	svcpl	0x00004638
    2d94:	5f41485f 	svcpl	0x0041485f
    2d98:	54494246 	strbpl	r4, [r9], #-582	; 0xfffffdba
    2d9c:	37205f5f 			; <UNDEFINED> instruction: 0x37205f5f
    2da0:	49464100 	stmdbmi	r6, {r8, lr}^
    2da4:	79545f4f 	ldmdbvc	r4, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    2da8:	65646570 	strbvs	r6, [r4, #-1392]!	; 0xfffffa90
    2dac:	5f5f0066 	svcpl	0x005f0066
    2db0:	5f544c46 	svcpl	0x00544c46
    2db4:	5f58414d 	svcpl	0x0058414d
    2db8:	2e33205f 	mrccs	0, 1, r2, cr3, cr15, {2}
    2dbc:	38323034 	ldmdacc	r2!, {r2, r4, r5, ip, sp}
    2dc0:	36343332 			; <UNDEFINED> instruction: 0x36343332
    2dc4:	35383336 	ldrcc	r3, [r8, #-822]!	; 0xfffffcca
    2dc8:	36383832 			; <UNDEFINED> instruction: 0x36383832
    2dcc:	38332b65 	ldmdacc	r3!, {r0, r2, r5, r6, r8, r9, fp, sp}
    2dd0:	5f5f0046 	svcpl	0x005f0046
    2dd4:	5f434347 	svcpl	0x00434347
    2dd8:	4d4f5441 	cfstrdmi	mvd5, [pc, #-260]	; 2cdc <_Min_Stack_Size+0x28dc>
    2ddc:	4c5f4349 	mrrcmi	3, 4, r4, pc, cr9	; <UNPREDICTABLE>
    2de0:	474e4f4c 	strbmi	r4, [lr, -ip, asr #30]
    2de4:	434f4c5f 	movtmi	r4, #64607	; 0xfc5f
    2de8:	52465f4b 	subpl	r5, r6, #300	; 0x12c
    2dec:	31204545 			; <UNDEFINED> instruction: 0x31204545
    2df0:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 1ef8 <_Min_Stack_Size+0x1af8>
    2df4:	41524653 	cmpmi	r2, r3, asr r6
    2df8:	495f5443 	ldmdbmi	pc, {r0, r1, r6, sl, ip, lr}^	; <UNPREDICTABLE>
    2dfc:	5f544942 	svcpl	0x00544942
    2e00:	0030205f 	eorseq	r2, r0, pc, asr r0
    2e04:	4f495047 	svcmi	0x00495047
    2e08:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    2e0c:	5f545550 	svcpl	0x00545550
    2e10:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    2e14:	30355f44 	eorscc	r5, r5, r4, asr #30
    2e18:	205a484d 	subscs	r4, sl, sp, asr #16
    2e1c:	50470033 	subpl	r0, r7, r3, lsr r0
    2e20:	505f4f49 	subspl	r4, pc, r9, asr #30
    2e24:	6f436e69 	svcvs	0x00436e69
    2e28:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    2e2c:	5f00745f 	svcpl	0x0000745f
    2e30:	4653555f 			; <UNDEFINED> instruction: 0x4653555f
    2e34:	54434152 	strbpl	r4, [r3], #-338	; 0xfffffeae
    2e38:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    2e3c:	30205f5f 	eorcc	r5, r0, pc, asr pc
    2e40:	4855302e 	ldmdami	r5, {r1, r2, r3, r5, ip, sp}^
    2e44:	53550052 	cmppl	r5, #82	; 0x52
    2e48:	32545241 	subscc	r5, r4, #268435460	; 0x10000004
    2e4c:	55282820 	strpl	r2, [r8, #-2080]!	; 0xfffff7e0
    2e50:	54524153 	ldrbpl	r4, [r2], #-339	; 0xfffffead
    2e54:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    2e58:	66656465 	strbtvs	r6, [r5], -r5, ror #8
    2e5c:	5355292a 	cmppl	r5, #688128	; 0xa8000
    2e60:	32545241 	subscc	r5, r4, #268435460	; 0x10000004
    2e64:	5341425f 	movtpl	r4, #4703	; 0x125f
    2e68:	5f002945 	svcpl	0x00002945
    2e6c:	4d52415f 	ldfmie	f4, [r2, #-380]	; 0xfffffe84
    2e70:	4f454e5f 	svcmi	0x00454e5f
    2e74:	3249004e 	subcc	r0, r9, #78	; 0x4e
    2e78:	425f3143 	subsmi	r3, pc, #-1073741808	; 0xc0000010
    2e7c:	20455341 	subcs	r5, r5, r1, asr #6
    2e80:	30347830 	eorscc	r7, r4, r0, lsr r8
    2e84:	34353030 	ldrtcc	r3, [r5], #-48	; 0xffffffd0
    2e88:	5f003030 	svcpl	0x00003030
    2e8c:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    2e90:	4d5f3854 	ldclmi	8, cr3, [pc, #-336]	; 2d48 <_Min_Stack_Size+0x2948>
    2e94:	5f5f5841 	svcpl	0x005f5841
    2e98:	66783020 	ldrbtvs	r3, [r8], -r0, lsr #32
    2e9c:	5f5f0066 	svcpl	0x005f0066
    2ea0:	4c42444c 	cfstrdmi	mvd4, [r2], {76}	; 0x4c
    2ea4:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    2ea8:	5058455f 	subspl	r4, r8, pc, asr r5
    2eac:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    2eb0:	00343230 	eorseq	r3, r4, r0, lsr r2
    2eb4:	334d5453 	movtcc	r5, #54355	; 0xd453
    2eb8:	30314632 	eorscc	r4, r1, r2, lsr r6
    2ebc:	54384333 	ldrtpl	r4, [r8], #-819	; 0xfffffccd
    2ec0:	00312078 	eorseq	r2, r1, r8, ror r0
    2ec4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    2ec8:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    2ecc:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    2ed0:	745f6769 	ldrbvc	r6, [pc], #-1897	; 2ed8 <_Min_Stack_Size+0x2ad8>
    2ed4:	445f5f00 	ldrbmi	r5, [pc], #-3840	; 2edc <_Min_Stack_Size+0x2adc>
    2ed8:	485f4c42 	ldmdami	pc, {r1, r6, sl, fp, lr}^	; <UNPREDICTABLE>
    2edc:	445f5341 	ldrbmi	r5, [pc], #-833	; 2ee4 <_Min_Stack_Size+0x2ae4>
    2ee0:	524f4e45 	subpl	r4, pc, #1104	; 0x450
    2ee4:	205f5f4d 	subscs	r5, pc, sp, asr #30
    2ee8:	58450031 	stmdapl	r5, {r0, r4, r5}^
    2eec:	45504954 	ldrbmi	r4, [r0, #-2388]	; 0xfffff6ac
    2ef0:	28203131 	stmdacs	r0!, {r0, r4, r5, r8, ip, sp}
    2ef4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    2ef8:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    2efc:	614d5f4f 	cmpvs	sp, pc, asr #30
    2f00:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    2f04:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    2f08:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    2f0c:	31315f49 	teqcc	r1, r9, asr #30
    2f10:	5047282c 	subpl	r2, r7, ip, lsr #16
    2f14:	505f4f49 	subspl	r4, pc, r9, asr #30
    2f18:	6f436e69 	svcvs	0x00436e69
    2f1c:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    2f20:	7b29745f 	blvc	a600a4 <_Min_Stack_Size+0xa5fca4>
    2f24:	4f495047 	svcmi	0x00495047
    2f28:	50472c45 	subpl	r2, r7, r5, asr #24
    2f2c:	505f4f49 	subspl	r4, pc, r9, asr #30
    2f30:	315f4e49 	cmpcc	pc, r9, asr #28
    2f34:	50472c31 	subpl	r2, r7, r1, lsr ip
    2f38:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 2e1c <_Min_Stack_Size+0x2a1c>
    2f3c:	5f45444f 	svcpl	0x0045444f
    2f40:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    2f44:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    2f48:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    2f4c:	554f5f4f 	strbpl	r5, [pc, #-3919]	; 2005 <_Min_Stack_Size+0x1c05>
    2f50:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    2f54:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    2f58:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    2f5c:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    2f60:	5f5f007d 	svcpl	0x005f007d
    2f64:	5f585847 	svcpl	0x00585847
    2f68:	5f494241 	svcpl	0x00494241
    2f6c:	53524556 	cmppl	r2, #360710144	; 0x15800000
    2f70:	204e4f49 	subcs	r4, lr, r9, asr #30
    2f74:	31313031 	teqcc	r1, r1, lsr r0
    2f78:	445f5f00 	ldrbmi	r5, [pc], #-3840	; 2f80 <_Min_Stack_Size+0x2b80>
    2f7c:	42465f41 	submi	r5, r6, #260	; 0x104
    2f80:	5f5f5449 	svcpl	0x005f5449
    2f84:	00313320 	eorseq	r3, r1, r0, lsr #6
    2f88:	4349564e 	movtmi	r5, #38478	; 0x964e
    2f8c:	5152495f 	cmppl	r2, pc, asr r9
    2f90:	455f3633 	ldrbmi	r3, [pc, #-1587]	; 2965 <_Min_Stack_Size+0x2565>
    2f94:	2029284e 	eorcs	r2, r9, lr, asr #16
    2f98:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    2f9c:	53495f43 	movtpl	r5, #40771	; 0x9f43
    2fa0:	20315245 	eorscs	r5, r1, r5, asr #4
    2fa4:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    2fa8:	343c3c31 	ldrtcc	r3, [ip], #-3121	; 0xfffff3cf
    2fac:	5f002929 	svcpl	0x00002929
    2fb0:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
    2fb4:	41454c5f 	cmpmi	r5, pc, asr ip
    2fb8:	36315453 			; <UNDEFINED> instruction: 0x36315453
    2fbc:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    2fc0:	30205f5f 	eorcc	r5, r0, pc, asr pc
    2fc4:	66663778 			; <UNDEFINED> instruction: 0x66663778
    2fc8:	50470066 	subpl	r0, r7, r6, rrx
    2fcc:	5f424f49 	svcpl	0x00424f49
    2fd0:	45534142 	ldrbmi	r4, [r3, #-322]	; 0xfffffebe
    2fd4:	34783020 	ldrbtcc	r3, [r8], #-32	; 0xffffffe0
    2fd8:	30313030 	eorscc	r3, r1, r0, lsr r0
    2fdc:	00303043 	eorseq	r3, r0, r3, asr #32
    2fe0:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    2fe4:	45445f54 	strbmi	r5, [r4, #-3924]	; 0xfffff0ac
    2fe8:	4d524f4e 	ldclmi	15, cr4, [r2, #-312]	; 0xfffffec8
    2fec:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    2ff0:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    2ff4:	3130342e 	teqcc	r0, lr, lsr #8
    2ff8:	34383932 	ldrtcc	r3, [r8], #-2354	; 0xfffff6ce
    2ffc:	32333436 	eorscc	r3, r3, #905969664	; 0x36000000
    3000:	37313834 			; <UNDEFINED> instruction: 0x37313834
    3004:	342d6531 	strtcc	r6, [sp], #-1329	; 0xfffffacf
    3008:	4d004635 	stcmi	6, cr4, [r0, #-212]	; 0xffffff2c
    300c:	32525041 	subscc	r5, r2, #65	; 0x41
    3010:	685f5f00 	ldmdavs	pc, {r8, r9, sl, fp, ip, lr}^	; <UNPREDICTABLE>
    3014:	695f7361 	ldmdbvs	pc, {r0, r5, r6, r8, r9, ip, sp, lr}^	; <UNPREDICTABLE>
    3018:	756c636e 	strbvc	r6, [ip, #-878]!	; 0xfffffc92
    301c:	6e5f6564 	cdpvs	5, 5, cr6, cr15, cr4, {3}
    3020:	28747865 	ldmdacs	r4!, {r0, r2, r5, r6, fp, ip, sp, lr}^
    3024:	29525453 	ldmdbcs	r2, {r0, r1, r4, r6, sl, ip, lr}^
    3028:	685f5f20 	ldmdavs	pc, {r5, r8, r9, sl, fp, ip, lr}^	; <UNPREDICTABLE>
    302c:	695f7361 	ldmdbvs	pc, {r0, r5, r6, r8, r9, ip, sp, lr}^	; <UNPREDICTABLE>
    3030:	756c636e 	strbvc	r6, [ip, #-878]!	; 0xfffffc92
    3034:	6e5f6564 	cdpvs	5, 5, cr6, cr15, cr4, {3}
    3038:	5f747865 	svcpl	0x00747865
    303c:	5453285f 	ldrbpl	r2, [r3], #-2143	; 0xfffff7a1
    3040:	47002952 	smlsdmi	r0, r2, r9, r2
    3044:	5f4f4950 	svcpl	0x004f4950
    3048:	65707954 	ldrbvs	r7, [r0, #-2388]!	; 0xfffff6ac
    304c:	00666564 	rsbeq	r6, r6, r4, ror #10
    3050:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    3054:	3233544e 	eorscc	r5, r3, #1308622848	; 0x4e000000
    3058:	6328435f 			; <UNDEFINED> instruction: 0x6328435f
    305c:	20632029 	rsbcs	r2, r3, r9, lsr #32
    3060:	55202323 	strpl	r2, [r0, #-803]!	; 0xfffffcdd
    3064:	5845004c 	stmdapl	r5, {r2, r3, r6}^
    3068:	335f4954 	cmpcc	pc, #84, 18	; 0x150000
    306c:	5f003320 	svcpl	0x00003320
    3070:	4341555f 	movtmi	r5, #5471	; 0x155f
    3074:	5f4d5543 	svcpl	0x004d5543
    3078:	5f4e494d 	svcpl	0x004e494d
    307c:	2e30205f 	mrccs	0, 1, r2, cr0, cr15, {2}
    3080:	004b5530 	subeq	r5, fp, r0, lsr r5
    3084:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    3088:	31314250 	teqcc	r1, r0, asr r2
    308c:	58452820 	stmdapl	r5, {r5, fp, sp}^
    3090:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
    3094:	5f4f4950 	svcpl	0x004f4950
    3098:	7070614d 	rsbsvc	r6, r0, sp, asr #2
    309c:	5f676e69 	svcpl	0x00676e69
    30a0:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
    30a4:	5f495458 	svcpl	0x00495458
    30a8:	282c3131 	stmdacs	ip!, {r0, r4, r5, r8, ip, sp}
    30ac:	4f495047 	svcmi	0x00495047
    30b0:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    30b4:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    30b8:	745f6769 	ldrbvc	r6, [pc], #-1897	; 30c0 <_Min_Stack_Size+0x2cc0>
    30bc:	50477b29 	subpl	r7, r7, r9, lsr #22
    30c0:	2c424f49 	mcrrcs	15, 4, r4, r2, cr9
    30c4:	4f495047 	svcmi	0x00495047
    30c8:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    30cc:	2c31315f 	ldfcss	f3, [r1], #-380	; 0xfffffe84
    30d0:	4f495047 	svcmi	0x00495047
    30d4:	444f4d5f 	strbmi	r4, [pc], #-3423	; 30dc <_Min_Stack_Size+0x2cdc>
    30d8:	46415f45 	strbmi	r5, [r1], -r5, asr #30
    30dc:	504e495f 	subpl	r4, lr, pc, asr r9
    30e0:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
    30e4:	5f4f4950 	svcpl	0x004f4950
    30e8:	5054554f 	subspl	r5, r4, pc, asr #10
    30ec:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    30f0:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
    30f4:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    30f8:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    30fc:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    3100:	50455f54 	subpl	r5, r5, r4, asr pc
    3104:	4f4c4953 	svcmi	0x004c4953
    3108:	205f5f4e 	subscs	r5, pc, lr, asr #30
    310c:	39312e31 	ldmdbcc	r1!, {r0, r4, r5, r9, sl, fp, sp}
    3110:	32393032 	eorscc	r3, r9, #50	; 0x32
    3114:	35353938 	ldrcc	r3, [r5, #-2360]!	; 0xfffff6c8
    3118:	31383730 	teqcc	r8, r0, lsr r7
    311c:	2d653532 	cfstr64cs	mvdx3, [r5, #-200]!	; 0xffffff38
    3120:	52004637 	andpl	r4, r0, #57671680	; 0x3700000
    3124:	28204343 	stmdacs	r0!, {r0, r1, r6, r8, r9, lr}
    3128:	43435228 	movtmi	r5, #12840	; 0x3228
    312c:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    3130:	66656465 	strbtvs	r6, [r5], -r5, ror #8
    3134:	4352292a 	cmpmi	r2, #688128	; 0xa8000
    3138:	41425f43 	cmpmi	r2, r3, asr #30
    313c:	00294553 	eoreq	r4, r9, r3, asr r5
    3140:	43475f5f 	movtmi	r5, #32607	; 0x7f5f
    3144:	54415f43 	strbpl	r5, [r1], #-3907	; 0xfffff0bd
    3148:	43494d4f 	movtmi	r4, #40271	; 0x9d4f
    314c:	4f48535f 	svcmi	0x0048535f
    3150:	4c5f5452 	cfldrdmi	mvd5, [pc], {82}	; 0x52
    3154:	5f4b434f 	svcpl	0x004b434f
    3158:	45455246 	strbmi	r5, [r5, #-582]	; 0xfffffdba
    315c:	5f003220 	svcpl	0x00003220
    3160:	4c42445f 	cfstrdmi	mvd4, [r2], {95}	; 0x5f
    3164:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    3168:	5f30315f 	svcpl	0x0030315f
    316c:	5f505845 	svcpl	0x00505845
    3170:	3033205f 	eorscc	r2, r3, pc, asr r0
    3174:	5f5f0038 	svcpl	0x005f0038
    3178:	44525450 	ldrbmi	r5, [r2], #-1104	; 0xfffffbb0
    317c:	5f464649 	svcpl	0x00464649
    3180:	45505954 	ldrbmi	r5, [r0, #-2388]	; 0xfffff6ac
    3184:	69205f5f 	stmdbvs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    3188:	5300746e 	movwpl	r7, #1134	; 0x46e
    318c:	5f314950 	svcpl	0x00314950
    3190:	45534142 	ldrbmi	r4, [r3, #-322]	; 0xfffffebe
    3194:	34783020 	ldrbtcc	r3, [r8], #-32	; 0xffffffe0
    3198:	33313030 	teqcc	r1, #48	; 0x30
    319c:	00303030 	eorseq	r3, r0, r0, lsr r0
    31a0:	41555f5f 	cmpmi	r5, pc, asr pc
    31a4:	4d554343 	ldclmi	3, cr4, [r5, #-268]	; 0xfffffef4
    31a8:	5350455f 	cmppl	r0, #398458880	; 0x17c00000
    31ac:	4e4f4c49 	cdpmi	12, 4, cr4, cr15, cr9, {2}
    31b0:	30205f5f 	eorcc	r5, r0, pc, asr pc
    31b4:	2d503178 	ldfcse	f3, [r0, #-480]	; 0xfffffe20
    31b8:	4b553631 	blmi	1550a84 <_Min_Stack_Size+0x1550684>
    31bc:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    31c0:	31445049 	cmpcc	r4, r9, asr #32
    31c4:	45282032 	strmi	r2, [r8, #-50]!	; 0xffffffce
    31c8:	5f495458 	svcpl	0x00495458
    31cc:	4f495047 	svcmi	0x00495047
    31d0:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    31d4:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    31d8:	7b29745f 	blvc	a6035c <_Min_Stack_Size+0xa5ff5c>
    31dc:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    31e0:	2c32315f 	ldfcss	f3, [r2], #-380	; 0xfffffe84
    31e4:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    31e8:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    31ec:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    31f0:	5f676966 	svcpl	0x00676966
    31f4:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    31f8:	444f4950 	strbmi	r4, [pc], #-2384	; 3200 <_Min_Stack_Size+0x2e00>
