mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    31fc:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    3200:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    3204:	32315f4e 	eorscc	r5, r1, #312	; 0x138
    3208:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    320c:	4f4d5f4f 	svcmi	0x004d5f4f
    3210:	415f4544 	cmpmi	pc, r4, asr #10
    3214:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    3218:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    321c:	4f495047 	svcmi	0x00495047
    3220:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    3224:	5f545550 	svcpl	0x00545550
    3228:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    322c:	4f4e5f44 	svcmi	0x004e5f44
    3230:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    3234:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    3238:	52495f43 	subpl	r5, r9, #268	; 0x10c
    323c:	5f353351 	svcpl	0x00353351
    3240:	29284e45 	stmdbcs	r8!, {r0, r2, r6, r9, sl, fp, lr}
    3244:	564e2820 	strbpl	r2, [lr], -r0, lsr #16
    3248:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    324c:	31524553 	cmpcc	r2, r3, asr r5
    3250:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    3254:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    3258:	00292933 	eoreq	r2, r9, r3, lsr r9
    325c:	53555f5f 	cmppl	r5, #380	; 0x17c
    3260:	55434341 	strbpl	r4, [r3, #-833]	; 0xfffffcbf
    3264:	42465f4d 	submi	r5, r6, #308	; 0x134
    3268:	5f5f5449 	svcpl	0x005f5449
    326c:	5f003820 	svcpl	0x00003820
    3270:	4343475f 	movtmi	r4, #14175	; 0x375f
    3274:	4f54415f 	svcmi	0x0054415f
    3278:	5f43494d 	svcpl	0x0043494d
    327c:	54534554 	ldrbpl	r4, [r3], #-1364	; 0xfffffaac
    3280:	444e415f 	strbmi	r4, [lr], #-351	; 0xfffffea1
    3284:	5445535f 	strbpl	r5, [r5], #-863	; 0xfffffca1
    3288:	5552545f 	ldrbpl	r5, [r2, #-1119]	; 0xfffffba1
    328c:	4c415645 	mcrrmi	6, 4, r5, r1, cr5
    3290:	5f003120 	svcpl	0x00003120
    3294:	43414c5f 	movtmi	r4, #7263	; 0x1c5f
    3298:	5f4d5543 	svcpl	0x004d5543
    329c:	54494246 	strbpl	r4, [r9], #-582	; 0xfffffdba
    32a0:	33205f5f 			; <UNDEFINED> instruction: 0x33205f5f
    32a4:	5f5f0031 	svcpl	0x005f0031
    32a8:	33544c46 	cmpcc	r4, #17920	; 0x4600
    32ac:	41485f32 	cmpmi	r8, r2, lsr pc
    32b0:	55515f53 	ldrbpl	r5, [r1, #-3923]	; 0xfffff0ad
    32b4:	5f544549 	svcpl	0x00544549
    32b8:	5f4e414e 	svcpl	0x004e414e
    32bc:	0031205f 	eorseq	r2, r1, pc, asr r0
    32c0:	4f495047 	svcmi	0x00495047
    32c4:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    32c8:	5f545550 	svcpl	0x00545550
    32cc:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    32d0:	4d325f44 	ldcmi	15, cr5, [r2, #-272]!	; 0xfffffef0
    32d4:	32205a48 	eorcc	r5, r0, #72, 20	; 0x48000
    32d8:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	; <UNPREDICTABLE>
    32dc:	5f4c4244 	svcpl	0x004c4244
    32e0:	5f534148 	svcpl	0x00534148
    32e4:	49464e49 	stmdbmi	r6, {r0, r3, r6, r9, sl, fp, lr}^
    32e8:	5954494e 	ldmdbpl	r4, {r1, r2, r3, r6, r8, fp, lr}^
    32ec:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    32f0:	545f5f00 	ldrbpl	r5, [pc], #-3840	; 32f8 <_Min_Stack_Size+0x2ef8>
    32f4:	42465f41 	submi	r5, r6, #260	; 0x104
    32f8:	5f5f5449 	svcpl	0x005f5449
    32fc:	00333620 	eorseq	r3, r3, r0, lsr #12
    3300:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    3304:	32314150 	eorscc	r4, r1, #80, 2
    3308:	58452820 	stmdapl	r5, {r5, fp, sp}^
    330c:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
    3310:	5f4f4950 	svcpl	0x004f4950
    3314:	7070614d 	rsbsvc	r6, r0, sp, asr #2
    3318:	5f676e69 	svcpl	0x00676e69
    331c:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
    3320:	5f495458 	svcpl	0x00495458
    3324:	282c3231 	stmdacs	ip!, {r0, r4, r5, r9, ip, sp}
    3328:	4f495047 	svcmi	0x00495047
    332c:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    3330:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    3334:	745f6769 	ldrbvc	r6, [pc], #-1897	; 333c <_Min_Stack_Size+0x2f3c>
    3338:	50477b29 	subpl	r7, r7, r9, lsr #22
    333c:	2c414f49 	mcrrcs	15, 4, r4, r1, cr9
    3340:	4f495047 	svcmi	0x00495047
    3344:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    3348:	2c32315f 	ldfcss	f3, [r2], #-380	; 0xfffffe84
    334c:	4f495047 	svcmi	0x00495047
    3350:	444f4d5f 	strbmi	r4, [pc], #-3423	; 3358 <_Min_Stack_Size+0x2f58>
    3354:	46415f45 	strbmi	r5, [r1], -r5, asr #30
    3358:	504e495f 	subpl	r4, lr, pc, asr r9
    335c:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
    3360:	5f4f4950 	svcpl	0x004f4950
    3364:	5054554f 	subspl	r5, r4, pc, asr #10
    3368:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    336c:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
    3370:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    3374:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    3378:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    337c:	58323354 	ldmdapl	r2!, {r2, r4, r6, r8, r9, ip, sp}
    3380:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    3384:	5f30315f 	svcpl	0x0030315f
    3388:	5f505845 	svcpl	0x00505845
    338c:	3033205f 	eorscc	r2, r3, pc, asr r0
    3390:	5f5f0038 	svcpl	0x005f0038
    3394:	5f4d5241 	svcpl	0x004d5241
    3398:	48435241 	stmdami	r3, {r0, r6, r9, ip, lr}^
    339c:	5458455f 	ldrbpl	r4, [r8], #-1375	; 0xfffffaa1
    33a0:	4944495f 	stmdbmi	r4, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    33a4:	205f5f56 	subscs	r5, pc, r6, asr pc	; <UNPREDICTABLE>
    33a8:	5f5f0031 	svcpl	0x005f0031
    33ac:	5f4d5241 	svcpl	0x004d5241
    33b0:	20534350 	subscs	r4, r3, r0, asr r3
    33b4:	46410031 			; <UNDEFINED> instruction: 0x46410031
    33b8:	425f4f49 	subsmi	r4, pc, #292	; 0x124
    33bc:	20455341 	subcs	r5, r5, r1, asr #6
    33c0:	30347830 	eorscc	r7, r4, r0, lsr r8
    33c4:	30303130 	eorscc	r3, r0, r0, lsr r1
    33c8:	5f003030 	svcpl	0x00003030
    33cc:	544c465f 	strbpl	r4, [ip], #-1631	; 0xfffff9a1
    33d0:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    33d4:	5058455f 	subspl	r4, r8, pc, asr r5
    33d8:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    33dc:	5f003832 	svcpl	0x00003832
    33e0:	4749535f 	smlsldmi	r5, r9, pc, r3	; <UNPREDICTABLE>
    33e4:	4f54415f 	svcmi	0x0054415f
    33e8:	5f43494d 	svcpl	0x0043494d
    33ec:	5f4e494d 	svcpl	0x004e494d
    33f0:	2d28205f 	stccs	0, cr2, [r8, #-380]!	; 0xfffffe84
    33f4:	49535f5f 	ldmdbmi	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    33f8:	54415f47 	strbpl	r5, [r1], #-3911	; 0xfffff0b9
    33fc:	43494d4f 	movtmi	r4, #40271	; 0x9d4f
    3400:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    3404:	2d205f5f 	stccs	15, cr5, [r0, #-380]!	; 0xfffffe84
    3408:	00293120 	eoreq	r3, r9, r0, lsr #2
    340c:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    3410:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	; 0x4e
    3414:	54534145 	ldrbpl	r4, [r3], #-325	; 0xfffffebb
    3418:	414d5f38 	cmpmi	sp, r8, lsr pc
    341c:	205f5f58 	subscs	r5, pc, r8, asr pc	; <UNPREDICTABLE>
    3420:	66667830 			; <UNDEFINED> instruction: 0x66667830
    3424:	53455200 	movtpl	r5, #20992	; 0x5200
    3428:	45565245 	ldrbmi	r5, [r6, #-581]	; 0xfffffdbb
    342c:	4c430044 	mcrrmi	0, 4, r0, r3, cr4
    3430:	5f524145 	svcpl	0x00524145
    3434:	28544942 	ldmdacs	r4, {r1, r6, r8, fp, lr}^
    3438:	2c474552 	cfstr64cs	mvdx4, [r7], {82}	; 0x52
    343c:	4e544942 	vnmlami.f16	s9, s8, s4	; <UNPREDICTABLE>
    3440:	2820294f 	stmdacs	r0!, {r0, r1, r2, r3, r6, r8, fp, sp}
    3444:	20474552 	subcs	r4, r7, r2, asr r5
    3448:	7e203d26 	cdpvc	13, 2, cr3, cr0, cr6, {1}
    344c:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    3450:	4e544942 	vnmlami.f16	s9, s8, s4	; <UNPREDICTABLE>
    3454:	0029294f 	eoreq	r2, r9, pc, asr #18
    3458:	5f434352 	svcpl	0x00434352
    345c:	31433249 	cmpcc	r3, r9, asr #4
    3460:	4b4c435f 	blmi	13141e4 <_Min_Stack_Size+0x1313de4>
    3464:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
    3468:	52282029 	eorpl	r2, r8, #41	; 0x29
    346c:	3e2d4343 	cdpcc	3, 2, cr4, cr13, cr3, {2}
    3470:	31425041 	cmpcc	r2, r1, asr #32
    3474:	20524e45 	subscs	r4, r2, r5, asr #28
    3478:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    347c:	323c3c31 	eorscc	r3, ip, #12544	; 0x3100
    3480:	00292931 	eoreq	r2, r9, r1, lsr r9
    3484:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    3488:	454c5f54 	strbmi	r5, [ip, #-3924]	; 0xfffff0ac
    348c:	31545341 	cmpcc	r4, r1, asr #6
    3490:	49575f36 	ldmdbmi	r7, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    3494:	5f485444 	svcpl	0x00485444
    3498:	3631205f 			; <UNDEFINED> instruction: 0x3631205f
    349c:	43435200 	movtmi	r5, #12800	; 0x3200
    34a0:	4153555f 	cmpmi	r3, pc, asr r5
    34a4:	5f315452 	svcpl	0x00315452
    34a8:	5f4b4c43 	svcpl	0x004b4c43
    34ac:	29284e45 	stmdbcs	r8!, {r0, r2, r6, r9, sl, fp, lr}
    34b0:	43522820 	cmpmi	r2, #32, 16	; 0x200000
    34b4:	413e2d43 	teqmi	lr, r3, asr #26
    34b8:	45324250 	ldrmi	r4, [r2, #-592]!	; 0xfffffdb0
    34bc:	7c20524e 	sfmvc	f5, 4, [r0], #-312	; 0xfffffec8
    34c0:	3128203d 			; <UNDEFINED> instruction: 0x3128203d
    34c4:	34313c3c 	ldrtcc	r3, [r1], #-3132	; 0xfffff3c4
    34c8:	5f002929 	svcpl	0x00002929
    34cc:	4345445f 	movtmi	r4, #21599	; 0x545f
    34d0:	4156455f 	cmpmi	r6, pc, asr r5
    34d4:	454d5f4c 	strbmi	r5, [sp, #-3916]	; 0xfffff0b4
    34d8:	444f4854 	strbmi	r4, [pc], #-2132	; 34e0 <_Min_Stack_Size+0x30e0>
    34dc:	32205f5f 	eorcc	r5, r0, #380	; 0x17c
    34e0:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    34e4:	72545f49 	subsvc	r5, r4, #292	; 0x124
    34e8:	65676769 	strbvs	r6, [r7, #-1897]!	; 0xfffff897
    34ec:	5f5f0072 	svcpl	0x005f0072
    34f0:	36434544 	strbcc	r4, [r3], -r4, asr #10
    34f4:	55535f34 	ldrbpl	r5, [r3, #-3892]	; 0xfffff0cc
    34f8:	524f4e42 	subpl	r4, pc, #1056	; 0x420
    34fc:	5f4c414d 	svcpl	0x004c414d
    3500:	5f4e494d 	svcpl	0x004e494d
    3504:	2e30205f 	mrccs	0, 1, r2, cr0, cr15, {2}
    3508:	30303030 	eorscc	r3, r0, r0, lsr r0
    350c:	30303030 	eorscc	r3, r0, r0, lsr r0
    3510:	30303030 	eorscc	r3, r0, r0, lsr r0
    3514:	45313030 	ldrmi	r3, [r1, #-48]!	; 0xffffffd0
    3518:	3338332d 	teqcc	r8, #-1275068416	; 0xb4000000
    351c:	5f004444 	svcpl	0x00004444
    3520:	4653555f 			; <UNDEFINED> instruction: 0x4653555f
    3524:	54434152 	strbpl	r4, [r3], #-338	; 0xfffffeae
    3528:	5350455f 	cmppl	r0, #398458880	; 0x17c00000
    352c:	4e4f4c49 	cdpmi	12, 4, cr4, cr15, cr9, {2}
    3530:	30205f5f 	eorcc	r5, r0, pc, asr pc
    3534:	2d503178 	ldfcse	f3, [r0, #-480]	; 0xfffffe20
    3538:	52485538 	subpl	r5, r8, #56, 10	; 0xe000000
    353c:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    3540:	41425f32 	cmpmi	r2, r2, lsr pc
    3544:	30204553 	eorcc	r4, r0, r3, asr r5
    3548:	30303478 	eorscc	r3, r0, r8, ror r4
    354c:	30383330 	eorscc	r3, r8, r0, lsr r3
    3550:	5f5f0030 	svcpl	0x005f0030
    3554:	544e4957 	strbpl	r4, [lr], #-2391	; 0xfffff6a9
    3558:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    355c:	30205f5f 	eorcc	r5, r0, pc, asr pc
    3560:	66666678 			; <UNDEFINED> instruction: 0x66666678
    3564:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    3568:	5f005566 	svcpl	0x00005566
    356c:	4653555f 			; <UNDEFINED> instruction: 0x4653555f
    3570:	54434152 	strbpl	r4, [r3], #-338	; 0xfffffeae
    3574:	4942465f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
    3578:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
    357c:	5f5f0038 	svcpl	0x005f0038
    3580:	43414c4c 	movtmi	r4, #7244	; 0x1c4c
    3584:	5f4d5543 	svcpl	0x004d5543
    3588:	5f58414d 	svcpl	0x0058414d
    358c:	5830205f 	ldmdapl	r0!, {r0, r1, r2, r3, r4, r6, sp}
    3590:	46464637 			; <UNDEFINED> instruction: 0x46464637
    3594:	46464646 	strbmi	r4, [r6], -r6, asr #12
    3598:	46464646 	strbmi	r4, [r6], -r6, asr #12
    359c:	46464646 	strbmi	r4, [r6], -r6, asr #12
    35a0:	31332d50 	teqcc	r3, r0, asr sp
    35a4:	004b4c4c 	subeq	r4, fp, ip, asr #24
    35a8:	52465f5f 	subpl	r5, r6, #380	; 0x17c
    35ac:	5f544341 	svcpl	0x00544341
    35b0:	54494246 	strbpl	r4, [r9], #-582	; 0xfffffdba
    35b4:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    35b8:	5f5f0035 	svcpl	0x005f0035
    35bc:	52455355 	subpl	r5, r5, #1409286145	; 0x54000001
    35c0:	42414c5f 	submi	r4, r1, #24320	; 0x5f00
    35c4:	505f4c45 	subspl	r4, pc, r5, asr #24
    35c8:	49464552 	stmdbmi	r6, {r1, r4, r6, r8, sl, lr}^
    35cc:	205f5f58 	subscs	r5, pc, r8, asr pc	; <UNPREDICTABLE>
    35d0:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 26d8 <_Min_Stack_Size+0x22d8>
    35d4:	36544e49 	ldrbcc	r4, [r4], -r9, asr #28
    35d8:	414d5f34 	cmpmi	sp, r4, lsr pc
    35dc:	205f5f58 	subscs	r5, pc, r8, asr pc	; <UNPREDICTABLE>
    35e0:	66667830 			; <UNDEFINED> instruction: 0x66667830
    35e4:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    35e8:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    35ec:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    35f0:	4c556666 	mrrcmi	6, 6, r6, r5, cr6
    35f4:	5f5f004c 	svcpl	0x005f004c
    35f8:	544e4955 	strbpl	r4, [lr], #-2389	; 0xfffff6ab
    35fc:	4d5f3233 	lfmmi	f3, 2, [pc, #-204]	; 3538 <_Min_Stack_Size+0x3138>
    3600:	5f5f5841 	svcpl	0x005f5841
    3604:	66783020 	ldrbtvs	r3, [r8], -r0, lsr #32
    3608:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    360c:	55666666 	strbpl	r6, [r6, #-1638]!	; 0xfffff99a
    3610:	5f5f004c 	svcpl	0x005f004c
    3614:	43445453 	movtmi	r5, #17491	; 0x4453
    3618:	5245565f 	subpl	r5, r5, #99614720	; 0x5f00000
    361c:	4e4f4953 			; <UNDEFINED> instruction: 0x4e4f4953
    3620:	32205f5f 	eorcc	r5, r0, #380	; 0x17c
    3624:	31313130 	teqcc	r1, r0, lsr r1
    3628:	5f004c32 	svcpl	0x00004c32
    362c:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
    3630:	41454c5f 	cmpmi	r5, pc, asr ip
    3634:	5f385453 	svcpl	0x00385453
    3638:	5f58414d 	svcpl	0x0058414d
    363c:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    3640:	5f006637 	svcpl	0x00006637
    3644:	4343475f 	movtmi	r4, #14175	; 0x375f
    3648:	4f54415f 	svcmi	0x0054415f
    364c:	5f43494d 	svcpl	0x0043494d
    3650:	4e494f50 	mcrmi	15, 2, r4, cr9, cr0, {2}
    3654:	5f524554 	svcpl	0x00524554
    3658:	4b434f4c 	blmi	10d7390 <_Min_Stack_Size+0x10d6f90>
    365c:	4552465f 	ldrbmi	r4, [r2, #-1631]	; 0xfffff9a1
    3660:	00322045 	eorseq	r2, r2, r5, asr #32
    3664:	52415f5f 	subpl	r5, r1, #380	; 0x17c
    3668:	45465f4d 	strbmi	r5, [r6, #-3917]	; 0xfffff0b3
    366c:	52555441 	subspl	r5, r5, #1090519040	; 0x41000000
    3670:	42515f45 	subsmi	r5, r1, #276	; 0x114
    3674:	31205449 			; <UNDEFINED> instruction: 0x31205449
    3678:	415f5f00 	cmpmi	pc, r0, lsl #30
    367c:	465f4d52 			; <UNDEFINED> instruction: 0x465f4d52
    3680:	55544145 	ldrbpl	r4, [r4, #-325]	; 0xfffffebb
    3684:	435f4552 	cmpmi	pc, #343932928	; 0x14800000
    3688:	31205a4c 			; <UNDEFINED> instruction: 0x31205a4c
    368c:	415f5f00 	cmpmi	pc, r0, lsl #30
    3690:	494d4f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, lr}^
    3694:	43415f43 	movtmi	r5, #8003	; 0x1f43
    3698:	52495551 	subpl	r5, r9, #339738624	; 0x14400000
    369c:	00322045 	eorseq	r2, r2, r5, asr #32
    36a0:	4349564e 	movtmi	r5, #38478	; 0x964e
    36a4:	5152495f 	cmppl	r2, pc, asr r9
    36a8:	4e455f37 	mcrmi	15, 2, r5, cr5, cr7, {1}
    36ac:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    36b0:	4349564e 	movtmi	r5, #38478	; 0x964e
    36b4:	4553495f 	ldrbmi	r4, [r3, #-2399]	; 0xfffff6a1
    36b8:	7c203052 	stcvc	0, cr3, [r0], #-328	; 0xfffffeb8
    36bc:	3128203d 			; <UNDEFINED> instruction: 0x3128203d
    36c0:	29373c3c 	ldmdbcs	r7!, {r2, r3, r4, r5, sl, fp, ip, sp}
    36c4:	5f5f0029 	svcpl	0x005f0029
    36c8:	5f4d5241 	svcpl	0x004d5241
    36cc:	455a4953 	ldrbmi	r4, [sl, #-2387]	; 0xfffff6ad
    36d0:	575f464f 	ldrbpl	r4, [pc, -pc, asr #12]
    36d4:	52414843 	subpl	r4, r1, #4390912	; 0x430000
    36d8:	3420545f 	strtcc	r5, [r0], #-1119	; 0xfffffba1
    36dc:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    36e0:	3233544c 	eorscc	r5, r3, #76, 8	; 0x4c000000
    36e4:	414d5f58 	cmpmi	sp, r8, asr pc
    36e8:	58455f58 	stmdapl	r5, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    36ec:	205f5f50 	subscs	r5, pc, r0, asr pc	; <UNPREDICTABLE>
    36f0:	34323031 	ldrtcc	r3, [r2], #-49	; 0xffffffcf
    36f4:	685f5f00 	ldmdavs	pc, {r8, r9, sl, fp, ip, lr}^	; <UNPREDICTABLE>
    36f8:	695f7361 	ldmdbvs	pc, {r0, r5, r6, r8, r9, ip, sp, lr}^	; <UNPREDICTABLE>
    36fc:	756c636e 	strbvc	r6, [ip, #-878]!	; 0xfffffc92
    3700:	53286564 			; <UNDEFINED> instruction: 0x53286564
    3704:	20295254 	eorcs	r5, r9, r4, asr r2
    3708:	61685f5f 	cmnvs	r8, pc, asr pc
    370c:	6e695f73 	mcrvs	15, 3, r5, cr9, cr3, {3}
    3710:	64756c63 	ldrbtvs	r6, [r5], #-3171	; 0xfffff39d
    3714:	285f5f65 	ldmdacs	pc, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^	; <UNPREDICTABLE>
    3718:	29525453 	ldmdbcs	r2, {r0, r1, r4, r6, sl, ip, lr}^
    371c:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 2824 <_Min_Stack_Size+0x2424>
    3720:	5f544e49 	svcpl	0x00544e49
    3724:	5341454c 	movtpl	r4, #5452	; 0x154c
    3728:	5f323354 	svcpl	0x00323354
    372c:	5f58414d 	svcpl	0x0058414d
    3730:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    3734:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    3738:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    373c:	5f004c55 	svcpl	0x00004c55
    3740:	4c42445f 	cfstrdmi	mvd4, [r2], {95}	; 0x5f
    3744:	5350455f 	cmppl	r0, #398458880	; 0x17c00000
    3748:	4e4f4c49 	cdpmi	12, 4, cr4, cr15, cr9, {2}
    374c:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    3750:	756f6428 	strbvc	r6, [pc, #-1064]!	; 3330 <_Min_Stack_Size+0x2f30>
    3754:	29656c62 	stmdbcs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    3758:	32322e32 	eorscc	r2, r2, #800	; 0x320
    375c:	36343430 			; <UNDEFINED> instruction: 0x36343430
    3760:	32393430 	eorscc	r3, r9, #48, 8	; 0x30000000
    3764:	31333035 	teqcc	r3, r5, lsr r0
    3768:	2d653133 	stfcse	f3, [r5, #-204]!	; 0xffffff34
    376c:	294c3631 	stmdbcs	ip, {r0, r4, r5, r9, sl, ip, sp}^
    3770:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	; <UNPREDICTABLE>
    3774:	43415246 	movtmi	r5, #4678	; 0x1246
    3778:	494d5f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    377c:	205f5f4e 	subscs	r5, pc, lr, asr #30
    3780:	2e302d28 	cdpcs	13, 3, cr2, cr0, cr8, {1}
    3784:	2d524c35 	ldclcs	12, cr4, [r2, #-212]	; 0xffffff2c
    3788:	4c352e30 	ldcmi	14, cr2, [r5], #-192	; 0xffffff40
    378c:	5f002952 	svcpl	0x00002952
    3790:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
    3794:	41454c5f 	cmpmi	r5, pc, asr ip
    3798:	34365453 	ldrtcc	r5, [r6], #-1107	; 0xfffffbad
    379c:	4449575f 	strbmi	r5, [r9], #-1887	; 0xfffff8a1
    37a0:	5f5f4854 	svcpl	0x005f4854
    37a4:	00343620 	eorseq	r3, r4, r0, lsr #12
    37a8:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    37ac:	41485f54 	cmpmi	r8, r4, asr pc
    37b0:	4e495f53 	mcrmi	15, 2, r5, cr9, cr3, {2}
    37b4:	494e4946 	stmdbmi	lr, {r1, r2, r6, r8, fp, lr}^
    37b8:	5f5f5954 	svcpl	0x005f5954
    37bc:	5f003120 	svcpl	0x00003120
    37c0:	4343415f 	movtmi	r4, #12639	; 0x315f
    37c4:	4d5f4d55 	ldclmi	13, cr4, [pc, #-340]	; 3678 <_Min_Stack_Size+0x3278>
    37c8:	5f5f5841 	svcpl	0x005f5841
    37cc:	37583020 	ldrbcc	r3, [r8, -r0, lsr #32]
    37d0:	46464646 	strbmi	r4, [r6], -r6, asr #12
    37d4:	50464646 	subpl	r4, r6, r6, asr #12
    37d8:	4b35312d 	blmi	d4fc94 <_Min_Stack_Size+0xd4f894>
    37dc:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	; <UNPREDICTABLE>
    37e0:	5f38544e 	svcpl	0x0038544e
    37e4:	5f58414d 	svcpl	0x0058414d
    37e8:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    37ec:	55006637 	strpl	r6, [r0, #-1591]	; 0xfffff9c9
    37f0:	54524153 	ldrbpl	r4, [r2], #-339	; 0xfffffead
    37f4:	28282033 	stmdacs	r8!, {r0, r1, r4, r5, sp}
    37f8:	52415355 	subpl	r5, r1, #1409286145	; 0x54000001
    37fc:	79545f54 	ldmdbvc	r4, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    3800:	65646570 	strbvs	r6, [r4, #-1392]!	; 0xfffffa90
    3804:	55292a66 	strpl	r2, [r9, #-2662]!	; 0xfffff59a
    3808:	54524153 	ldrbpl	r4, [r2], #-339	; 0xfffffead
    380c:	41425f33 	cmpmi	r2, r3, lsr pc
    3810:	00294553 	eoreq	r4, r9, r3, asr r5
    3814:	4c495455 	cfstrdmi	mvd5, [r9], {85}	; 0x55
    3818:	5f485f53 	svcpl	0x00485f53
    381c:	5f5f0020 	svcpl	0x005f0020
    3820:	495f4153 	ldmdbmi	pc, {r0, r1, r4, r6, r8, lr}^	; <UNPREDICTABLE>
    3824:	5f544942 	svcpl	0x00544942
    3828:	3631205f 			; <UNDEFINED> instruction: 0x3631205f
    382c:	475f5f00 	ldrbmi	r5, [pc, -r0, lsl #30]
    3830:	495f4343 	ldmdbmi	pc, {r0, r1, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    3834:	355f4345 	ldrbcc	r4, [pc, #-837]	; 34f7 <_Min_Stack_Size+0x30f7>
    3838:	435f3935 	cmpmi	pc, #868352	; 0xd4000
    383c:	4c504d4f 	mrrcmi	13, 4, r4, r0, cr15
    3840:	30205845 	eorcc	r5, r0, r5, asr #16
    3844:	475f5f00 	ldrbmi	r5, [pc, -r0, lsl #30]
    3848:	5f43554e 	svcpl	0x0043554e
    384c:	0037205f 	eorseq	r2, r7, pc, asr r0
    3850:	52415f5f 	subpl	r5, r1, #380	; 0x17c
    3854:	50465f4d 	subpl	r5, r6, sp, asr #30
    3858:	465f3631 			; <UNDEFINED> instruction: 0x465f3631
    385c:	414d524f 	cmpmi	sp, pc, asr #4
    3860:	45495f54 	strbmi	r5, [r9, #-3924]	; 0xfffff0ac
    3864:	5f004545 	svcpl	0x00004545
    3868:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    386c:	5f363154 	svcpl	0x00363154
    3870:	45505954 	ldrbmi	r5, [r0, #-2388]	; 0xfffff6ac
    3874:	73205f5f 			; <UNDEFINED> instruction: 0x73205f5f
    3878:	74726f68 	ldrbtvc	r6, [r2], #-3944	; 0xfffff098
    387c:	736e7520 	cmnvc	lr, #32, 10	; 0x8000000
    3880:	656e6769 	strbvs	r6, [lr, #-1897]!	; 0xfffff897
    3884:	6e692064 	cdpvs	0, 6, cr2, cr9, cr4, {3}
    3888:	5f5f0074 	svcpl	0x005f0074
    388c:	54464f53 	strbpl	r4, [r6], #-3923	; 0xfffff0ad
    3890:	5f5f5046 	svcpl	0x005f5046
    3894:	4e003120 	adfmisp	f3, f0, f0
    3898:	5f434956 	svcpl	0x00434956
    389c:	36515249 	ldrbcc	r5, [r1], -r9, asr #4
    38a0:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
    38a4:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    38a8:	5f434956 	svcpl	0x00434956
    38ac:	52455349 	subpl	r5, r5, #603979777	; 0x24000001
    38b0:	3d7c2030 	ldclcc	0, cr2, [ip, #-192]!	; 0xffffff40
    38b4:	3c312820 	ldccc	8, cr2, [r1], #-128	; 0xffffff80
    38b8:	2929363c 	stmdbcs	r9!, {r2, r3, r4, r5, r9, sl, ip, sp}
    38bc:	445f5f00 	ldrbmi	r5, [pc], #-3840	; 38c4 <_Min_Stack_Size+0x34c4>
    38c0:	32334345 	eorscc	r4, r3, #335544321	; 0x14000001
    38c4:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    38c8:	5058455f 	subspl	r4, r8, pc, asr r5
    38cc:	39205f5f 	stmdbcc	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    38d0:	5f5f0037 	svcpl	0x005f0037
    38d4:	5f544c46 	svcpl	0x00544c46
    38d8:	4c415645 	mcrrmi	6, 4, r5, r1, cr5
    38dc:	54454d5f 	strbpl	r4, [r5], #-3423	; 0xfffff2a1
    38e0:	5f444f48 	svcpl	0x00444f48
    38e4:	315f5354 	cmpcc	pc, r4, asr r3	; <UNPREDICTABLE>
    38e8:	31363638 	teqcc	r6, r8, lsr r6
    38ec:	5f5f335f 	svcpl	0x005f335f
    38f0:	5f003020 	svcpl	0x00003020
    38f4:	4843535f 	stmdami	r3, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
    38f8:	575f5241 	ldrbpl	r5, [pc, -r1, asr #4]
    38fc:	48544449 	ldmdami	r4, {r0, r3, r6, sl, lr}^
    3900:	38205f5f 	stmdacc	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    3904:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    3908:	28282031 	stmdacs	r8!, {r0, r4, r5, sp}
    390c:	5f495053 	svcpl	0x00495053
    3910:	65707954 	ldrbvs	r7, [r0, #-2388]!	; 0xfffff6ac
    3914:	2a666564 	bcs	199ceac <_Min_Stack_Size+0x199caac>
    3918:	49505329 	ldmdbmi	r0, {r0, r3, r5, r8, r9, ip, lr}^
    391c:	41425f31 	cmpmi	r2, r1, lsr pc
    3920:	00294553 	eoreq	r4, r9, r3, asr r5
    3924:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    3928:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    392c:	38545341 	ldmdacc	r4, {r0, r6, r8, r9, ip, lr}^
    3930:	5059545f 	subspl	r5, r9, pc, asr r4
    3934:	205f5f45 	subscs	r5, pc, r5, asr #30
    3938:	69736e75 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, sl, fp, sp, lr}^
    393c:	64656e67 	strbtvs	r6, [r5], #-3687	; 0xfffff199
