mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    3940:	746e6920 	strbtvc	r6, [lr], #-2336	; 0xfffff6e0
    3944:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	; <UNPREDICTABLE>
    3948:	4343414c 	movtmi	r4, #12620	; 0x314c
    394c:	495f4d55 	ldmdbmi	pc, {r0, r2, r4, r6, r8, sl, fp, lr}^	; <UNPREDICTABLE>
    3950:	5f544942 	svcpl	0x00544942
    3954:	3233205f 	eorscc	r2, r3, #95	; 0x5f
    3958:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    395c:	54434152 	strbpl	r4, [r3], #-338	; 0xfffffeae
    3960:	5350455f 	cmppl	r0, #398458880	; 0x17c00000
    3964:	4e4f4c49 	cdpmi	12, 4, cr4, cr15, cr9, {2}
    3968:	30205f5f 	eorcc	r5, r0, pc, asr pc
    396c:	2d503178 	ldfcse	f3, [r0, #-480]	; 0xfffffe20
    3970:	00523531 	subseq	r3, r2, r1, lsr r5
    3974:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    3978:	5f323354 	svcpl	0x00323354
    397c:	5f58414d 	svcpl	0x0058414d
    3980:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    3984:	66666637 			; <UNDEFINED> instruction: 0x66666637
    3988:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    398c:	5f5f004c 	svcpl	0x005f004c
    3990:	5f544e49 	svcpl	0x00544e49
    3994:	5341454c 	movtpl	r4, #5452	; 0x154c
    3998:	5f343654 	svcpl	0x00343654
    399c:	5f58414d 	svcpl	0x0058414d
    39a0:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    39a4:	66666637 			; <UNDEFINED> instruction: 0x66666637
    39a8:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    39ac:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    39b0:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    39b4:	2e004c4c 	cdpcs	12, 0, cr4, cr0, cr12, {2}
    39b8:	434d2f2e 	movtmi	r2, #57134	; 0xdf2e
    39bc:	452f4c41 	strmi	r4, [pc, #-3137]!	; 2d83 <_Min_Stack_Size+0x2983>
    39c0:	2e495458 	mcrcs	4, 2, r5, cr9, cr8, {2}
    39c4:	5f5f0063 	svcpl	0x005f0063
    39c8:	33544c46 	cmpcc	r4, #17920	; 0x4600
    39cc:	414d5f32 	cmpmi	sp, r2, lsr pc
    39d0:	445f544e 	ldrbmi	r5, [pc], #-1102	; 39d8 <_Min_Stack_Size+0x35d8>
    39d4:	5f5f4749 	svcpl	0x005f4749
    39d8:	00343220 	eorseq	r3, r4, r0, lsr #4
    39dc:	45565f5f 	ldrbmi	r5, [r6, #-3935]	; 0xfffff0a1
    39e0:	4f495352 	svcmi	0x00495352
    39e4:	205f5f4e 	subscs	r5, pc, lr, asr #30
    39e8:	332e3722 			; <UNDEFINED> instruction: 0x332e3722
    39ec:	3220312e 	eorcc	r3, r0, #-2147483637	; 0x8000000b
    39f0:	30383130 	eorscc	r3, r8, r0, lsr r1
    39f4:	20323236 	eorscs	r3, r2, r6, lsr r2
    39f8:	6c657228 	sfmvs	f7, 2, [r5], #-160	; 0xffffff60
    39fc:	65736165 	ldrbvs	r6, [r3, #-357]!	; 0xfffffe9b
    3a00:	415b2029 	cmpmi	fp, r9, lsr #32
    3a04:	652f4d52 	strvs	r4, [pc, #-3410]!	; 2cba <_Min_Stack_Size+0x28ba>
    3a08:	6465626d 	strbtvs	r6, [r5], #-621	; 0xfffffd93
    3a0c:	2d646564 	cfstr64cs	mvdx6, [r4, #-400]!	; 0xfffffe70
    3a10:	72622d37 	rsbvc	r2, r2, #3520	; 0xdc0
    3a14:	68636e61 	stmdavs	r3!, {r0, r5, r6, r9, sl, fp, sp, lr}^
    3a18:	76657220 	strbtvc	r7, [r5], -r0, lsr #4
    3a1c:	6f697369 	svcvs	0x00697369
    3a20:	3632206e 	ldrtcc	r2, [r2], -lr, rrx
    3a24:	37303931 			; <UNDEFINED> instruction: 0x37303931
    3a28:	5f00225d 	svcpl	0x0000225d
    3a2c:	544c465f 	strbpl	r4, [ip], #-1631	; 0xfffff9a1
    3a30:	445f3233 	ldrbmi	r3, [pc], #-563	; 3a38 <_Min_Stack_Size+0x3638>
    3a34:	524f4e45 	subpl	r4, pc, #1104	; 0x450
    3a38:	494d5f4d 	stmdbmi	sp, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    3a3c:	205f5f4e 	subscs	r5, pc, lr, asr #30
    3a40:	30342e31 	eorscc	r2, r4, r1, lsr lr
    3a44:	38393231 	ldmdacc	r9!, {r0, r4, r5, r9, ip, sp}
    3a48:	33343634 	teqcc	r4, #52, 12	; 0x3400000
    3a4c:	31383432 	teqcc	r8, r2, lsr r4
    3a50:	2d653137 	stfcse	f3, [r5, #-220]!	; 0xffffff24
    3a54:	33463534 	movtcc	r3, #25908	; 0x6534
    3a58:	5f5f0032 	svcpl	0x005f0032
    3a5c:	544e4955 	strbpl	r4, [lr], #-2389	; 0xfffff6ab
    3a60:	435f3436 	cmpmi	pc, #905969664	; 0x36000000
    3a64:	20296328 	eorcs	r6, r9, r8, lsr #6
    3a68:	23232063 			; <UNDEFINED> instruction: 0x23232063
    3a6c:	4c4c5520 	cfstr64mi	mvdx5, [ip], {32}
    3a70:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 2b78 <_Min_Stack_Size+0x2778>
    3a74:	5f544e49 	svcpl	0x00544e49
    3a78:	5341454c 	movtpl	r4, #5452	; 0x154c
    3a7c:	5f343654 	svcpl	0x00343654
    3a80:	45505954 	ldrbmi	r5, [r0, #-2388]	; 0xfffff6ac
    3a84:	6c205f5f 	stcvs	15, cr5, [r0], #-380	; 0xfffffe84
    3a88:	20676e6f 	rsbcs	r6, r7, pc, ror #28
    3a8c:	676e6f6c 	strbvs	r6, [lr, -ip, ror #30]!
    3a90:	736e7520 	cmnvc	lr, #32, 10	; 0x8000000
    3a94:	656e6769 	strbvs	r6, [lr, #-1897]!	; 0xfffff897
    3a98:	6e692064 	cdpvs	0, 6, cr2, cr9, cr4, {3}
    3a9c:	564e0074 			; <UNDEFINED> instruction: 0x564e0074
    3aa0:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    3aa4:	32335152 	eorscc	r5, r3, #-2147483628	; 0x80000014
    3aa8:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
    3aac:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    3ab0:	5f434956 	svcpl	0x00434956
    3ab4:	52455349 	subpl	r5, r5, #603979777	; 0x24000001
    3ab8:	3d7c2031 	ldclcc	0, cr2, [ip, #-196]!	; 0xffffff3c
    3abc:	3c312820 	ldccc	8, cr2, [r1], #-128	; 0xffffff80
    3ac0:	2929303c 	stmdbcs	r9!, {r2, r3, r4, r5, ip, sp}
    3ac4:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	; <UNPREDICTABLE>
    3ac8:	5f4c4244 	svcpl	0x004c4244
    3acc:	49535045 	ldmdbmi	r3, {r0, r2, r6, ip, lr}^
    3ad0:	5f4e4f4c 	svcpl	0x004e4f4c
    3ad4:	2e32205f 	mrccs	0, 1, r2, cr2, cr15, {2}
    3ad8:	34303232 	ldrtcc	r3, [r0], #-562	; 0xfffffdce
    3adc:	34303634 	ldrtcc	r3, [r0], #-1588	; 0xfffff9cc
    3ae0:	30353239 	eorscc	r3, r5, r9, lsr r2
    3ae4:	31333133 	teqcc	r3, r3, lsr r1
    3ae8:	36312d65 	ldrtcc	r2, [r1], -r5, ror #26
    3aec:	5047004c 	subpl	r0, r7, ip, asr #32
    3af0:	505f4f49 	subspl	r4, pc, r9, asr #30
    3af4:	6f4e6e69 	svcvs	0x004e6e69
    3af8:	475f5f00 	ldrbmi	r5, [pc, -r0, lsl #30]
    3afc:	415f4343 	cmpmi	pc, r3, asr #6
    3b00:	494d4f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, lr}^
    3b04:	48435f43 	stmdami	r3, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    3b08:	36315241 	ldrtcc	r5, [r1], -r1, asr #4
    3b0c:	4c5f545f 	cfldrdmi	mvd5, [pc], {95}	; 0x5f
    3b10:	5f4b434f 	svcpl	0x004b434f
    3b14:	45455246 	strbmi	r5, [r5, #-582]	; 0xfffffdba
    3b18:	4c003220 	sfmmi	f3, 4, [r0], {32}
    3b1c:	00524b43 	subseq	r4, r2, r3, asr #22
    3b20:	42445f5f 	submi	r5, r4, #380	; 0x17c
    3b24:	414d5f4c 	cmpmi	sp, ip, asr #30
    3b28:	58455f58 	stmdapl	r5, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    3b2c:	205f5f50 	subscs	r5, pc, r0, asr pc	; <UNPREDICTABLE>
    3b30:	34323031 	ldrtcc	r3, [r2], #-49	; 0xffffffcf
    3b34:	415f5f00 	cmpmi	pc, r0, lsl #30
    3b38:	494d4f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, lr}^
    3b3c:	45525f43 	ldrbmi	r5, [r2, #-3907]	; 0xfffff0bd
    3b40:	5341454c 	movtpl	r4, #5452	; 0x154c
    3b44:	00332045 	eorseq	r2, r3, r5, asr #32
    3b48:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    3b4c:	58323354 	ldmdapl	r2!, {r2, r4, r6, r8, r9, ip, sp}
    3b50:	5341485f 	movtpl	r4, #6239	; 0x185f
    3b54:	4e45445f 	mcrmi	4, 2, r4, cr5, cr15, {2}
    3b58:	5f4d524f 	svcpl	0x004d524f
    3b5c:	0031205f 	eorseq	r2, r1, pc, asr r0
    3b60:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    3b64:	414d5f54 	cmpmi	sp, r4, asr pc
    3b68:	445f544e 	ldrbmi	r5, [pc], #-1102	; 3b70 <_Min_Stack_Size+0x3770>
    3b6c:	5f5f4749 	svcpl	0x005f4749
    3b70:	00343220 	eorseq	r3, r4, r0, lsr #4
    3b74:	44555f5f 	ldrbmi	r5, [r5], #-3935	; 0xfffff0a1
    3b78:	42495f51 	submi	r5, r9, #324	; 0x144
    3b7c:	5f5f5449 	svcpl	0x005f5449
    3b80:	5f003020 	svcpl	0x00003020
    3b84:	4341555f 	movtmi	r5, #5471	; 0x155f
    3b88:	5f4d5543 	svcpl	0x004d5543
    3b8c:	5f58414d 	svcpl	0x0058414d
    3b90:	5830205f 	ldmdapl	r0!, {r0, r1, r2, r3, r4, r6, sp}
    3b94:	46464646 	strbmi	r4, [r6], -r6, asr #12
    3b98:	46464646 	strbmi	r4, [r6], -r6, asr #12
    3b9c:	36312d50 			; <UNDEFINED> instruction: 0x36312d50
    3ba0:	45004b55 	strmi	r4, [r0, #-2901]	; 0xfffff4ab
    3ba4:	50495458 	subpl	r5, r9, r8, asr r4
    3ba8:	20333141 	eorscs	r3, r3, r1, asr #2
    3bac:	54584528 	ldrbpl	r4, [r8], #-1320	; 0xfffffad8
    3bb0:	50475f49 	subpl	r5, r7, r9, asr #30
    3bb4:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 3a98 <_Min_Stack_Size+0x3698>
    3bb8:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
    3bbc:	745f676e 	ldrbvc	r6, [pc], #-1902	; 3bc4 <_Min_Stack_Size+0x37c4>
    3bc0:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
    3bc4:	315f4954 	cmpcc	pc, r4, asr r9	; <UNPREDICTABLE>
    3bc8:	47282c33 			; <UNDEFINED> instruction: 0x47282c33
    3bcc:	5f4f4950 	svcpl	0x004f4950
    3bd0:	436e6950 	cmnmi	lr, #80, 18	; 0x140000
    3bd4:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    3bd8:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    3bdc:	4950477b 	ldmdbmi	r0, {r0, r1, r3, r4, r5, r6, r8, r9, sl, lr}^
    3be0:	472c414f 	strmi	r4, [ip, -pc, asr #2]!
    3be4:	5f4f4950 	svcpl	0x004f4950
    3be8:	5f4e4950 	svcpl	0x004e4950
    3bec:	472c3331 			; <UNDEFINED> instruction: 0x472c3331
    3bf0:	5f4f4950 	svcpl	0x004f4950
    3bf4:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    3bf8:	5f46415f 	svcpl	0x0046415f
    3bfc:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    3c00:	50472c54 	subpl	r2, r7, r4, asr ip
    3c04:	4f5f4f49 	svcmi	0x005f4f49
    3c08:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    3c0c:	50535f54 	subspl	r5, r3, r4, asr pc
    3c10:	5f444545 	svcpl	0x00444545
    3c14:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
    3c18:	5f007d7d 	svcpl	0x00007d7d
    3c1c:	42444c5f 	submi	r4, r4, #24320	; 0x5f00
    3c20:	45445f4c 	strbmi	r5, [r4, #-3916]	; 0xfffff0b4
    3c24:	4d524f4e 	ldclmi	15, cr4, [r2, #-312]	; 0xfffffec8
    3c28:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    3c2c:	34205f5f 	strtcc	r5, [r0], #-3935	; 0xfffff0a1
    3c30:	3034392e 	eorscc	r3, r4, lr, lsr #18
    3c34:	34363536 	ldrtcc	r3, [r6], #-1334	; 0xfffffaca
    3c38:	31343835 	teqcc	r4, r5, lsr r8
    3c3c:	35363432 	ldrcc	r3, [r6, #-1074]!	; 0xfffffbce
    3c40:	332d6534 			; <UNDEFINED> instruction: 0x332d6534
    3c44:	004c3432 	subeq	r3, ip, r2, lsr r4
    3c48:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    3c4c:	5f343654 	svcpl	0x00343654
    3c50:	5f58414d 	svcpl	0x0058414d
    3c54:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    3c58:	66666637 			; <UNDEFINED> instruction: 0x66666637
    3c5c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    3c60:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    3c64:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    3c68:	5f004c4c 	svcpl	0x00004c4c
    3c6c:	4d52415f 	ldfmie	f4, [r2, #-380]	; 0xfffffe84
    3c70:	4145465f 	cmpmi	r5, pc, asr r6
    3c74:	45525554 	ldrbmi	r5, [r2, #-1364]	; 0xfffffaac
    3c78:	5441535f 	strbpl	r5, [r1], #-863	; 0xfffffca1
    3c7c:	45003120 	strmi	r3, [r0, #-288]	; 0xfffffee0
    3c80:	5f495458 	svcpl	0x00495458
    3c84:	47495254 	smlsldmi	r5, r9, r4, r2
    3c88:	5f524547 	svcpl	0x00524547
    3c8c:	4c4c4146 	stfmie	f4, [ip], {70}	; 0x46
    3c90:	20474e49 	subcs	r4, r7, r9, asr #28
    3c94:	5f5f0031 	svcpl	0x005f0031
    3c98:	464c4c55 			; <UNDEFINED> instruction: 0x464c4c55
    3c9c:	54434152 	strbpl	r4, [r3], #-338	; 0xfffffeae
    3ca0:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    3ca4:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
    3ca8:	58450030 	stmdapl	r5, {r4, r5}^
    3cac:	43504954 	cmpmi	r0, #84, 18	; 0x150000
    3cb0:	28203431 	stmdacs	r0!, {r0, r4, r5, sl, ip, sp}
    3cb4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    3cb8:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    3cbc:	614d5f4f 	cmpvs	sp, pc, asr #30
    3cc0:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    3cc4:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    3cc8:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    3ccc:	34315f49 	ldrtcc	r5, [r1], #-3913	; 0xfffff0b7
    3cd0:	5047282c 	subpl	r2, r7, ip, lsr #16
    3cd4:	505f4f49 	subspl	r4, pc, r9, asr #30
    3cd8:	6f436e69 	svcvs	0x00436e69
    3cdc:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    3ce0:	7b29745f 	blvc	a60e64 <_Min_Stack_Size+0xa60a64>
    3ce4:	4f495047 	svcmi	0x00495047
    3ce8:	50472c43 	subpl	r2, r7, r3, asr #24
    3cec:	505f4f49 	subspl	r4, pc, r9, asr #30
    3cf0:	315f4e49 	cmpcc	pc, r9, asr #28
    3cf4:	50472c34 	subpl	r2, r7, r4, lsr ip
    3cf8:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 3bdc <_Min_Stack_Size+0x37dc>
    3cfc:	5f45444f 	svcpl	0x0045444f
    3d00:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    3d04:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    3d08:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    3d0c:	554f5f4f 	strbpl	r5, [pc, #-3919]	; 2dc5 <_Min_Stack_Size+0x29c5>
    3d10:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    3d14:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    3d18:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    3d1c:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    3d20:	564e007d 			; <UNDEFINED> instruction: 0x564e007d
    3d24:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    3d28:	32525053 	subscc	r5, r2, #83	; 0x53
    3d2c:	76282a20 	strtvc	r2, [r8], -r0, lsr #20
    3d30:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    3d34:	745f3233 	ldrbvc	r3, [pc], #-563	; 3d3c <_Min_Stack_Size+0x393c>
    3d38:	4e28292a 	vmulmi.f16	s4, s16, s21	; <UNPREDICTABLE>
    3d3c:	5f434956 	svcpl	0x00434956
    3d40:	45534142 	ldrbmi	r4, [r3, #-322]	; 0xfffffebe
    3d44:	3178302b 	cmncc	r8, fp, lsr #32
    3d48:	00293830 	eoreq	r3, r9, r0, lsr r8
    3d4c:	4349564e 	movtmi	r5, #38478	; 0x964e
    3d50:	5152495f 	cmppl	r2, pc, asr r9
    3d54:	455f3033 	ldrbmi	r3, [pc, #-51]	; 3d29 <_Min_Stack_Size+0x3929>
    3d58:	2029284e 	eorcs	r2, r9, lr, asr #16
    3d5c:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    3d60:	53495f43 	movtpl	r5, #40771	; 0x9f43
    3d64:	20305245 	eorscs	r5, r0, r5, asr #4
    3d68:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    3d6c:	333c3c31 	teqcc	ip, #12544	; 0x3100
    3d70:	00292930 	eoreq	r2, r9, r0, lsr r9
    3d74:	4f4c5f5f 	svcmi	0x004c5f5f
    3d78:	575f474e 	ldrbpl	r4, [pc, -lr, asr #14]
    3d7c:	48544449 	ldmdami	r4, {r0, r3, r6, sl, lr}^
    3d80:	33205f5f 			; <UNDEFINED> instruction: 0x33205f5f
    3d84:	58450032 	stmdapl	r5, {r1, r4, r5}^
    3d88:	45504954 	ldrbmi	r4, [r0, #-2388]	; 0xfffff6ac
    3d8c:	28203531 	stmdacs	r0!, {r0, r4, r5, r8, sl, ip, sp}
    3d90:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    3d94:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    3d98:	614d5f4f 	cmpvs	sp, pc, asr #30
    3d9c:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    3da0:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    3da4:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    3da8:	35315f49 	ldrcc	r5, [r1, #-3913]!	; 0xfffff0b7
    3dac:	5047282c 	subpl	r2, r7, ip, lsr #16
    3db0:	505f4f49 	subspl	r4, pc, r9, asr #30
    3db4:	6f436e69 	svcvs	0x00436e69
    3db8:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    3dbc:	7b29745f 	blvc	a60f40 <_Min_Stack_Size+0xa60b40>
    3dc0:	4f495047 	svcmi	0x00495047
    3dc4:	50472c45 	subpl	r2, r7, r5, asr #24
    3dc8:	505f4f49 	subspl	r4, pc, r9, asr #30
    3dcc:	315f4e49 	cmpcc	pc, r9, asr #28
    3dd0:	50472c35 	subpl	r2, r7, r5, lsr ip
    3dd4:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 3cb8 <_Min_Stack_Size+0x38b8>
    3dd8:	5f45444f 	svcpl	0x0045444f
    3ddc:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    3de0:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    3de4:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    3de8:	554f5f4f 	strbpl	r5, [pc, #-3919]	; 2ea1 <_Min_Stack_Size+0x2aa1>
    3dec:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    3df0:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    3df4:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    3df8:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    3dfc:	5645007d 			; <UNDEFINED> instruction: 0x5645007d
    3e00:	5f005243 	svcpl	0x00005243
    3e04:	4341555f 	movtmi	r5, #5471	; 0x155f
    3e08:	5f4d5543 	svcpl	0x004d5543
    3e0c:	54494246 	strbpl	r4, [r9], #-582	; 0xfffffdba
    3e10:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    3e14:	50470036 	subpl	r0, r7, r6, lsr r0
    3e18:	505f4f49 	subspl	r4, pc, r9, asr #30
    3e1c:	315f4e49 	cmpcc	pc, r9, asr #28
    3e20:	28282033 	stmdacs	r8!, {r0, r1, r4, r5, sp}
    3e24:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    3e28:	745f3631 	ldrbvc	r3, [pc], #-1585	; 3e30 <_Min_Stack_Size+0x3a30>
    3e2c:	32783029 	rsbscc	r3, r8, #41	; 0x29
    3e30:	29303030 	ldmdbcs	r0!, {r4, r5, ip, sp}
    3e34:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 2f3c <_Min_Stack_Size+0x2b3c>
    3e38:	43415246 	movtmi	r5, #4678	; 0x1246
    3e3c:	50455f54 	subpl	r5, r5, r4, asr pc
    3e40:	4f4c4953 	svcmi	0x004c4953
    3e44:	205f5f4e 	subscs	r5, pc, lr, asr #30
    3e48:	50317830 	eorspl	r7, r1, r0, lsr r8
    3e4c:	5536312d 	ldrpl	r3, [r6, #-301]!	; 0xfffffed3
    3e50:	5f5f0052 	svcpl	0x005f0052
    3e54:	41484357 	cmpmi	r8, r7, asr r3
    3e58:	494d5f52 	stmdbmi	sp, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    3e5c:	205f5f4e 	subscs	r5, pc, lr, asr #30
    3e60:	5f005530 	svcpl	0x00005530
    3e64:	5151555f 	cmppl	r1, pc, asr r5
    3e68:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    3e6c:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
    3e70:	5f5f0030 	svcpl	0x005f0030
    3e74:	5f434347 	svcpl	0x00434347
    3e78:	4d4f5441 	cfstrdmi	mvd5, [pc, #-260]	; 3d7c <_Min_Stack_Size+0x397c>
    3e7c:	4c5f4349 	mrrcmi	3, 4, r4, pc, cr9	; <UNPREDICTABLE>
    3e80:	5f474e4f 	svcpl	0x00474e4f
    3e84:	4b434f4c 	blmi	10d7bbc <_Min_Stack_Size+0x10d77bc>
    3e88:	4552465f 	ldrbmi	r4, [r2, #-1631]	; 0xfffff9a1
    3e8c:	00322045 	eorseq	r2, r2, r5, asr #32
    3e90:	4c555f5f 	mrrcmi	15, 5, r5, r5, cr15	; <UNPREDICTABLE>
    3e94:	55434341 	strbpl	r4, [r3, #-833]	; 0xfffffcbf
    3e98:	494d5f4d 	stmdbmi	sp, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    3e9c:	205f5f4e 	subscs	r5, pc, lr, asr #30
    3ea0:	55302e30 	ldrpl	r2, [r0, #-3632]!	; 0xfffff1d0
    3ea4:	5f004b4c 	svcpl	0x00004b4c
    3ea8:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
    3eac:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    3eb0:	30205f5f 	eorcc	r5, r0, pc, asr pc
    3eb4:	66663778 			; <UNDEFINED> instruction: 0x66663778
    3eb8:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    3ebc:	5f5f0066 	svcpl	0x005f0066
    3ec0:	5f4d5241 	svcpl	0x004d5241
    3ec4:	48435241 	stmdami	r3, {r0, r6, r9, ip, lr}^
    3ec8:	4e003720 	cdpmi	7, 0, cr3, cr0, cr0, {1}
    3ecc:	5f434956 	svcpl	0x00434956
    3ed0:	33515249 	cmpcc	r1, #-1879048188	; 0x90000004
    3ed4:	4e455f31 	mcrmi	15, 2, r5, cr5, cr1, {1}
    3ed8:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    3edc:	4349564e 	movtmi	r5, #38478	; 0x964e
    3ee0:	4553495f 	ldrbmi	r4, [r3, #-2399]	; 0xfffff6a1
    3ee4:	7c203052 	stcvc	0, cr3, [r0], #-328	; 0xfffffeb8
    3ee8:	3128203d 			; <UNDEFINED> instruction: 0x3128203d
    3eec:	31333c3c 	teqcc	r3, ip, lsr ip
    3ef0:	5f002929 	svcpl	0x00002929
    3ef4:	544c465f 	strbpl	r4, [ip], #-1631	; 0xfffff9a1
    3ef8:	4441525f 	strbmi	r5, [r1], #-607	; 0xfffffda1
    3efc:	5f5f5849 	svcpl	0x005f5849
    3f00:	45003220 	strmi	r3, [r0, #-544]	; 0xfffffde0
    3f04:	50495458 	subpl	r5, r9, r8, asr r4
    3f08:	20353142 	eorscs	r3, r5, r2, asr #2
    3f0c:	54584528 	ldrbpl	r4, [r8], #-1320	; 0xfffffad8
    3f10:	50475f49 	subpl	r5, r7, r9, asr #30
    3f14:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 3df8 <_Min_Stack_Size+0x39f8>
    3f18:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
    3f1c:	745f676e 	ldrbvc	r6, [pc], #-1902	; 3f24 <_Min_Stack_Size+0x3b24>
    3f20:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
    3f24:	315f4954 	cmpcc	pc, r4, asr r9	; <UNPREDICTABLE>
    3f28:	47282c35 			; <UNDEFINED> instruction: 0x47282c35
    3f2c:	5f4f4950 	svcpl	0x004f4950
    3f30:	436e6950 	cmnmi	lr, #80, 18	; 0x140000
    3f34:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    3f38:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    3f3c:	4950477b 	ldmdbmi	r0, {r0, r1, r3, r4, r5, r6, r8, r9, sl, lr}^
    3f40:	472c424f 	strmi	r4, [ip, -pc, asr #4]!
    3f44:	5f4f4950 	svcpl	0x004f4950
    3f48:	5f4e4950 	svcpl	0x004e4950
    3f4c:	472c3531 			; <UNDEFINED> instruction: 0x472c3531
    3f50:	5f4f4950 	svcpl	0x004f4950
    3f54:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    3f58:	5f46415f 	svcpl	0x0046415f
    3f5c:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    3f60:	50472c54 	subpl	r2, r7, r4, asr ip
    3f64:	4f5f4f49 	svcmi	0x005f4f49
    3f68:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    3f6c:	50535f54 	subspl	r5, r3, r4, asr pc
    3f70:	5f444545 	svcpl	0x00444545
    3f74:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
    3f78:	5f007d7d 	svcpl	0x00007d7d
    3f7c:	42444c5f 	submi	r4, r4, #24320	; 0x5f00
    3f80:	41485f4c 	cmpmi	r8, ip, asr #30
    3f84:	55515f53 	ldrbpl	r5, [r1, #-3923]	; 0xfffff0ad
    3f88:	5f544549 	svcpl	0x00544549
    3f8c:	5f4e414e 	svcpl	0x004e414e
    3f90:	0031205f 	eorseq	r2, r1, pc, asr r0
    3f94:	4f4c5f5f 	svcmi	0x004c5f5f
    3f98:	4c5f474e 	mrrcmi	7, 4, r4, pc, cr14	; <UNPREDICTABLE>
    3f9c:	5f474e4f 	svcpl	0x00474e4f
    3fa0:	54444957 	strbpl	r4, [r4], #-2391	; 0xfffff6a9
    3fa4:	205f5f48 	subscs	r5, pc, r8, asr #30
    3fa8:	4e003436 	cfmvdhrmi	mvd0, r3
    3fac:	5f434956 	svcpl	0x00434956
    3fb0:	52424149 	subpl	r4, r2, #1073741842	; 0x40000012
    3fb4:	282a2032 	stmdacs	sl!, {r1, r4, r5, sp}
    3fb8:	6e697576 	mcrvs	5, 3, r7, cr9, cr6, {3}
    3fbc:	5f323374 	svcpl	0x00323374
    3fc0:	28292a74 	stmdacs	r9!, {r2, r4, r5, r6, r9, fp, sp}
    3fc4:	4349564e 	movtmi	r5, #38478	; 0x964e
    3fc8:	5341425f 	movtpl	r4, #4703	; 0x125f
    3fcc:	78302b45 	ldmdavc	r0!, {r0, r2, r6, r8, r9, fp, sp}
    3fd0:	29383032 	ldmdbcs	r8!, {r1, r4, r5, ip, sp}
    3fd4:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    3fd8:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    3fdc:	30315f4e 	eorscc	r5, r1, lr, asr #30
    3fe0:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    3fe4:	31746e69 	cmncc	r4, r9, ror #28
    3fe8:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    3fec:	34307830 	ldrtcc	r7, [r0], #-2096	; 0xfffff7d0
    3ff0:	00293030 	eoreq	r3, r9, r0, lsr r0
    3ff4:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    3ff8:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    3ffc:	36545341 	ldrbcc	r5, [r4], -r1, asr #6
    4000:	414d5f34 	cmpmi	sp, r4, lsr pc
    4004:	205f5f58 	subscs	r5, pc, r8, asr pc	; <UNPREDICTABLE>
    4008:	66667830 			; <UNDEFINED> instruction: 0x66667830
    400c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    4010:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    4014:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    4018:	4c556666 	mrrcmi	6, 6, r6, r5, cr6
    401c:	5845004c 	stmdapl	r5, {r2, r3, r6}^
    4020:	45504954 	ldrbmi	r4, [r0, #-2388]	; 0xfffff6ac
    4024:	28203031 	stmdacs	r0!, {r0, r4, r5, ip, sp}
    4028:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    402c:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    4030:	614d5f4f 	cmpvs	sp, pc, asr #30
    4034:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    4038:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    403c:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    4040:	30315f49 	eorscc	r5, r1, r9, asr #30
    4044:	5047282c 	subpl	r2, r7, ip, lsr #16
    4048:	505f4f49 	subspl	r4, pc, r9, asr #30
    404c:	6f436e69 	svcvs	0x00436e69
    4050:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    4054:	7b29745f 	blvc	a611d8 <_Min_Stack_Size+0xa60dd8>
    4058:	4f495047 	svcmi	0x00495047
    405c:	50472c45 	subpl	r2, r7, r5, asr #24
    4060:	505f4f49 	subspl	r4, pc, r9, asr #30
    4064:	315f4e49 	cmpcc	pc, r9, asr #28
    4068:	50472c30 	subpl	r2, r7, r0, lsr ip
