mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    406c:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 3f50 <_Min_Stack_Size+0x3b50>
    4070:	5f45444f 	svcpl	0x0045444f
    4074:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    4078:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    407c:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    4080:	554f5f4f 	strbpl	r5, [pc, #-3919]	; 3139 <_Min_Stack_Size+0x2d39>
    4084:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    4088:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    408c:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    4090:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    4094:	5f5f007d 	svcpl	0x005f007d
    4098:	5f4d5241 	svcpl	0x004d5241
    409c:	5f005046 	svcpl	0x00005046
    40a0:	5f41485f 	svcpl	0x0041485f
    40a4:	54494249 	strbpl	r4, [r9], #-585	; 0xfffffdb7
    40a8:	38205f5f 	stmdacc	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    40ac:	415f5f00 	cmpmi	pc, r0, lsl #30
    40b0:	465f4d52 			; <UNDEFINED> instruction: 0x465f4d52
    40b4:	55544145 	ldrbpl	r4, [r4, #-325]	; 0xfffffebb
    40b8:	445f4552 	ldrbmi	r4, [pc], #-1362	; 40c0 <_Min_Stack_Size+0x3cc0>
    40bc:	5f005053 	svcpl	0x00005053
    40c0:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
    40c4:	5f525450 	svcpl	0x00525450
    40c8:	54444957 	strbpl	r4, [r4], #-2391	; 0xfffff6a9
    40cc:	205f5f48 	subscs	r5, pc, r8, asr #30
    40d0:	45003233 	strmi	r3, [r0, #-563]	; 0xfffffdcd
    40d4:	50495458 	subpl	r5, r9, r8, asr r4
    40d8:	28203942 	stmdacs	r0!, {r1, r6, r8, fp, ip, sp}
    40dc:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    40e0:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    40e4:	614d5f4f 	cmpvs	sp, pc, asr #30
    40e8:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    40ec:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    40f0:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    40f4:	2c395f49 	ldccs	15, cr5, [r9], #-292	; 0xfffffedc
    40f8:	50472820 	subpl	r2, r7, r0, lsr #16
    40fc:	505f4f49 	subspl	r4, pc, r9, asr #30
    4100:	6f436e69 	svcvs	0x00436e69
    4104:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    4108:	7b29745f 	blvc	a6128c <_Min_Stack_Size+0xa60e8c>
    410c:	4f495047 	svcmi	0x00495047
    4110:	50472c42 	subpl	r2, r7, r2, asr #24
    4114:	505f4f49 	subspl	r4, pc, r9, asr #30
    4118:	395f4e49 	ldmdbcc	pc, {r0, r3, r6, r9, sl, fp, lr}^	; <UNPREDICTABLE>
    411c:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    4120:	4f4d5f4f 	svcmi	0x004d5f4f
    4124:	415f4544 	cmpmi	pc, r4, asr #10
    4128:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    412c:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    4130:	4f495047 	svcmi	0x00495047
    4134:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    4138:	5f545550 	svcpl	0x00545550
    413c:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    4140:	4f4e5f44 	svcmi	0x004e5f44
    4144:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    4148:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    414c:	3233544c 	eorscc	r5, r3, #76, 8	; 0x4c000000
    4150:	494d5f58 	stmdbmi	sp, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    4154:	205f5f4e 	subscs	r5, pc, lr, asr #30
    4158:	32322e32 	eorscc	r2, r2, #800	; 0x320
    415c:	33373035 	teqcc	r7, #53	; 0x35
    4160:	35383538 	ldrcc	r3, [r8, #-1336]!	; 0xfffffac8
    4164:	30323730 	eorscc	r3, r2, r0, lsr r7
    4168:	2d653431 	cfstrdcs	mvd3, [r5, #-196]!	; 0xffffff3c
    416c:	46383033 			; <UNDEFINED> instruction: 0x46383033
    4170:	00783233 	rsbseq	r3, r8, r3, lsr r2
    4174:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    4178:	5f343654 	svcpl	0x00343654
    417c:	5f58414d 	svcpl	0x0058414d
    4180:	5f505845 	svcpl	0x00505845
    4184:	3031205f 	eorscc	r2, r1, pc, asr r0
    4188:	64003432 	strvs	r3, [r0], #-1074	; 0xfffffbce
    418c:	6c62756f 	cfstr64vs	mvdx7, [r2], #-444	; 0xfffffe44
    4190:	5f5f0065 	svcpl	0x005f0065
    4194:	36544c46 	ldrbcc	r4, [r4], -r6, asr #24
    4198:	494d5f34 	stmdbmi	sp, {r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    419c:	205f5f4e 	subscs	r5, pc, lr, asr #30
    41a0:	32322e32 	eorscc	r2, r2, #800	; 0x320
    41a4:	33373035 	teqcc	r7, #53	; 0x35
    41a8:	35383538 	ldrcc	r3, [r8, #-1336]!	; 0xfffffac8
    41ac:	30323730 	eorscc	r3, r2, r0, lsr r7
    41b0:	2d653431 	cfstrdcs	mvd3, [r5, #-196]!	; 0xffffff3c
    41b4:	46383033 			; <UNDEFINED> instruction: 0x46383033
    41b8:	45003436 	strmi	r3, [r0, #-1078]	; 0xfffffbca
    41bc:	5f495458 	svcpl	0x00495458
    41c0:	00342034 	eorseq	r2, r4, r4, lsr r0
    41c4:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    41c8:	494d5f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    41cc:	58455f4e 	stmdapl	r5, {r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    41d0:	205f5f50 	subscs	r5, pc, r0, asr pc	; <UNPREDICTABLE>
    41d4:	32312d28 	eorscc	r2, r1, #40, 26	; 0xa00
    41d8:	5f002935 	svcpl	0x00002935
    41dc:	4e49575f 	mcrmi	7, 2, r5, cr9, cr15, {2}
    41e0:	49575f54 	ldmdbmi	r7, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    41e4:	5f485444 	svcpl	0x00485444
    41e8:	3233205f 	eorscc	r2, r3, #95	; 0x5f
    41ec:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	; <UNPREDICTABLE>
    41f0:	3436544e 	ldrtcc	r5, [r6], #-1102	; 0xfffffbb2
    41f4:	5059545f 	subspl	r5, r9, pc, asr r4
    41f8:	205f5f45 	subscs	r5, pc, r5, asr #30
    41fc:	676e6f6c 	strbvs	r6, [lr, -ip, ror #30]!
    4200:	6e6f6c20 	cdpvs	12, 6, cr6, cr15, cr0, {1}
    4204:	6e692067 	cdpvs	0, 6, cr2, cr9, cr7, {3}
    4208:	5f5f0074 	svcpl	0x005f0074
    420c:	4152464c 	cmpmi	r2, ip, asr #12
    4210:	465f5443 	ldrbmi	r5, [pc], -r3, asr #8
    4214:	5f544942 	svcpl	0x00544942
    4218:	3133205f 	teqcc	r3, pc, asr r0
    421c:	435f5f00 	cmpmi	pc, #0, 30
    4220:	5f524148 	svcpl	0x00524148
    4224:	5f544942 	svcpl	0x00544942
    4228:	0038205f 	eorseq	r2, r8, pc, asr r0
    422c:	49535f5f 	ldmdbmi	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    4230:	464f455a 			; <UNDEFINED> instruction: 0x464f455a
    4234:	4843575f 	stmdami	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, ip, lr}^
    4238:	545f5241 	ldrbpl	r5, [pc], #-577	; 4240 <_Min_Stack_Size+0x3e40>
    423c:	34205f5f 	strtcc	r5, [r0], #-3935	; 0xfffff0a1
    4240:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    4244:	39415049 	stmdbcc	r1, {r0, r3, r6, ip, lr}^
    4248:	58452820 	stmdapl	r5, {r5, fp, sp}^
    424c:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
    4250:	5f4f4950 	svcpl	0x004f4950
    4254:	7070614d 	rsbsvc	r6, r0, sp, asr #2
    4258:	5f676e69 	svcpl	0x00676e69
    425c:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
    4260:	5f495458 	svcpl	0x00495458
    4264:	28202c39 	stmdacs	r0!, {r0, r3, r4, r5, sl, fp, sp}
    4268:	4f495047 	svcmi	0x00495047
    426c:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    4270:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    4274:	745f6769 	ldrbvc	r6, [pc], #-1897	; 427c <_Min_Stack_Size+0x3e7c>
    4278:	50477b29 	subpl	r7, r7, r9, lsr #22
    427c:	2c414f49 	mcrrcs	15, 4, r4, r1, cr9
    4280:	4f495047 	svcmi	0x00495047
    4284:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    4288:	472c395f 			; <UNDEFINED> instruction: 0x472c395f
    428c:	5f4f4950 	svcpl	0x004f4950
    4290:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    4294:	5f46415f 	svcpl	0x0046415f
    4298:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    429c:	50472c54 	subpl	r2, r7, r4, asr ip
    42a0:	4f5f4f49 	svcmi	0x005f4f49
    42a4:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    42a8:	50535f54 	subspl	r5, r3, r4, asr pc
    42ac:	5f444545 	svcpl	0x00444545
    42b0:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
    42b4:	45007d7d 	strmi	r7, [r0, #-3453]	; 0xfffff283
    42b8:	50495458 	subpl	r5, r9, r8, asr r4
    42bc:	28203841 	stmdacs	r0!, {r0, r6, fp, ip, sp}
    42c0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    42c4:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    42c8:	614d5f4f 	cmpvs	sp, pc, asr #30
    42cc:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    42d0:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    42d4:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    42d8:	2c385f49 	ldccs	15, cr5, [r8], #-292	; 0xfffffedc
    42dc:	50472820 	subpl	r2, r7, r0, lsr #16
    42e0:	505f4f49 	subspl	r4, pc, r9, asr #30
    42e4:	6f436e69 	svcvs	0x00436e69
    42e8:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    42ec:	7b29745f 	blvc	a61470 <_Min_Stack_Size+0xa61070>
    42f0:	4f495047 	svcmi	0x00495047
    42f4:	50472c41 	subpl	r2, r7, r1, asr #24
    42f8:	505f4f49 	subspl	r4, pc, r9, asr #30
    42fc:	385f4e49 	ldmdacc	pc, {r0, r3, r6, r9, sl, fp, lr}^	; <UNPREDICTABLE>
    4300:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    4304:	4f4d5f4f 	svcmi	0x004d5f4f
    4308:	415f4544 	cmpmi	pc, r4, asr #10
    430c:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    4310:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    4314:	4f495047 	svcmi	0x00495047
    4318:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    431c:	5f545550 	svcpl	0x00545550
    4320:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    4324:	4f4e5f44 	svcmi	0x004e5f44
    4328:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    432c:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    4330:	52495f43 	subpl	r5, r9, #268	; 0x10c
    4334:	5f323351 	svcpl	0x00323351
    4338:	28534944 	ldmdacs	r3, {r2, r6, r8, fp, lr}^
    433c:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    4340:	5f434956 	svcpl	0x00434956
    4344:	52454349 	subpl	r4, r5, #603979777	; 0x24000001
    4348:	3d7c2031 	ldclcc	0, cr2, [ip, #-196]!	; 0xffffff3c
    434c:	3c312820 	ldccc	8, cr2, [r1], #-128	; 0xffffff80
    4350:	2929303c 	stmdbcs	r9!, {r2, r3, r4, r5, ip, sp}
    4354:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    4358:	28282049 	stmdacs	r8!, {r0, r3, r6, sp}
    435c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    4360:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    4364:	66656465 	strbtvs	r6, [r5], -r5, ror #8
    4368:	5845292a 	stmdapl	r5, {r1, r3, r5, r8, fp, sp}^
    436c:	425f4954 	subsmi	r4, pc, #84, 18	; 0x150000
    4370:	29455341 	stmdbcs	r5, {r0, r6, r8, r9, ip, lr}^
    4374:	41535500 	cmpmi	r3, r0, lsl #10
    4378:	5f315452 	svcpl	0x00315452
    437c:	45534142 	ldrbmi	r4, [r3, #-322]	; 0xfffffebe
    4380:	34783020 	ldrbtcc	r3, [r8], #-32	; 0xffffffe0
    4384:	33313030 	teqcc	r1, #48	; 0x30
    4388:	00303038 	eorseq	r3, r0, r8, lsr r0
    438c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    4390:	3920395f 	stmdbcc	r0!, {r0, r1, r2, r3, r4, r6, r8, fp, ip, sp}
    4394:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 349c <_Min_Stack_Size+0x309c>
    4398:	43415246 	movtmi	r5, #4678	; 0x1246
    439c:	414d5f54 	cmpmi	sp, r4, asr pc
    43a0:	205f5f58 	subscs	r5, pc, r8, asr pc	; <UNPREDICTABLE>
    43a4:	46465830 			; <UNDEFINED> instruction: 0x46465830
    43a8:	2d504646 	ldclcs	6, cr4, [r0, #-280]	; 0xfffffee8
    43ac:	52553631 	subspl	r3, r5, #51380224	; 0x3100000
    43b0:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    43b4:	31445049 	cmpcc	r4, r9, asr #32
    43b8:	45282031 	strmi	r2, [r8, #-49]!	; 0xffffffcf
    43bc:	5f495458 	svcpl	0x00495458
    43c0:	4f495047 	svcmi	0x00495047
    43c4:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    43c8:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    43cc:	7b29745f 	blvc	a61550 <_Min_Stack_Size+0xa61150>
    43d0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    43d4:	2c31315f 	ldfcss	f3, [r1], #-380	; 0xfffffe84
    43d8:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    43dc:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    43e0:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    43e4:	5f676966 	svcpl	0x00676966
    43e8:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    43ec:	444f4950 	strbmi	r4, [pc], #-2384	; 43f4 <_Min_Stack_Size+0x3ff4>
    43f0:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    43f4:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    43f8:	31315f4e 	teqcc	r1, lr, asr #30
    43fc:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    4400:	4f4d5f4f 	svcmi	0x004d5f4f
    4404:	415f4544 	cmpmi	pc, r4, asr #10
    4408:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    440c:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    4410:	4f495047 	svcmi	0x00495047
    4414:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    4418:	5f545550 	svcpl	0x00545550
    441c:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    4420:	4f4e5f44 	svcmi	0x004e5f44
    4424:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    4428:	535f5f00 	cmppl	pc, #0, 30
    442c:	43415246 	movtmi	r5, #4678	; 0x1246
    4430:	42495f54 	submi	r5, r9, #84, 30	; 0x150
    4434:	5f5f5449 	svcpl	0x005f5449
    4438:	5f003020 	svcpl	0x00003020
    443c:	414c555f 	cmpmi	ip, pc, asr r5
    4440:	4d554343 	ldclmi	3, cr4, [r5, #-268]	; 0xfffffef4
    4444:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    4448:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
    444c:	5f003233 	svcpl	0x00003233
    4450:	5459425f 	ldrbpl	r4, [r9], #-607	; 0xfffffda1
    4454:	524f5f45 	subpl	r5, pc, #276	; 0x114
    4458:	5f524544 	svcpl	0x00524544
    445c:	5f5f205f 	svcpl	0x005f205f
    4460:	4544524f 	strbmi	r5, [r4, #-591]	; 0xfffffdb1
    4464:	494c5f52 	stmdbmi	ip, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    4468:	454c5454 	strbmi	r5, [ip, #-1108]	; 0xfffffbac
    446c:	444e455f 	strbmi	r4, [lr], #-1375	; 0xfffffaa1
    4470:	5f4e4149 	svcpl	0x004e4149
    4474:	5f5f005f 	svcpl	0x005f005f
    4478:	33544c46 	cmpcc	r4, #17920	; 0x4600
    447c:	50455f32 	subpl	r5, r5, r2, lsr pc
    4480:	4f4c4953 	svcmi	0x004c4953
    4484:	205f5f4e 	subscs	r5, pc, lr, asr #30
    4488:	39312e31 	ldmdbcc	r1!, {r0, r4, r5, r9, sl, fp, sp}
    448c:	32393032 	eorscc	r3, r9, #50	; 0x32
    4490:	35353938 	ldrcc	r3, [r5, #-2360]!	; 0xfffff6c8
    4494:	31383730 	teqcc	r8, r0, lsr r7
    4498:	2d653532 	cfstr64cs	mvdx3, [r5, #-200]!	; 0xffffff38
    449c:	32334637 	eorscc	r4, r3, #57671680	; 0x3700000
    44a0:	415f5f00 	cmpmi	pc, r0, lsl #30
    44a4:	4e5f4d52 	mrcmi	13, 2, r4, cr15, cr2, {2}
    44a8:	5f4e4f45 	svcpl	0x004e4f45
    44ac:	4e005046 	cdpmi	0, 0, cr5, cr0, cr6, {2}
    44b0:	5f434956 	svcpl	0x00434956
    44b4:	33515249 	cmpcc	r1, #-1879048188	; 0x90000004
    44b8:	49445f33 	stmdbmi	r4, {r0, r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    44bc:	20292853 	eorcs	r2, r9, r3, asr r8
    44c0:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    44c4:	43495f43 	movtmi	r5, #40771	; 0x9f43
    44c8:	20315245 	eorscs	r5, r1, r5, asr #4
    44cc:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    44d0:	313c3c31 	teqcc	ip, r1, lsr ip
    44d4:	5f002929 	svcpl	0x00002929
    44d8:	5246555f 	subpl	r5, r6, #398458880	; 0x17c00000
    44dc:	5f544341 	svcpl	0x00544341
    44e0:	54494246 	strbpl	r4, [r9], #-582	; 0xfffffdba
    44e4:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    44e8:	5f5f0036 	svcpl	0x005f0036
    44ec:	5f514455 	svcpl	0x00514455
    44f0:	54494246 	strbpl	r4, [r9], #-582	; 0xfffffdba
    44f4:	36205f5f 	qsaxcc	r5, r0, pc	; <UNPREDICTABLE>
    44f8:	4c460034 	mcrrmi	0, 3, r0, r6, cr4
    44fc:	5f485341 	svcpl	0x00485341
    4500:	4f4d454d 	svcmi	0x004d454d
    4504:	425f5952 	subsmi	r5, pc, #1343488	; 0x148000
    4508:	20455341 	subcs	r5, r5, r1, asr #6
    450c:	38307830 	ldmdacc	r0!, {r4, r5, fp, ip, sp, lr}
    4510:	30303030 	eorscc	r3, r0, r0, lsr r0
    4514:	45003030 	strmi	r3, [r0, #-48]	; 0xffffffd0
    4518:	50495458 	subpl	r5, r9, r8, asr r4
    451c:	20313141 	eorscs	r3, r1, r1, asr #2
    4520:	54584528 	ldrbpl	r4, [r8], #-1320	; 0xfffffad8
    4524:	50475f49 	subpl	r5, r7, r9, asr #30
    4528:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 440c <_Min_Stack_Size+0x400c>
    452c:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
    4530:	745f676e 	ldrbvc	r6, [pc], #-1902	; 4538 <_Min_Stack_Size+0x4138>
    4534:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
    4538:	315f4954 	cmpcc	pc, r4, asr r9	; <UNPREDICTABLE>
    453c:	47282c31 			; <UNDEFINED> instruction: 0x47282c31
    4540:	5f4f4950 	svcpl	0x004f4950
    4544:	436e6950 	cmnmi	lr, #80, 18	; 0x140000
    4548:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    454c:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    4550:	4950477b 	ldmdbmi	r0, {r0, r1, r3, r4, r5, r6, r8, r9, sl, lr}^
    4554:	472c414f 	strmi	r4, [ip, -pc, asr #2]!
    4558:	5f4f4950 	svcpl	0x004f4950
    455c:	5f4e4950 	svcpl	0x004e4950
    4560:	472c3131 			; <UNDEFINED> instruction: 0x472c3131
    4564:	5f4f4950 	svcpl	0x004f4950
    4568:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    456c:	5f46415f 	svcpl	0x0046415f
    4570:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    4574:	50472c54 	subpl	r2, r7, r4, asr ip
    4578:	4f5f4f49 	svcmi	0x005f4f49
    457c:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    4580:	50535f54 	subspl	r5, r3, r4, asr pc
    4584:	5f444545 	svcpl	0x00444545
    4588:	454e4f4e 	strbmi	r4, [lr, #-3918]	; 0xfffff0b2
    458c:	5f007d7d 	svcpl	0x00007d7d
    4590:	42444c5f 	submi	r4, r4, #24320	; 0x5f00
    4594:	414d5f4c 	cmpmi	sp, ip, asr #30
    4598:	30315f58 	eorscc	r5, r1, r8, asr pc
    459c:	5058455f 	subspl	r4, r8, pc, asr r5
    45a0:	33205f5f 			; <UNDEFINED> instruction: 0x33205f5f
    45a4:	5f003830 	svcpl	0x00003830
    45a8:	4c42445f 	cfstrdmi	mvd4, [r2], {95}	; 0x5f
    45ac:	4e45445f 	mcrmi	4, 2, r4, cr5, cr15, {2}
    45b0:	5f4d524f 	svcpl	0x004d524f
    45b4:	5f4e494d 	svcpl	0x004e494d
    45b8:	2828205f 	stmdacs	r8!, {r0, r1, r2, r3, r4, r6, sp}
    45bc:	62756f64 	rsbsvs	r6, r5, #100, 30	; 0x190
    45c0:	3429656c 	strtcc	r6, [r9], #-1388	; 0xfffffa94
    45c4:	3034392e 	eorscc	r3, r4, lr, lsr #18
    45c8:	34363536 	ldrtcc	r3, [r6], #-1334	; 0xfffffaca
    45cc:	31343835 	teqcc	r4, r5, lsr r8
    45d0:	35363432 	ldrcc	r3, [r6, #-1074]!	; 0xfffffbce
    45d4:	332d6534 			; <UNDEFINED> instruction: 0x332d6534
    45d8:	294c3432 	stmdbcs	ip, {r1, r4, r5, sl, ip, sp}^
    45dc:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    45e0:	52545f49 	subspl	r5, r4, #292	; 0x124
    45e4:	45474749 	strbmi	r4, [r7, #-1865]	; 0xfffff8b7
    45e8:	49525f52 	ldmdbmi	r2, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    45ec:	474e4953 	smlsldmi	r4, lr, r3, r9
    45f0:	4c41465f 	mcrrmi	6, 5, r4, r1, cr15
    45f4:	474e494c 	strbmi	r4, [lr, -ip, asr #18]
    45f8:	5f003220 	svcpl	0x00003220
    45fc:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
    4600:	5341465f 	movtpl	r4, #5727	; 0x165f
    4604:	5f323354 	svcpl	0x00323354
    4608:	45505954 	ldrbmi	r5, [r0, #-2388]	; 0xfffff6ac
    460c:	69205f5f 	stmdbvs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    4610:	4e00746e 	cdpmi	4, 0, cr7, cr0, cr14, {3}
    4614:	5f434956 	svcpl	0x00434956
    4618:	33515249 	cmpcc	r1, #-1879048188	; 0x90000004
    461c:	49445f34 	stmdbmi	r4, {r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    4620:	20292853 	eorcs	r2, r9, r3, asr r8
    4624:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    4628:	43495f43 	movtmi	r5, #40771	; 0x9f43
    462c:	20315245 	eorscs	r5, r1, r5, asr #4
    4630:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    4634:	323c3c31 	eorscc	r3, ip, #12544	; 0x3100
    4638:	4e002929 	vmlami.f16	s4, s0, s19	; <UNPREDICTABLE>
    463c:	5f434956 	svcpl	0x00434956
    4640:	33515249 	cmpcc	r1, #-1879048188	; 0x90000004
    4644:	49445f30 	stmdbmi	r4, {r4, r5, r8, r9, sl, fp, ip, lr}^
    4648:	20292853 	eorcs	r2, r9, r3, asr r8
    464c:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    4650:	43495f43 	movtmi	r5, #40771	; 0x9f43
    4654:	20305245 	eorscs	r5, r0, r5, asr #4
    4658:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    465c:	333c3c31 	teqcc	ip, #12544	; 0x3100
    4660:	00292930 	eoreq	r2, r9, r0, lsr r9
    4664:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    4668:	52495f32 	subpl	r5, r9, #50, 30	; 0xc8
    466c:	6e614851 	mcrvs	8, 3, r4, cr1, cr1, {2}
    4670:	72656c64 	rsbvc	r6, r5, #100, 24	; 0x6400
    4674:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    4678:	3436544c 	ldrtcc	r5, [r6], #-1100	; 0xfffffbb4
    467c:	5341485f 	movtpl	r4, #6239	; 0x185f
    4680:	4955515f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, ip, lr}^
    4684:	4e5f5445 	cdpmi	4, 5, cr5, cr15, cr5, {2}
    4688:	5f5f4e41 	svcpl	0x005f4e41
    468c:	5f003120 	svcpl	0x00003120
    4690:	4153555f 	cmpmi	r3, pc, asr r5
    4694:	4d554343 	ldclmi	3, cr4, [r5, #-268]	; 0xfffffef4
    4698:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    469c:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
    46a0:	5f5f0038 	svcpl	0x005f0038
    46a4:	36544c46 	ldrbcc	r4, [r4], -r6, asr #24
    46a8:	41485f34 	cmpmi	r8, r4, lsr pc
    46ac:	45445f53 	strbmi	r5, [r4, #-3923]	; 0xfffff0ad
    46b0:	4d524f4e 	ldclmi	15, cr4, [r2, #-312]	; 0xfffffec8
    46b4:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    46b8:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 37c0 <_Min_Stack_Size+0x33c0>
    46bc:	43414c4c 	movtmi	r4, #7244	; 0x1c4c
    46c0:	5f4d5543 	svcpl	0x004d5543
    46c4:	54494249 	strbpl	r4, [r9], #-585	; 0xfffffdb7
    46c8:	33205f5f 			; <UNDEFINED> instruction: 0x33205f5f
    46cc:	5f5f0032 	svcpl	0x005f0032
    46d0:	544e4955 	strbpl	r4, [lr], #-2389	; 0xfffff6ab
    46d4:	5f58414d 	svcpl	0x0058414d
    46d8:	45505954 	ldrbmi	r5, [r0, #-2388]	; 0xfffff6ac
    46dc:	6c205f5f 	stcvs	15, cr5, [r0], #-380	; 0xfffffe84
    46e0:	20676e6f 	rsbcs	r6, r7, pc, ror #28
    46e4:	676e6f6c 	strbvs	r6, [lr, -ip, ror #30]!
    46e8:	736e7520 	cmnvc	lr, #32, 10	; 0x8000000
    46ec:	656e6769 	strbvs	r6, [lr, #-1897]!	; 0xfffff897
    46f0:	6e692064 	cdpvs	0, 6, cr2, cr9, cr4, {3}
    46f4:	5f5f0074 	svcpl	0x005f0074
    46f8:	5f544c46 	svcpl	0x00544c46
    46fc:	4c415645 	mcrrmi	6, 4, r5, r1, cr5
    4700:	54454d5f 	strbpl	r4, [r5], #-3423	; 0xfffff2a1
    4704:	5f444f48 	svcpl	0x00444f48
    4708:	0030205f 	eorseq	r2, r0, pc, asr r0
    470c:	5f434352 	svcpl	0x00434352
    4710:	4f495047 	svcmi	0x00495047
    4714:	4c435f41 	mcrrmi	15, 4, r5, r3, cr1
    4718:	4e455f4b 	cdpmi	15, 4, cr5, cr5, cr11, {2}
    471c:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    4720:	2d434352 	stclcs	3, cr4, [r3, #-328]	; 0xfffffeb8
    4724:	4250413e 	subsmi	r4, r0, #-2147483633	; 0x8000000f
    4728:	524e4532 	subpl	r4, lr, #209715200	; 0xc800000
    472c:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    4730:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    4734:	00292932 	eoreq	r2, r9, r2, lsr r9
    4738:	43535f5f 	cmpmi	r3, #380	; 0x17c
    473c:	5f524148 	svcpl	0x00524148
    4740:	5f58414d 	svcpl	0x0058414d
    4744:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    4748:	5f006637 	svcpl	0x00006637
    474c:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
    4750:	5341465f 	movtpl	r4, #5727	; 0x165f
    4754:	575f3854 			; <UNDEFINED> instruction: 0x575f3854
    4758:	48544449 	ldmdami	r4, {r0, r3, r6, sl, lr}^
    475c:	33205f5f 			; <UNDEFINED> instruction: 0x33205f5f
    4760:	5f5f0032 	svcpl	0x005f0032
    4764:	43445453 	movtmi	r5, #17491	; 0x4453
    4768:	4654555f 			; <UNDEFINED> instruction: 0x4654555f
    476c:	5f36315f 	svcpl	0x0036315f
    4770:	0031205f 	eorseq	r2, r1, pc, asr r0
    4774:	4f495047 	svcmi	0x00495047
    4778:	444f4d5f 	strbmi	r4, [pc], #-3423	; 4780 <_Min_Stack_Size+0x4380>
    477c:	4e495f45 	cdpmi	15, 4, cr5, cr9, cr5, {2}
    4780:	5f545550 	svcpl	0x00545550
    4784:	32205550 	eorcc	r5, r0, #80, 10	; 0x14000000
    4788:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 3890 <_Min_Stack_Size+0x3490>
    478c:	465f5151 			; <UNDEFINED> instruction: 0x465f5151
    4790:	5f544942 	svcpl	0x00544942
    4794:	0038205f 	eorseq	r2, r8, pc, asr r0
    4798:	49575f5f 	ldmdbmi	r7, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    479c:	545f544e 	ldrbpl	r5, [pc], #-1102	; 47a4 <_Min_Stack_Size+0x43a4>
    47a0:	5f455059 	svcpl	0x00455059
    47a4:	6e75205f 	mrcvs	0, 3, r2, cr5, cr15, {2}
    47a8:	6e676973 			; <UNDEFINED> instruction: 0x6e676973
    47ac:	69206465 	stmdbvs	r0!, {r0, r2, r5, r6, sl, sp, lr}
