mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    47b0:	4500746e 	strmi	r7, [r0, #-1134]	; 0xfffffb92
    47b4:	5f495458 	svcpl	0x00495458
    47b8:	31203031 			; <UNDEFINED> instruction: 0x31203031
    47bc:	5f5f0030 	svcpl	0x005f0030
    47c0:	36434544 	strbcc	r4, [r3], -r4, asr #10
    47c4:	494d5f34 	stmdbmi	sp, {r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    47c8:	58455f4e 	stmdapl	r5, {r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    47cc:	205f5f50 	subscs	r5, pc, r0, asr pc	; <UNPREDICTABLE>
    47d0:	38332d28 	ldmdacc	r3!, {r3, r5, r8, sl, fp, sp}
    47d4:	5f002932 	svcpl	0x00002932
    47d8:	4343475f 	movtmi	r4, #14175	; 0x375f
    47dc:	4345495f 	movtmi	r4, #22879	; 0x595f
    47e0:	3935355f 	ldmdbcc	r5!, {r0, r1, r2, r3, r4, r6, r8, sl, ip, sp}
    47e4:	5f003020 	svcpl	0x00003020
    47e8:	52464c5f 	subpl	r4, r6, #24320	; 0x5f00
    47ec:	5f544341 	svcpl	0x00544341
    47f0:	5f58414d 	svcpl	0x0058414d
    47f4:	5830205f 	ldmdapl	r0!, {r0, r1, r2, r3, r4, r6, sp}
    47f8:	46464637 			; <UNDEFINED> instruction: 0x46464637
    47fc:	46464646 	strbmi	r4, [r6], -r6, asr #12
    4800:	31332d50 	teqcc	r3, r0, asr sp
    4804:	5f00524c 	svcpl	0x0000524c
    4808:	5a49535f 	bpl	125958c <_Min_Stack_Size+0x125918c>
    480c:	5f464f45 	svcpl	0x00464f45
    4810:	44525450 	ldrbmi	r5, [r2], #-1104	; 0xfffffbb0
    4814:	5f464649 	svcpl	0x00464649
    4818:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
    481c:	5f5f0034 	svcpl	0x005f0034
    4820:	43445453 	movtmi	r5, #17491	; 0x4453
    4824:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    4828:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    482c:	43495f43 	movtmi	r5, #40771	; 0x9f43
    4830:	20325250 	eorscs	r5, r2, r0, asr r2
    4834:	7576282a 	ldrbvc	r2, [r6, #-2090]!	; 0xfffff7d6
    4838:	33746e69 	cmncc	r4, #1680	; 0x690
    483c:	2a745f32 	bcs	1d1c50c <_Min_Stack_Size+0x1d1c10c>
    4840:	564e2829 	strbpl	r2, [lr], -r9, lsr #16
    4844:	425f4349 	subsmi	r4, pc, #603979777	; 0x24000001
    4848:	2b455341 	blcs	1159554 <_Min_Stack_Size+0x1159154>
    484c:	38317830 	ldmdacc	r1!, {r4, r5, fp, ip, sp, lr}
    4850:	45002938 	strmi	r2, [r0, #-2360]	; 0xfffff6c8
    4854:	5f495458 	svcpl	0x00495458
    4858:	006e6950 	rsbeq	r6, lr, r0, asr r9
    485c:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    4860:	5f54414f 	svcpl	0x0054414f
    4864:	44524f57 	ldrbmi	r4, [r2], #-3927	; 0xfffff0a9
    4868:	44524f5f 	ldrbmi	r4, [r2], #-3935	; 0xfffff0a1
    486c:	5f5f5245 	svcpl	0x005f5245
    4870:	4f5f5f20 	svcmi	0x005f5f20
    4874:	52454452 	subpl	r4, r5, #1375731712	; 0x52000000
    4878:	54494c5f 	strbpl	r4, [r9], #-3167	; 0xfffff3a1
    487c:	5f454c54 	svcpl	0x00454c54
    4880:	49444e45 	stmdbmi	r4, {r0, r2, r6, r9, sl, fp, lr}^
    4884:	5f5f4e41 	svcpl	0x005f4e41
    4888:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    488c:	50475f49 	subpl	r5, r7, r9, asr #30
    4890:	505f4f49 	subspl	r4, pc, r9, asr #30
    4894:	6f436e69 	svcvs	0x00436e69
    4898:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    489c:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 39a4 <_Min_Stack_Size+0x35a4>
    48a0:	38544e49 	ldmdacc	r4, {r0, r3, r6, r9, sl, fp, lr}^
    48a4:	5059545f 	subspl	r5, r9, pc, asr r4
    48a8:	205f5f45 	subscs	r5, pc, r5, asr #30
    48ac:	69736e75 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, sl, fp, sp, lr}^
    48b0:	64656e67 	strbtvs	r6, [r5], #-3687	; 0xfffff199
    48b4:	61686320 	cmnvs	r8, r0, lsr #6
    48b8:	58450072 	stmdapl	r5, {r1, r4, r5, r6}^
    48bc:	315f4954 	cmpcc	pc, r4, asr r9	; <UNPREDICTABLE>
    48c0:	32312032 	eorscc	r2, r1, #50	; 0x32
    48c4:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 39cc <_Min_Stack_Size+0x35cc>
    48c8:	5f544e49 	svcpl	0x00544e49
    48cc:	5341454c 	movtpl	r4, #5452	; 0x154c
    48d0:	545f3854 	ldrbpl	r3, [pc], #-2132	; 48d8 <_Min_Stack_Size+0x44d8>
    48d4:	5f455059 	svcpl	0x00455059
    48d8:	6e75205f 	mrcvs	0, 3, r2, cr5, cr15, {2}
    48dc:	6e676973 			; <UNDEFINED> instruction: 0x6e676973
    48e0:	63206465 			; <UNDEFINED> instruction: 0x63206465
    48e4:	00726168 	rsbseq	r6, r2, r8, ror #2
    48e8:	48535f5f 	ldmdami	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    48ec:	575f5452 			; <UNDEFINED> instruction: 0x575f5452
    48f0:	48544449 	ldmdami	r4, {r0, r3, r6, sl, lr}^
    48f4:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    48f8:	5f670036 	svcpl	0x00670036
    48fc:	5f515249 	svcpl	0x00515249
    4900:	6c6c6143 	stfvse	f6, [ip], #-268	; 0xfffffef4
    4904:	6b636142 	blvs	18dce14 <_Min_Stack_Size+0x18dca14>
    4908:	00727450 	rsbseq	r7, r2, r0, asr r4
    490c:	4349564e 	movtmi	r5, #38478	; 0x964e
    4910:	5053495f 	subspl	r4, r3, pc, asr r9
    4914:	2a203052 	bcs	810a64 <_Min_Stack_Size+0x810664>
    4918:	69757628 	ldmdbvs	r5!, {r3, r5, r9, sl, ip, sp, lr}^
    491c:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    4920:	292a745f 	stmdbcs	sl!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    4924:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    4928:	41425f43 	cmpmi	r2, r3, asr #30
    492c:	302b4553 	eorcc	r4, fp, r3, asr r5
    4930:	30303178 	eorscc	r3, r0, r8, ror r1
    4934:	5f5f0029 	svcpl	0x005f0029
    4938:	31434544 	cmpcc	r3, r4, asr #10
    493c:	4d5f3832 	ldclmi	8, cr3, [pc, #-200]	; 487c <_Min_Stack_Size+0x447c>
    4940:	5f544e41 	svcpl	0x00544e41
    4944:	5f474944 	svcpl	0x00474944
    4948:	3433205f 	ldrtcc	r2, [r3], #-95	; 0xffffffa1
    494c:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    4950:	52495f43 	subpl	r5, r9, #268	; 0x10c
    4954:	5f373351 	svcpl	0x00373351
    4958:	29284e45 	stmdbcs	r8!, {r0, r2, r6, r9, sl, fp, lr}
    495c:	564e2820 	strbpl	r2, [lr], -r0, lsr #16
    4960:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    4964:	31524553 	cmpcc	r2, r3, asr r5
    4968:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    496c:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    4970:	00292935 	eoreq	r2, r9, r5, lsr r9
    4974:	53555f5f 	cmppl	r5, #380	; 0x17c
    4978:	42465f41 	submi	r5, r6, #260	; 0x104
    497c:	5f5f5449 	svcpl	0x005f5449
    4980:	00363120 	eorseq	r3, r6, r0, lsr #2
    4984:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    4988:	2034315f 	eorscs	r3, r4, pc, asr r1
    498c:	5f003431 	svcpl	0x00003431
    4990:	544c465f 	strbpl	r4, [ip], #-1631	; 0xfffff9a1
    4994:	5f583233 	svcpl	0x00583233
    4998:	5f4e494d 	svcpl	0x004e494d
    499c:	5f505845 	svcpl	0x00505845
    49a0:	2d28205f 	stccs	0, cr2, [r8, #-380]!	; 0xfffffe84
    49a4:	31323031 	teqcc	r2, r1, lsr r0
    49a8:	5f5f0029 	svcpl	0x005f0029
    49ac:	33544c46 	cmpcc	r4, #17920	; 0x4600
    49b0:	455f5832 	ldrbmi	r5, [pc, #-2098]	; 4186 <_Min_Stack_Size+0x3d86>
    49b4:	4c495350 	mcrrmi	3, 5, r5, r9, cr0
    49b8:	5f5f4e4f 	svcpl	0x005f4e4f
    49bc:	322e3220 	eorcc	r3, lr, #32, 4
    49c0:	34343032 	ldrtcc	r3, [r4], #-50	; 0xffffffce
    49c4:	39343036 	ldmdbcc	r4!, {r1, r2, r4, r5, ip, sp}
    49c8:	33303532 	teqcc	r0, #209715200	; 0xc800000
    49cc:	65313331 	ldrvs	r3, [r1, #-817]!	; 0xfffffccf
    49d0:	4636312d 	ldrtmi	r3, [r6], -sp, lsr #2
    49d4:	00783233 	rsbseq	r3, r8, r3, lsr r2
    49d8:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    49dc:	41485f54 	cmpmi	r8, r4, asr pc
    49e0:	55515f53 	ldrbpl	r5, [r1, #-3923]	; 0xfffff0ad
    49e4:	5f544549 	svcpl	0x00544549
    49e8:	5f4e414e 	svcpl	0x004e414e
    49ec:	0031205f 	eorseq	r2, r1, pc, asr r0
    49f0:	43475f5f 	movtmi	r5, #32607	; 0x7f5f
    49f4:	54415f43 	strbpl	r5, [r1], #-3907	; 0xfffff0bd
    49f8:	43494d4f 	movtmi	r4, #40271	; 0x9d4f
    49fc:	4148435f 	cmpmi	r8, pc, asr r3
    4a00:	4f4c5f52 	svcmi	0x004c5f52
    4a04:	465f4b43 	ldrbmi	r4, [pc], -r3, asr #22
    4a08:	20454552 	subcs	r4, r5, r2, asr r5
    4a0c:	5f5f0032 	svcpl	0x005f0032
    4a10:	4152464c 	cmpmi	r2, ip, asr #12
    4a14:	455f5443 	ldrbmi	r5, [pc, #-1091]	; 45d9 <_Min_Stack_Size+0x41d9>
    4a18:	4c495350 	mcrrmi	3, 5, r5, r9, cr0
    4a1c:	5f5f4e4f 	svcpl	0x005f4e4f
    4a20:	31783020 	cmncc	r8, r0, lsr #32
    4a24:	31332d50 	teqcc	r3, r0, asr sp
    4a28:	5f00524c 	svcpl	0x0000524c
    4a2c:	4d52415f 	ldfmie	f4, [r2, #-380]	; 0xfffffe84
    4a30:	5a49535f 	bpl	12597b4 <_Min_Stack_Size+0x12593b4>
    4a34:	5f464f45 	svcpl	0x00464f45
    4a38:	494e494d 	stmdbmi	lr, {r0, r2, r3, r6, r8, fp, lr}^
    4a3c:	5f4c414d 	svcpl	0x004c414d
    4a40:	4d554e45 	ldclmi	14, cr4, [r5, #-276]	; 0xfffffeec
    4a44:	5f003120 	svcpl	0x00003120
    4a48:	6d72615f 	ldfvse	f6, [r2, #-380]!	; 0xfffffe84
    4a4c:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    4a50:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    4a54:	3233544c 	eorscc	r5, r3, #76, 8	; 0x4c000000
    4a58:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    4a5c:	5f30315f 	svcpl	0x0030315f
    4a60:	5f505845 	svcpl	0x00505845
    4a64:	2d28205f 	stccs	0, cr2, [r8, #-380]!	; 0xfffffe84
    4a68:	00293733 	eoreq	r3, r9, r3, lsr r7
    4a6c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    4a70:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    4a74:	66656465 	strbtvs	r6, [r5], -r5, ror #8
    4a78:	415f5f00 	cmpmi	pc, r0, lsl #30
    4a7c:	465f4d52 			; <UNDEFINED> instruction: 0x465f4d52
    4a80:	5f363150 	svcpl	0x00363150
    4a84:	4d524f46 	ldclmi	15, cr4, [r2, #-280]	; 0xfffffee8
    4a88:	415f5441 	cmpmi	pc, r1, asr #8
    4a8c:	5245544c 	subpl	r5, r5, #76, 8	; 0x4c000000
    4a90:	4954414e 	ldmdbmi	r4, {r1, r2, r3, r6, r8, lr}^
    4a94:	4e004556 	cfrshl32mi	mvfx0, mvfx6, r4
    4a98:	5f434956 	svcpl	0x00434956
    4a9c:	36515249 	ldrbcc	r5, [r1], -r9, asr #4
    4aa0:	5349445f 	movtpl	r4, #37983	; 0x945f
    4aa4:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    4aa8:	4349564e 	movtmi	r5, #38478	; 0x964e
    4aac:	4543495f 	strbmi	r4, [r3, #-2399]	; 0xfffff6a1
    4ab0:	7c203052 	stcvc	0, cr3, [r0], #-328	; 0xfffffeb8
    4ab4:	3128203d 			; <UNDEFINED> instruction: 0x3128203d
    4ab8:	29363c3c 	ldmdbcs	r6!, {r2, r3, r4, r5, sl, fp, ip, sp}
    4abc:	5f5f0029 	svcpl	0x005f0029
    4ac0:	33434544 	movtcc	r4, #13636	; 0x3544
    4ac4:	414d5f32 	cmpmi	sp, r2, lsr pc
    4ac8:	445f544e 	ldrbmi	r5, [pc], #-1102	; 4ad0 <_Min_Stack_Size+0x46d0>
    4acc:	5f5f4749 	svcpl	0x005f4749
    4ad0:	50003720 	andpl	r3, r0, r0, lsr #14
    4ad4:	50495245 	subpl	r5, r9, r5, asr #4
    4ad8:	41524548 	cmpmi	r2, r8, asr #10
    4adc:	425f534c 	subsmi	r5, pc, #76, 6	; 0x30000001
    4ae0:	20455341 	subcs	r5, r5, r1, asr #6
    4ae4:	30347830 	eorscc	r7, r4, r0, lsr r8
    4ae8:	30303030 	eorscc	r3, r0, r0, lsr r0
    4aec:	5f003030 	svcpl	0x00003030
    4af0:	4749425f 	smlsldmi	r4, r9, pc, r2	; <UNPREDICTABLE>
    4af4:	54534547 	ldrbpl	r4, [r3], #-1351	; 0xfffffab9
    4af8:	494c415f 	stmdbmi	ip, {r0, r1, r2, r3, r4, r6, r8, lr}^
    4afc:	454d4e47 	strbmi	r4, [sp, #-3655]	; 0xfffff1b9
    4b00:	5f5f544e 	svcpl	0x005f544e
    4b04:	5f003820 	svcpl	0x00003820
    4b08:	4345445f 	movtmi	r4, #21599	; 0x545f
    4b0c:	4d5f3436 	cfldrdmi	mvd3, [pc, #-216]	; 4a3c <_Min_Stack_Size+0x463c>
    4b10:	5f544e41 	svcpl	0x00544e41
    4b14:	5f474944 	svcpl	0x00474944
    4b18:	3631205f 			; <UNDEFINED> instruction: 0x3631205f
    4b1c:	545f5f00 	ldrbpl	r5, [pc], #-3840	; 4b24 <_Min_Stack_Size+0x4724>
    4b20:	42495f41 	submi	r5, r9, #260	; 0x104
    4b24:	5f5f5449 	svcpl	0x005f5449
    4b28:	00343620 	eorseq	r3, r4, r0, lsr #12
    4b2c:	334d5453 	movtcc	r5, #54355	; 0xd453
    4b30:	00312032 	eorseq	r2, r1, r2, lsr r0
    4b34:	44414552 	strbmi	r4, [r1], #-1362	; 0xfffffaae
    4b38:	5449425f 	strbpl	r4, [r9], #-607	; 0xfffffda1
    4b3c:	47455228 	strbmi	r5, [r5, -r8, lsr #4]
    4b40:	5449422c 	strbpl	r4, [r9], #-556	; 0xfffffdd4
    4b44:	20294f4e 	eorcs	r4, r9, lr, asr #30
    4b48:	45522828 	ldrbmi	r2, [r2, #-2088]	; 0xfffff7d8
    4b4c:	20262047 	eorcs	r2, r6, r7, asr #32
    4b50:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    4b54:	4e544942 	vnmlami.f16	s9, s8, s4	; <UNPREDICTABLE>
    4b58:	3e29294f 	vnmulcc.f16	s4, s18, s30	; <UNPREDICTABLE>
    4b5c:	5449423e 	strbpl	r4, [r9], #-574	; 0xfffffdc2
    4b60:	00294f4e 	eoreq	r4, r9, lr, asr #30
    4b64:	4349564e 	movtmi	r5, #38478	; 0x964e
    4b68:	5152495f 	cmppl	r2, pc, asr r9
    4b6c:	445f3031 	ldrbmi	r3, [pc], #-49	; 4b74 <_Min_Stack_Size+0x4774>
    4b70:	29285349 	stmdbcs	r8!, {r0, r3, r6, r8, r9, ip, lr}
    4b74:	564e2820 	strbpl	r2, [lr], -r0, lsr #16
    4b78:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    4b7c:	30524543 	subscc	r4, r2, r3, asr #10
    4b80:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    4b84:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    4b88:	29293031 	stmdbcs	r9!, {r0, r4, r5, ip, sp}
    4b8c:	415f5f00 	cmpmi	pc, r0, lsl #30
    4b90:	465f4d52 			; <UNDEFINED> instruction: 0x465f4d52
    4b94:	55544145 	ldrbpl	r4, [r4, #-325]	; 0xfffffebb
    4b98:	515f4552 	cmppl	pc, r2, asr r5	; <UNPREDICTABLE>
    4b9c:	584d4452 	stmdapl	sp, {r1, r4, r6, sl, lr}^
    4ba0:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    4ba4:	41425f49 	cmpmi	r2, r9, asr #30
    4ba8:	30204553 	eorcc	r4, r0, r3, asr r5
    4bac:	30303478 	eorscc	r3, r0, r8, ror r4
    4bb0:	30343031 	eorscc	r3, r4, r1, lsr r0
    4bb4:	58450030 	stmdapl	r5, {r4, r5}^
    4bb8:	495f4954 	ldmdbmi	pc, {r2, r4, r6, r8, fp, lr}^	; <UNPREDICTABLE>
    4bbc:	445f5152 	ldrbmi	r5, [pc], #-338	; 4bc4 <_Min_Stack_Size+0x47c4>
    4bc0:	42415349 	submi	r5, r1, #603979777	; 0x24000001
    4bc4:	3020454c 	eorcc	r4, r0, ip, asr #10
    4bc8:	415f5f00 	cmpmi	pc, r0, lsl #30
    4bcc:	415f4d52 	cmpmi	pc, r2, asr sp	; <UNPREDICTABLE>
    4bd0:	5f484352 	svcpl	0x00484352
    4bd4:	5f415349 	svcpl	0x00415349
    4bd8:	4d554854 	ldclmi	8, cr4, [r5, #-336]	; 0xfffffeb0
    4bdc:	00322042 	eorseq	r2, r2, r2, asr #32
    4be0:	4349564e 	movtmi	r5, #38478	; 0x964e
    4be4:	5152495f 	cmppl	r2, pc, asr r9
    4be8:	49445f37 	stmdbmi	r4, {r0, r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    4bec:	20292853 	eorcs	r2, r9, r3, asr r8
    4bf0:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    4bf4:	43495f43 	movtmi	r5, #40771	; 0x9f43
    4bf8:	20305245 	eorscs	r5, r0, r5, asr #4
    4bfc:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    4c00:	373c3c31 			; <UNDEFINED> instruction: 0x373c3c31
    4c04:	5f002929 	svcpl	0x00002929
    4c08:	4e4f4c5f 	mcrmi	12, 2, r4, cr15, cr15, {2}
    4c0c:	4f4c5f47 	svcmi	0x004c5f47
    4c10:	4d5f474e 	ldclmi	7, cr4, [pc, #-312]	; 4ae0 <_Min_Stack_Size+0x46e0>
    4c14:	5f5f5841 	svcpl	0x005f5841
    4c18:	37783020 	ldrbcc	r3, [r8, -r0, lsr #32]!
    4c1c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    4c20:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    4c24:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    4c28:	4c666666 	stclmi	6, cr6, [r6], #-408	; 0xfffffe68
    4c2c:	5f5f004c 	svcpl	0x005f004c
    4c30:	41524655 	cmpmi	r2, r5, asr r6
    4c34:	495f5443 	ldmdbmi	pc, {r0, r1, r6, sl, ip, lr}^	; <UNPREDICTABLE>
    4c38:	5f544942 	svcpl	0x00544942
    4c3c:	0030205f 	eorseq	r2, r0, pc, asr r0
    4c40:	52415f5f 	subpl	r5, r1, #380	; 0x17c
    4c44:	32335f4d 	eorscc	r5, r3, #308	; 0x134
    4c48:	5f544942 	svcpl	0x00544942
    4c4c:	54415453 	strbpl	r5, [r1], #-1107	; 0xfffffbad
    4c50:	00312045 	eorseq	r2, r1, r5, asr #32
    4c54:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    4c58:	435f3854 	cmpmi	pc, #84, 16	; 0x540000
    4c5c:	20296328 	eorcs	r6, r9, r8, lsr #6
    4c60:	5f5f0063 	svcpl	0x005f0063
    4c64:	4152464c 	cmpmi	r2, ip, asr #12
    4c68:	495f5443 	ldmdbmi	pc, {r0, r1, r6, sl, ip, lr}^	; <UNPREDICTABLE>
    4c6c:	5f544942 	svcpl	0x00544942
    4c70:	0030205f 	eorseq	r2, r0, pc, asr r0
    4c74:	42445f5f 	submi	r5, r4, #380	; 0x17c
    4c78:	494d5f4c 	stmdbmi	sp, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    4c7c:	58455f4e 	stmdapl	r5, {r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    4c80:	205f5f50 	subscs	r5, pc, r0, asr pc	; <UNPREDICTABLE>
    4c84:	30312d28 	eorscc	r2, r1, r8, lsr #26
    4c88:	00293132 	eoreq	r3, r9, r2, lsr r1
    4c8c:	444c5f5f 	strbmi	r5, [ip], #-3935	; 0xfffff0a1
    4c90:	485f4c42 	ldmdami	pc, {r1, r6, sl, fp, lr}^	; <UNPREDICTABLE>
    4c94:	445f5341 	ldrbmi	r5, [pc], #-833	; 4c9c <_Min_Stack_Size+0x489c>
    4c98:	524f4e45 	subpl	r4, pc, #1104	; 0x450
    4c9c:	205f5f4d 	subscs	r5, pc, sp, asr #30
    4ca0:	564e0031 			; <UNDEFINED> instruction: 0x564e0031
    4ca4:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    4ca8:	5f385152 	svcpl	0x00385152
    4cac:	28534944 	ldmdacs	r3, {r2, r6, r8, fp, lr}^
    4cb0:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    4cb4:	5f434956 	svcpl	0x00434956
    4cb8:	52454349 	subpl	r4, r5, #603979777	; 0x24000001
    4cbc:	3d7c2030 	ldclcc	0, cr2, [ip, #-192]!	; 0xffffff40
    4cc0:	3c312820 	ldccc	8, cr2, [r1], #-128	; 0xffffff80
    4cc4:	2929383c 	stmdbcs	r9!, {r2, r3, r4, r5, fp, ip, sp}
    4cc8:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    4ccc:	3233544c 	eorscc	r5, r3, #76, 8	; 0x4c000000
    4cd0:	4749445f 	smlsldmi	r4, r9, pc, r4	; <UNPREDICTABLE>
    4cd4:	36205f5f 	qsaxcc	r5, r0, pc	; <UNPREDICTABLE>
    4cd8:	41535500 	cmpmi	r3, r0, lsl #10
    4cdc:	5f325452 	svcpl	0x00325452
    4ce0:	45534142 	ldrbmi	r4, [r3, #-322]	; 0xfffffebe
    4ce4:	34783020 	ldrbtcc	r3, [r8], #-32	; 0xffffffe0
    4ce8:	34303030 	ldrtcc	r3, [r0], #-48	; 0xffffffd0
    4cec:	00303034 	eorseq	r3, r0, r4, lsr r0
    4cf0:	45495753 	strbmi	r5, [r9, #-1875]	; 0xfffff8ad
    4cf4:	434d0052 	movtmi	r0, #53330	; 0xd052
    4cf8:	495f4c41 	ldmdbmi	pc, {r0, r6, sl, fp, lr}^	; <UNPREDICTABLE>
    4cfc:	475f434e 	ldrbmi	r4, [pc, -lr, asr #6]
    4d00:	5f4f4950 	svcpl	0x004f4950
    4d04:	00205f48 	eoreq	r5, r0, r8, asr #30
    4d08:	552f3a43 	strpl	r3, [pc, #-2627]!	; 42cd <_Min_Stack_Size+0x3ecd>
    4d0c:	73726573 	cmnvc	r2, #482344960	; 0x1cc00000
    4d10:	2f70682f 	svccs	0x0070682f
    4d14:	336d7473 	cmncc	sp, #1929379840	; 0x73000000
    4d18:	726f7732 	rsbvc	r7, pc, #13107200	; 0xc80000
    4d1c:	6170736b 	cmnvs	r0, fp, ror #6
    4d20:	732f6563 			; <UNDEFINED> instruction: 0x732f6563
    4d24:	32336d74 	eorscc	r6, r3, #116, 26	; 0x1d00
    4d28:	33303166 	teqcc	r0, #-2147483623	; 0x80000019
    4d2c:	442f3878 	strtmi	r3, [pc], #-2168	; 4d34 <_Min_Stack_Size+0x4934>
    4d30:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    4d34:	55525400 	ldrbpl	r5, [r2, #-1024]	; 0xfffffc00
    4d38:	28282045 	stmdacs	r8!, {r0, r2, r6, sp}
    4d3c:	6c6f6f62 	stclvs	15, cr6, [pc], #-392	; 4bbc <_Min_Stack_Size+0x47bc>
    4d40:	296e6165 	stmdbcs	lr!, {r0, r2, r5, r6, r8, sp, lr}^
    4d44:	00293120 	eoreq	r3, r9, r0, lsr #2
    4d48:	43415f5f 	movtmi	r5, #8031	; 0x1f5f
    4d4c:	5f4d5543 	svcpl	0x004d5543
    4d50:	5f4e494d 	svcpl	0x004e494d
    4d54:	2d28205f 	stccs	0, cr2, [r8, #-380]!	; 0xfffffe84
    4d58:	50315830 	eorspl	r5, r1, r0, lsr r8
    4d5c:	2d4b3531 	cfstr64cs	mvdx3, [fp, #-196]	; 0xffffff3c
    4d60:	50315830 	eorspl	r5, r1, r0, lsr r8
    4d64:	294b3531 	stmdbcs	fp, {r0, r4, r5, r8, sl, ip, sp}^
    4d68:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    4d6c:	52495f43 	subpl	r5, r9, #268	; 0x10c
    4d70:	5f383251 	svcpl	0x00383251
    4d74:	29284e45 	stmdbcs	r8!, {r0, r2, r6, r9, sl, fp, lr}
    4d78:	564e2820 	strbpl	r2, [lr], -r0, lsr #16
    4d7c:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    4d80:	30524553 	subscc	r4, r2, r3, asr r5
    4d84:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    4d88:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    4d8c:	29293832 	stmdbcs	r9!, {r1, r4, r5, fp, ip, sp}
    4d90:	415f5f00 	cmpmi	pc, r0, lsl #30
    4d94:	465f4d52 			; <UNDEFINED> instruction: 0x465f4d52
    4d98:	55544145 	ldrbpl	r4, [r4, #-325]	; 0xfffffebb
    4d9c:	435f4552 	cmpmi	pc, #343932928	; 0x14800000
    4da0:	54505952 	ldrbpl	r5, [r0], #-2386	; 0xfffff6ae
    4da4:	564e004f 	strbpl	r0, [lr], -pc, asr #32
    4da8:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    4dac:	5f395152 	svcpl	0x00395152
    4db0:	28534944 	ldmdacs	r3, {r2, r6, r8, fp, lr}^
    4db4:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    4db8:	5f434956 	svcpl	0x00434956
    4dbc:	52454349 	subpl	r4, r5, #603979777	; 0x24000001
    4dc0:	3d7c2030 	ldclcc	0, cr2, [ip, #-192]!	; 0xffffff40
    4dc4:	3c312820 	ldccc	8, cr2, [r1], #-128	; 0xffffff80
    4dc8:	2929393c 	stmdbcs	r9!, {r2, r3, r4, r5, r8, fp, ip, sp}
    4dcc:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	; <UNPREDICTABLE>
    4dd0:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	; 0x4e
    4dd4:	54534145 	ldrbpl	r4, [r3], #-325	; 0xfffffebb
    4dd8:	545f3233 	ldrbpl	r3, [pc], #-563	; 4de0 <_Min_Stack_Size+0x49e0>
    4ddc:	5f455059 	svcpl	0x00455059
    4de0:	6f6c205f 	svcvs	0x006c205f
    4de4:	6920676e 	stmdbvs	r0!, {r1, r2, r3, r5, r6, r8, r9, sl, sp, lr}
    4de8:	5f00746e 	svcpl	0x0000746e
    4dec:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    4df0:	454c5f54 	strbmi	r5, [ip, #-3924]	; 0xfffff0ac
    4df4:	36545341 	ldrbcc	r5, [r4], -r1, asr #6
    4df8:	414d5f34 	cmpmi	sp, r4, lsr pc
    4dfc:	205f5f58 	subscs	r5, pc, r8, asr pc	; <UNPREDICTABLE>
    4e00:	66667830 			; <UNDEFINED> instruction: 0x66667830
    4e04:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    4e08:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    4e0c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    4e10:	4c556666 	mrrcmi	6, 6, r6, r5, cr6
    4e14:	5f5f004c 	svcpl	0x005f004c
    4e18:	43415246 	movtmi	r5, #4678	; 0x1246
    4e1c:	42495f54 	submi	r5, r9, #84, 30	; 0x150
    4e20:	5f5f5449 	svcpl	0x005f5449
    4e24:	45003020 	strmi	r3, [r0, #-32]	; 0xffffffe0
    4e28:	5f495458 	svcpl	0x00495458
    4e2c:	75706e49 	ldrbvc	r6, [r0, #-3657]!	; 0xfffff1b7
    4e30:	694c5f74 	stmdbvs	ip, {r2, r4, r5, r6, r8, r9, sl, fp, ip, lr}^
    4e34:	4500656e 	strmi	r6, [r0, #-1390]	; 0xfffffa92
    4e38:	5f495458 	svcpl	0x00495458
    4e3c:	4349564e 	movtmi	r5, #38478	; 0x964e
    4e40:	004e455f 	subeq	r4, lr, pc, asr r5
    4e44:	524f5f5f 	subpl	r5, pc, #380	; 0x17c
    4e48:	5f524544 	svcpl	0x00524544
    4e4c:	5454494c 	ldrbpl	r4, [r4], #-2380	; 0xfffff6b4
    4e50:	455f454c 	ldrbmi	r4, [pc, #-1356]	; 490c <_Min_Stack_Size+0x450c>
    4e54:	4149444e 	cmpmi	r9, lr, asr #8
    4e58:	205f5f4e 	subscs	r5, pc, lr, asr #30
    4e5c:	34333231 	ldrtcc	r3, [r3], #-561	; 0xfffffdcf
    4e60:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    4e64:	31455049 	cmpcc	r5, r9, asr #32
    4e68:	45282034 	strmi	r2, [r8, #-52]!	; 0xffffffcc
    4e6c:	5f495458 	svcpl	0x00495458
    4e70:	4f495047 	svcmi	0x00495047
    4e74:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    4e78:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    4e7c:	7b29745f 	blvc	a62000 <_Min_Stack_Size+0xa61c00>
    4e80:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    4e84:	2c34315f 	ldfcss	f3, [r4], #-380	; 0xfffffe84
    4e88:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    4e8c:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    4e90:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    4e94:	5f676966 	svcpl	0x00676966
    4e98:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    4e9c:	454f4950 	strbmi	r4, [pc, #-2384]	; 4554 <_Min_Stack_Size+0x4154>
    4ea0:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    4ea4:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    4ea8:	34315f4e 	ldrtcc	r5, [r1], #-3918	; 0xfffff0b2
    4eac:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    4eb0:	4f4d5f4f 	svcmi	0x004d5f4f
    4eb4:	415f4544 	cmpmi	pc, r4, asr #10
    4eb8:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    4ebc:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    4ec0:	4f495047 	svcmi	0x00495047
    4ec4:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    4ec8:	5f545550 	svcpl	0x00545550
    4ecc:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    4ed0:	4f4e5f44 	svcmi	0x004e5f44
    4ed4:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    4ed8:	41535500 	cmpmi	r3, r0, lsl #10
    4edc:	5f335452 	svcpl	0x00335452
    4ee0:	45534142 	ldrbmi	r4, [r3, #-322]	; 0xfffffebe
    4ee4:	34783020 	ldrbtcc	r3, [r8], #-32	; 0xffffffe0
    4ee8:	34303030 	ldrtcc	r3, [r0], #-48	; 0xffffffd0
    4eec:	00303038 	eorseq	r3, r0, r8, lsr r0
    4ef0:	4f495047 	svcmi	0x00495047
    4ef4:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
