mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    4ef8:	2820335f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, ip, sp}
    4efc:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    4f00:	5f363174 	svcpl	0x00363174
    4f04:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    4f08:	38303030 	ldmdacc	r0!, {r4, r5, ip, sp}
    4f0c:	564e0029 	strbpl	r0, [lr], -r9, lsr #32
    4f10:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    4f14:	31335152 	teqcc	r3, r2, asr r1
    4f18:	5349445f 	movtpl	r4, #37983	; 0x945f
    4f1c:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    4f20:	4349564e 	movtmi	r5, #38478	; 0x964e
    4f24:	4543495f 	strbmi	r4, [r3, #-2399]	; 0xfffff6a1
    4f28:	7c203052 	stcvc	0, cr3, [r0], #-328	; 0xfffffeb8
    4f2c:	3128203d 			; <UNDEFINED> instruction: 0x3128203d
    4f30:	31333c3c 	teqcc	r3, ip, lsr ip
    4f34:	5f002929 	svcpl	0x00002929
    4f38:	544c465f 	strbpl	r4, [ip], #-1631	; 0xfffff9a1
    4f3c:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    4f40:	5f30315f 	svcpl	0x0030315f
    4f44:	5f505845 	svcpl	0x00505845
    4f48:	2d28205f 	stccs	0, cr2, [r8, #-380]!	; 0xfffffe84
    4f4c:	00293733 	eoreq	r3, r9, r3, lsr r7
    4f50:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    4f54:	49564e5f 	ldmdbmi	r6, {r0, r1, r2, r3, r4, r6, r9, sl, fp, lr}^
    4f58:	49445f43 	stmdbmi	r4, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    4f5c:	564e0053 			; <UNDEFINED> instruction: 0x564e0053
    4f60:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    4f64:	39325152 	ldmdbcc	r2!, {r1, r4, r6, r8, ip, lr}
    4f68:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
    4f6c:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    4f70:	5f434956 	svcpl	0x00434956
    4f74:	52455349 	subpl	r5, r5, #603979777	; 0x24000001
    4f78:	3d7c2030 	ldclcc	0, cr2, [ip, #-192]!	; 0xffffff40
    4f7c:	3c312820 	ldccc	8, cr2, [r1], #-128	; 0xffffff80
    4f80:	2939323c 	ldmdbcs	r9!, {r2, r3, r4, r5, r9, ip, sp}
    4f84:	564e0029 	strbpl	r0, [lr], -r9, lsr #32
    4f88:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    4f8c:	5f385152 	svcpl	0x00385152
    4f90:	29284e45 	stmdbcs	r8!, {r0, r2, r6, r9, sl, fp, lr}
    4f94:	564e2820 	strbpl	r2, [lr], -r0, lsr #16
    4f98:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    4f9c:	30524553 	subscc	r4, r2, r3, asr r5
    4fa0:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    4fa4:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    4fa8:	00292938 	eoreq	r2, r9, r8, lsr r9
    4fac:	48535f5f 	ldmdami	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    4fb0:	4d5f5452 	cfldrdmi	mvd5, [pc, #-328]	; 4e70 <_Min_Stack_Size+0x4a70>
    4fb4:	5f5f5841 	svcpl	0x005f5841
    4fb8:	37783020 	ldrbcc	r3, [r8, -r0, lsr #32]!
    4fbc:	00666666 	rsbeq	r6, r6, r6, ror #12
    4fc0:	4c555f5f 	mrrcmi	15, 5, r5, r5, cr15	; <UNPREDICTABLE>
    4fc4:	4343414c 	movtmi	r4, #12620	; 0x314c
    4fc8:	455f4d55 	ldrbmi	r4, [pc, #-3413]	; 427b <_Min_Stack_Size+0x3e7b>
    4fcc:	4c495350 	mcrrmi	3, 5, r5, r9, cr0
    4fd0:	5f5f4e4f 	svcpl	0x005f4e4f
    4fd4:	31783020 	cmncc	r8, r0, lsr #32
    4fd8:	32332d50 	eorscc	r2, r3, #80, 26	; 0x1400
    4fdc:	4b4c4c55 	blmi	1318138 <_Min_Stack_Size+0x1317d38>
    4fe0:	6e697500 	cdpvs	5, 6, cr7, cr9, cr0, {0}
    4fe4:	745f3874 	ldrbvc	r3, [pc], #-2164	; 4fec <_Min_Stack_Size+0x4bec>
    4fe8:	415f5f00 	cmpmi	pc, r0, lsl #30
    4fec:	5f534350 	svcpl	0x00534350
    4ff0:	5f5f3233 	svcpl	0x005f3233
    4ff4:	5f003120 	svcpl	0x00003120
    4ff8:	5f51445f 	svcpl	0x0051445f
    4ffc:	54494246 	strbpl	r4, [r9], #-582	; 0xfffffdba
    5000:	36205f5f 	qsaxcc	r5, r0, pc	; <UNPREDICTABLE>
    5004:	5f5f0033 	svcpl	0x005f0033
    5008:	43434153 	movtmi	r4, #12627	; 0x3153
    500c:	495f4d55 	ldmdbmi	pc, {r0, r2, r4, r6, r8, sl, fp, lr}^	; <UNPREDICTABLE>
    5010:	5f544942 	svcpl	0x00544942
    5014:	0038205f 	eorseq	r2, r8, pc, asr r0
    5018:	48555f5f 	ldmdami	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    501c:	42495f51 	submi	r5, r9, #324	; 0x144
    5020:	5f5f5449 	svcpl	0x005f5449
    5024:	47003020 	strmi	r3, [r0, -r0, lsr #32]
    5028:	5f4f4950 	svcpl	0x004f4950
    502c:	5f4e4950 	svcpl	0x004e4950
    5030:	28282035 	stmdacs	r8!, {r0, r2, r4, r5, sp}
    5034:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    5038:	745f3631 	ldrbvc	r3, [pc], #-1585	; 5040 <_Min_Stack_Size+0x4c40>
    503c:	30783029 	rsbscc	r3, r8, r9, lsr #32
    5040:	29303230 	ldmdbcs	r0!, {r4, r5, r9, ip, sp}
    5044:	475f5f00 	ldrbmi	r5, [pc, -r0, lsl #30]
    5048:	485f4343 	ldmdami	pc, {r0, r1, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    504c:	5f455641 	svcpl	0x00455641
    5050:	434e5953 	movtmi	r5, #59731	; 0xe953
    5054:	4d4f435f 	stclmi	3, cr4, [pc, #-380]	; 4ee0 <_Min_Stack_Size+0x4ae0>
    5058:	45524150 	ldrbmi	r4, [r2, #-336]	; 0xfffffeb0
    505c:	444e415f 	strbmi	r4, [lr], #-351	; 0xfffffea1
    5060:	4157535f 	cmpmi	r7, pc, asr r3
    5064:	20345f50 	eorscs	r5, r4, r0, asr pc
    5068:	5f5f0031 	svcpl	0x005f0031
    506c:	5f544e49 	svcpl	0x00544e49
    5070:	54534146 	ldrbpl	r4, [r3], #-326	; 0xfffffeba
    5074:	545f3631 	ldrbpl	r3, [pc], #-1585	; 507c <_Min_Stack_Size+0x4c7c>
    5078:	5f455059 	svcpl	0x00455059
    507c:	6e69205f 	mcrvs	0, 3, r2, cr9, cr15, {2}
    5080:	58450074 	stmdapl	r5, {r2, r4, r5, r6}^
    5084:	42504954 	subsmi	r4, r0, #84, 18	; 0x150000
    5088:	28203431 	stmdacs	r0!, {r0, r4, r5, sl, ip, sp}
    508c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    5090:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    5094:	614d5f4f 	cmpvs	sp, pc, asr #30
    5098:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    509c:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    50a0:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    50a4:	34315f49 	ldrtcc	r5, [r1], #-3913	; 0xfffff0b7
    50a8:	5047282c 	subpl	r2, r7, ip, lsr #16
    50ac:	505f4f49 	subspl	r4, pc, r9, asr #30
    50b0:	6f436e69 	svcvs	0x00436e69
    50b4:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    50b8:	7b29745f 	blvc	a6223c <_Min_Stack_Size+0xa61e3c>
    50bc:	4f495047 	svcmi	0x00495047
    50c0:	50472c42 	subpl	r2, r7, r2, asr #24
    50c4:	505f4f49 	subspl	r4, pc, r9, asr #30
    50c8:	315f4e49 	cmpcc	pc, r9, asr #28
    50cc:	50472c34 	subpl	r2, r7, r4, lsr ip
    50d0:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 4fb4 <_Min_Stack_Size+0x4bb4>
    50d4:	5f45444f 	svcpl	0x0045444f
    50d8:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    50dc:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    50e0:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    50e4:	554f5f4f 	strbpl	r5, [pc, #-3919]	; 419d <_Min_Stack_Size+0x3d9d>
    50e8:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    50ec:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    50f0:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    50f4:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    50f8:	434d007d 	movtmi	r0, #53373	; 0xd07d
    50fc:	495f4c41 	ldmdbmi	pc, {r0, r6, sl, fp, lr}^	; <UNPREDICTABLE>
    5100:	535f434e 	cmppl	pc, #939524097	; 0x38000001
    5104:	32334d54 	eorscc	r4, r3, #84, 26	; 0x1500
    5108:	33303146 	teqcc	r0, #-2147483631	; 0x80000011
    510c:	485f3643 	ldmdami	pc, {r0, r1, r6, r9, sl, ip, sp}^	; <UNPREDICTABLE>
    5110:	5f00205f 	svcpl	0x0000205f
    5114:	4341535f 	movtmi	r5, #4959	; 0x135f
    5118:	5f4d5543 	svcpl	0x004d5543
    511c:	5f4e494d 	svcpl	0x004e494d
    5120:	2d28205f 	stccs	0, cr2, [r8, #-380]!	; 0xfffffe84
    5124:	50315830 	eorspl	r5, r1, r0, lsr r8
    5128:	2d4b4837 	stclcs	8, cr4, [fp, #-220]	; 0xffffff24
    512c:	50315830 	eorspl	r5, r1, r0, lsr r8
    5130:	294b4837 	stmdbcs	fp, {r0, r1, r2, r4, r5, fp, lr}^
    5134:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 423c <_Min_Stack_Size+0x3e3c>
    5138:	4152464c 	cmpmi	r2, ip, asr #12
    513c:	4d5f5443 	cfldrdmi	mvd5, [pc, #-268]	; 5038 <_Min_Stack_Size+0x4c38>
    5140:	5f5f5841 	svcpl	0x005f5841
    5144:	46583020 	ldrbmi	r3, [r8], -r0, lsr #32
    5148:	46464646 	strbmi	r4, [r6], -r6, asr #12
    514c:	50464646 	subpl	r4, r6, r6, asr #12
    5150:	5532332d 	ldrpl	r3, [r2, #-813]!	; 0xfffffcd3
    5154:	5f00524c 	svcpl	0x0000524c
    5158:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    515c:	454c5f54 	strbmi	r5, [ip, #-3924]	; 0xfffff0ac
    5160:	31545341 	cmpcc	r4, r1, asr #6
    5164:	59545f36 	ldmdbpl	r4, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    5168:	5f5f4550 	svcpl	0x005f4550
    516c:	6f687320 	svcvs	0x00687320
    5170:	75207472 	strvc	r7, [r0, #-1138]!	; 0xfffffb8e
    5174:	6769736e 	strbvs	r7, [r9, -lr, ror #6]!
    5178:	2064656e 	rsbcs	r6, r4, lr, ror #10
    517c:	00746e69 	rsbseq	r6, r4, r9, ror #28
    5180:	52415f5f 	subpl	r5, r1, #380	; 0x17c
    5184:	45465f4d 	strbmi	r5, [r6, #-3917]	; 0xfffff0b3
    5188:	52555441 	subspl	r5, r5, #1090519040	; 0x41000000
    518c:	4d465f45 	stclmi	15, cr5, [r6, #-276]	; 0xfffffeec
    5190:	5f5f0041 	svcpl	0x005f0041
    5194:	4343414c 	movtmi	r4, #12620	; 0x314c
    5198:	4d5f4d55 	ldclmi	13, cr4, [pc, #-340]	; 504c <_Min_Stack_Size+0x4c4c>
    519c:	5f5f5841 	svcpl	0x005f5841
    51a0:	37583020 	ldrbcc	r3, [r8, -r0, lsr #32]
    51a4:	46464646 	strbmi	r4, [r6], -r6, asr #12
    51a8:	46464646 	strbmi	r4, [r6], -r6, asr #12
    51ac:	46464646 	strbmi	r4, [r6], -r6, asr #12
    51b0:	50464646 	subpl	r4, r6, r6, asr #12
    51b4:	4c31332d 	ldcmi	3, cr3, [r1], #-180	; 0xffffff4c
    51b8:	5f5f004b 	svcpl	0x005f004b
    51bc:	52414843 	subpl	r4, r1, #4390912	; 0x430000
    51c0:	545f3631 	ldrbpl	r3, [pc], #-1585	; 51c8 <_Min_Stack_Size+0x4dc8>
    51c4:	5f455059 	svcpl	0x00455059
    51c8:	6873205f 	ldmdavs	r3!, {r0, r1, r2, r3, r4, r6, sp}^
    51cc:	2074726f 	rsbscs	r7, r4, pc, ror #4
    51d0:	69736e75 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, sl, fp, sp, lr}^
    51d4:	64656e67 	strbtvs	r6, [r5], #-3687	; 0xfffff199
    51d8:	746e6920 	strbtvc	r6, [lr], #-2336	; 0xfffff6e0
    51dc:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    51e0:	6f505f4f 	svcvs	0x00505f4f
    51e4:	47007472 	smlsdxmi	r0, r2, r4, r7
    51e8:	5f4f4950 	svcpl	0x004f4950
    51ec:	5f4e4950 	svcpl	0x004e4950
    51f0:	28282036 	stmdacs	r8!, {r1, r2, r4, r5, sp}
    51f4:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    51f8:	745f3631 	ldrbvc	r3, [pc], #-1585	; 5200 <_Min_Stack_Size+0x4e00>
    51fc:	30783029 	rsbscc	r3, r8, r9, lsr #32
    5200:	29303430 	ldmdbcs	r0!, {r4, r5, sl, ip, sp}
    5204:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    5208:	3233544c 	eorscc	r5, r3, #76, 8	; 0x4c000000
    520c:	49445f58 	stmdbmi	r4, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    5210:	205f5f47 	subscs	r5, pc, r7, asr #30
    5214:	45003531 	strmi	r3, [r0, #-1329]	; 0xfffffacf
    5218:	5f495458 	svcpl	0x00495458
    521c:	00302030 	eorseq	r2, r0, r0, lsr r0
    5220:	54555f5f 	ldrbpl	r5, [r5], #-3935	; 0xfffff0a1
    5224:	42465f51 	submi	r5, r6, #324	; 0x144
    5228:	5f5f5449 	svcpl	0x005f5449
    522c:	38323120 	ldmdacc	r2!, {r5, r8, ip, sp}
    5230:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    5234:	54494e49 	strbpl	r4, [r9], #-3657	; 0xfffff1b7
    5238:	414d5f45 	cmpmi	sp, r5, asr #30
    523c:	4f5f4854 	svcmi	0x005f4854
    5240:	5f594c4e 	svcpl	0x00594c4e
    5244:	0030205f 	eorseq	r2, r0, pc, asr r0
    5248:	4349564e 	movtmi	r5, #38478	; 0x964e
    524c:	5043495f 	subpl	r4, r3, pc, asr r9
    5250:	2a203052 	bcs	8113a0 <_Min_Stack_Size+0x810fa0>
    5254:	69757628 	ldmdbvs	r5!, {r3, r5, r9, sl, ip, sp, lr}^
    5258:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    525c:	292a745f 	stmdbcs	sl!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    5260:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    5264:	41425f43 	cmpmi	r2, r3, asr #30
    5268:	302b4553 	eorcc	r4, fp, r3, asr r5
    526c:	30383178 	eorscc	r3, r8, r8, ror r1
    5270:	5f5f0029 	svcpl	0x005f0029
    5274:	5f544e49 	svcpl	0x00544e49
    5278:	54534146 	ldrbpl	r4, [r3], #-326	; 0xfffffeba
    527c:	4d5f3631 	ldclmi	6, cr3, [pc, #-196]	; 51c0 <_Min_Stack_Size+0x4dc0>
    5280:	5f5f5841 	svcpl	0x005f5841
    5284:	37783020 	ldrbcc	r3, [r8, -r0, lsr #32]!
    5288:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    528c:	00666666 	rsbeq	r6, r6, r6, ror #12
    5290:	5250414d 	subspl	r4, r0, #1073741843	; 0x40000013
    5294:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    5298:	20355f49 	eorscs	r5, r5, r9, asr #30
    529c:	43520035 	cmpmi	r2, #53	; 0x35
    52a0:	41425f43 	cmpmi	r2, r3, asr #30
    52a4:	30204553 	eorcc	r4, r0, r3, asr r5
    52a8:	30303478 	eorscc	r3, r0, r8, ror r4
    52ac:	30303132 	eorscc	r3, r0, r2, lsr r1
    52b0:	5f5f0030 	svcpl	0x005f0030
    52b4:	43414c55 	movtmi	r4, #7253	; 0x1c55
    52b8:	5f4d5543 	svcpl	0x004d5543
    52bc:	5f58414d 	svcpl	0x0058414d
    52c0:	5830205f 	ldmdapl	r0!, {r0, r1, r2, r3, r4, r6, sp}
    52c4:	46464646 	strbmi	r4, [r6], -r6, asr #12
    52c8:	46464646 	strbmi	r4, [r6], -r6, asr #12
    52cc:	46464646 	strbmi	r4, [r6], -r6, asr #12
    52d0:	46464646 	strbmi	r4, [r6], -r6, asr #12
    52d4:	32332d50 	eorscc	r2, r3, #80, 26	; 0x1400
    52d8:	004b4c55 	subeq	r4, fp, r5, asr ip
    52dc:	4f495047 	svcmi	0x00495047
    52e0:	646f4d5f 	strbtvs	r4, [pc], #-3423	; 52e8 <_Min_Stack_Size+0x4ee8>
    52e4:	5f5f0065 	svcpl	0x005f0065
    52e8:	52464c55 	subpl	r4, r6, #21760	; 0x5500
    52ec:	5f544341 	svcpl	0x00544341
    52f0:	5f4e494d 	svcpl	0x004e494d
    52f4:	2e30205f 	mrccs	0, 1, r2, cr0, cr15, {2}
    52f8:	524c5530 	subpl	r5, ip, #48, 10	; 0xc000000
    52fc:	445f5f00 	ldrbmi	r5, [pc], #-3840	; 5304 <_Min_Stack_Size+0x4f04>
    5300:	42495f51 	submi	r5, r9, #324	; 0x144
    5304:	5f5f5449 	svcpl	0x005f5449
    5308:	4e003020 	cdpmi	0, 0, cr3, cr0, cr0, {1}
    530c:	5f434956 	svcpl	0x00434956
    5310:	33515249 	cmpcc	r1, #-1879048188	; 0x90000004
    5314:	49445f35 	stmdbmi	r4, {r0, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    5318:	20292853 	eorcs	r2, r9, r3, asr r8
    531c:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    5320:	43495f43 	movtmi	r5, #40771	; 0x9f43
    5324:	20315245 	eorscs	r5, r1, r5, asr #4
    5328:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    532c:	333c3c31 	teqcc	ip, #12544	; 0x3100
    5330:	5f002929 	svcpl	0x00002929
    5334:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
    5338:	545f3233 	ldrbpl	r3, [pc], #-563	; 5340 <_Min_Stack_Size+0x4f40>
    533c:	5f455059 	svcpl	0x00455059
    5340:	6f6c205f 	svcvs	0x006c205f
    5344:	6920676e 	stmdbvs	r0!, {r1, r2, r3, r5, r6, r8, r9, sl, sp, lr}
    5348:	5f00746e 	svcpl	0x0000746e
    534c:	4d52415f 	ldfmie	f4, [r2, #-380]	; 0xfffffe84
    5350:	4352415f 	cmpmi	r2, #-1073741801	; 0xc0000017
    5354:	4d375f48 	ldcmi	15, cr5, [r7, #-288]!	; 0xfffffee0
    5358:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    535c:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    5360:	31445049 	cmpcc	r4, r9, asr #32
    5364:	45282033 	strmi	r2, [r8, #-51]!	; 0xffffffcd
    5368:	5f495458 	svcpl	0x00495458
    536c:	4f495047 	svcmi	0x00495047
    5370:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    5374:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    5378:	7b29745f 	blvc	a624fc <_Min_Stack_Size+0xa620fc>
    537c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    5380:	2c33315f 	ldfcss	f3, [r3], #-380	; 0xfffffe84
    5384:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    5388:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    538c:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    5390:	5f676966 	svcpl	0x00676966
    5394:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    5398:	444f4950 	strbmi	r4, [pc], #-2384	; 53a0 <_Min_Stack_Size+0x4fa0>
    539c:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    53a0:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    53a4:	33315f4e 	teqcc	r1, #312	; 0x138
    53a8:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    53ac:	4f4d5f4f 	svcmi	0x004d5f4f
    53b0:	415f4544 	cmpmi	pc, r4, asr #10
    53b4:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    53b8:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    53bc:	4f495047 	svcmi	0x00495047
    53c0:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    53c4:	5f545550 	svcpl	0x00545550
    53c8:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    53cc:	4f4e5f44 	svcmi	0x004e5f44
    53d0:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    53d4:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    53d8:	31445049 	cmpcc	r4, r9, asr #32
    53dc:	45282030 	strmi	r2, [r8, #-48]!	; 0xffffffd0
    53e0:	5f495458 	svcpl	0x00495458
    53e4:	4f495047 	svcmi	0x00495047
    53e8:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    53ec:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    53f0:	7b29745f 	blvc	a62574 <_Min_Stack_Size+0xa62174>
    53f4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    53f8:	2c30315f 	ldfcss	f3, [r0], #-380	; 0xfffffe84
    53fc:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    5400:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    5404:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    5408:	5f676966 	svcpl	0x00676966
    540c:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    5410:	444f4950 	strbmi	r4, [pc], #-2384	; 5418 <_Min_Stack_Size+0x5018>
    5414:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    5418:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    541c:	30315f4e 	eorscc	r5, r1, lr, asr #30
    5420:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    5424:	4f4d5f4f 	svcmi	0x004d5f4f
    5428:	415f4544 	cmpmi	pc, r4, asr #10
    542c:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    5430:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    5434:	4f495047 	svcmi	0x00495047
    5438:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    543c:	5f545550 	svcpl	0x00545550
    5440:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    5444:	4f4e5f44 	svcmi	0x004e5f44
    5448:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    544c:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    5450:	2820434f 	stmdacs	r0!, {r0, r1, r2, r3, r6, r8, r9, lr}
    5454:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    5458:	79545f4f 	ldmdbvc	r4, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    545c:	65646570 	strbvs	r6, [r4, #-1392]!	; 0xfffffa90
    5460:	47292a66 	strmi	r2, [r9, -r6, ror #20]!
    5464:	434f4950 	movtmi	r4, #63824	; 0xf950
    5468:	5341425f 	movtpl	r4, #4703	; 0x125f
    546c:	4e002945 	vmlsmi.f16	s4, s0, s10	; <UNPREDICTABLE>
    5470:	5f434956 	svcpl	0x00434956
    5474:	33515249 	cmpcc	r1, #-1879048188	; 0x90000004
    5478:	4e455f33 	mcrmi	15, 2, r5, cr5, cr3, {1}
    547c:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    5480:	4349564e 	movtmi	r5, #38478	; 0x964e
    5484:	4553495f 	ldrbmi	r4, [r3, #-2399]	; 0xfffff6a1
    5488:	7c203152 	stfvcs	f3, [r0], #-328	; 0xfffffeb8
    548c:	3128203d 			; <UNDEFINED> instruction: 0x3128203d
    5490:	29313c3c 	ldmdbcs	r1!, {r2, r3, r4, r5, sl, fp, ip, sp}
    5494:	564e0029 	strbpl	r0, [lr], -r9, lsr #32
    5498:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    549c:	32524553 	subscc	r4, r2, #348127232	; 0x14c00000
    54a0:	76282a20 	strtvc	r2, [r8], -r0, lsr #20
    54a4:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    54a8:	745f3233 	ldrbvc	r3, [pc], #-563	; 54b0 <_Min_Stack_Size+0x50b0>
    54ac:	4e28292a 	vmulmi.f16	s4, s16, s21	; <UNPREDICTABLE>
    54b0:	5f434956 	svcpl	0x00434956
    54b4:	45534142 	ldrbmi	r4, [r3, #-322]	; 0xfffffebe
    54b8:	3078302b 	rsbscc	r3, r8, fp, lsr #32
    54bc:	00293830 	eoreq	r3, r9, r0, lsr r8
    54c0:	54555f5f 	ldrbpl	r5, [r5], #-3935	; 0xfffff0a1
    54c4:	42495f51 	submi	r5, r9, #324	; 0x144
    54c8:	5f5f5449 	svcpl	0x005f5449
    54cc:	5f003020 	svcpl	0x00003020
    54d0:	5f41535f 	svcpl	0x0041535f
    54d4:	54494246 	strbpl	r4, [r9], #-582	; 0xfffffdba
    54d8:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    54dc:	43520035 	cmpmi	r2, #53	; 0x35
    54e0:	32495f43 	subcc	r5, r9, #268	; 0x10c
    54e4:	435f3243 	cmpmi	pc, #805306372	; 0x30000004
    54e8:	455f4b4c 	ldrbmi	r4, [pc, #-2892]	; 49a4 <_Min_Stack_Size+0x45a4>
    54ec:	2029284e 	eorcs	r2, r9, lr, asr #16
    54f0:	43435228 	movtmi	r5, #12840	; 0x3228
    54f4:	50413e2d 	subpl	r3, r1, sp, lsr #28
    54f8:	4e453142 	dvfmism	f3, f5, f2
    54fc:	3d7c2052 	ldclcc	0, cr2, [ip, #-328]!	; 0xfffffeb8
    5500:	3c312820 	ldccc	8, cr2, [r1], #-128	; 0xffffff80
    5504:	2932323c 	ldmdbcs	r2!, {r2, r3, r4, r5, r9, ip, sp}
    5508:	5f5f0029 	svcpl	0x005f0029
    550c:	33544c46 	cmpcc	r4, #17920	; 0x4600
    5510:	4d5f5832 	ldclmi	8, cr5, [pc, #-200]	; 5450 <_Min_Stack_Size+0x5050>
    5514:	5f5f5841 	svcpl	0x005f5841
    5518:	372e3120 	strcc	r3, [lr, -r0, lsr #2]!
    551c:	39363739 	ldmdbcc	r6!, {r0, r3, r4, r5, r8, r9, sl, ip, sp}
    5520:	34333133 	ldrtcc	r3, [r3], #-307	; 0xfffffecd
    5524:	33323638 	teqcc	r2, #56, 12	; 0x3800000
    5528:	65373531 	ldrvs	r3, [r7, #-1329]!	; 0xfffffacf
    552c:	3830332b 	ldmdacc	r0!, {r0, r1, r3, r5, r8, r9, ip, sp}
    5530:	78323346 	ldmdavc	r2!, {r1, r2, r6, r8, r9, ip, sp}
    5534:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    5538:	3233544c 	eorscc	r5, r3, #76, 8	; 0x4c000000
    553c:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    5540:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    5544:	3537312e 	ldrcc	r3, [r7, #-302]!	; 0xfffffed2
    5548:	33343934 	teqcc	r4, #52, 18	; 0xd0000
    554c:	32383035 	eorscc	r3, r8, #53	; 0x35
    5550:	37383232 			; <UNDEFINED> instruction: 0x37383232
    5554:	332d6535 			; <UNDEFINED> instruction: 0x332d6535
    5558:	32334638 	eorscc	r4, r3, #56, 12	; 0x3800000
    555c:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    5560:	31415049 	cmpcc	r1, r9, asr #32
    5564:	45282030 	strmi	r2, [r8, #-48]!	; 0xffffffd0
    5568:	5f495458 	svcpl	0x00495458
    556c:	4f495047 	svcmi	0x00495047
    5570:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    5574:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    5578:	7b29745f 	blvc	a626fc <_Min_Stack_Size+0xa622fc>
    557c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    5580:	2c30315f 	ldfcss	f3, [r0], #-380	; 0xfffffe84
    5584:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    5588:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    558c:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    5590:	5f676966 	svcpl	0x00676966
    5594:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    5598:	414f4950 	cmpmi	pc, r0, asr r9	; <UNPREDICTABLE>
    559c:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    55a0:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    55a4:	30315f4e 	eorscc	r5, r1, lr, asr #30
    55a8:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    55ac:	4f4d5f4f 	svcmi	0x004d5f4f
    55b0:	415f4544 	cmpmi	pc, r4, asr #10
    55b4:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    55b8:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    55bc:	4f495047 	svcmi	0x00495047
    55c0:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    55c4:	5f545550 	svcpl	0x00545550
    55c8:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    55cc:	4f4e5f44 	svcmi	0x004e5f44
    55d0:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    55d4:	545f5f00 	ldrbpl	r5, [pc], #-3840	; 55dc <_Min_Stack_Size+0x51dc>
    55d8:	424d5548 	submi	r5, sp, #72, 10	; 0x12000000
    55dc:	5f5f4c45 	svcpl	0x005f4c45
    55e0:	45003120 	strmi	r3, [r0, #-288]	; 0xfffffee0
    55e4:	39495458 	stmdbcc	r9, {r3, r4, r6, sl, ip, lr}^
    55e8:	495f355f 	ldmdbmi	pc, {r0, r1, r2, r3, r4, r6, r8, sl, ip, sp}^	; <UNPREDICTABLE>
    55ec:	61485152 	cmpvs	r8, r2, asr r1
    55f0:	656c646e 	strbvs	r6, [ip, #-1134]!	; 0xfffffb92
    55f4:	49540072 	ldmdbmi	r4, {r1, r4, r5, r6}^
    55f8:	2820344d 	stmdacs	r0!, {r0, r2, r3, r6, sl, ip, sp}
    55fc:	54504728 	ldrbpl	r4, [r0], #-1832	; 0xfffff8d8
    5600:	79545f4d 	ldmdbvc	r4, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    5604:	65646570 	strbvs	r6, [r4, #-1392]!	; 0xfffffa90
    5608:	54292a66 	strtpl	r2, [r9], #-2662	; 0xfffff59a
    560c:	5f344d49 	svcpl	0x00344d49
