mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    5610:	45534142 	ldrbmi	r4, [r3, #-322]	; 0xfffffebe
    5614:	5f5f0029 	svcpl	0x005f0029
    5618:	495f5151 	ldmdbmi	pc, {r0, r4, r6, r8, ip, lr}^	; <UNPREDICTABLE>
    561c:	5f544942 	svcpl	0x00544942
    5620:	0030205f 	eorseq	r2, r0, pc, asr r0
    5624:	4c4c5f5f 	mcrrmi	15, 5, r5, ip, cr15
    5628:	55434341 	strbpl	r4, [r3, #-833]	; 0xfffffcbf
    562c:	42465f4d 	submi	r5, r6, #308	; 0x134
    5630:	5f5f5449 	svcpl	0x005f5449
    5634:	00313320 	eorseq	r3, r1, r0, lsr #6
    5638:	53555f5f 	cmppl	r5, #380	; 0x17c
    563c:	42495f51 	submi	r5, r9, #324	; 0x144
    5640:	5f5f5449 	svcpl	0x005f5449
    5644:	5f003020 	svcpl	0x00003020
    5648:	554e475f 	strbpl	r4, [lr, #-1887]	; 0xfffff8a1
    564c:	494d5f43 	stmdbmi	sp, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    5650:	5f524f4e 	svcpl	0x00524f4e
    5654:	0033205f 	eorseq	r2, r3, pc, asr r0
    5658:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    565c:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	; 0x4e
    5660:	54534145 	ldrbpl	r4, [r3], #-325	; 0xfffffebb
    5664:	545f3233 	ldrbpl	r3, [pc], #-563	; 566c <_Min_Stack_Size+0x526c>
    5668:	5f455059 	svcpl	0x00455059
    566c:	6f6c205f 	svcvs	0x006c205f
    5670:	7520676e 	strvc	r6, [r0, #-1902]!	; 0xfffff892
    5674:	6769736e 	strbvs	r7, [r9, -lr, ror #6]!
    5678:	2064656e 	rsbcs	r6, r4, lr, ror #10
    567c:	00746e69 	rsbseq	r6, r4, r9, ror #28
    5680:	52415f5f 	subpl	r5, r1, #380	; 0x17c
    5684:	45465f4d 	strbmi	r5, [r6, #-3917]	; 0xfffff0b3
    5688:	52555441 	subspl	r5, r5, #1090519040	; 0x41000000
    568c:	554e5f45 	strbpl	r5, [lr, #-3909]	; 0xfffff0bb
    5690:	4952454d 	ldmdbmi	r2, {r0, r2, r3, r6, r8, sl, lr}^
    5694:	414d5f43 	cmpmi	sp, r3, asr #30
    5698:	4e494d58 	mcrmi	13, 2, r4, cr9, cr8, {2}
    569c:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	; <UNPREDICTABLE>
    56a0:	414d544e 	cmpmi	sp, lr, asr #8
    56a4:	59545f58 	ldmdbpl	r4, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    56a8:	5f5f4550 	svcpl	0x005f4550
    56ac:	6e6f6c20 	cdpvs	12, 6, cr6, cr15, cr0, {1}
    56b0:	6f6c2067 	svcvs	0x006c2067
    56b4:	6920676e 	stmdbvs	r0!, {r1, r2, r3, r5, r6, r8, r9, sl, sp, lr}
    56b8:	4700746e 	strmi	r7, [r0, -lr, ror #8]
    56bc:	5f4f4950 	svcpl	0x004f4950
    56c0:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    56c4:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    56c8:	5f545550 	svcpl	0x00545550
    56cc:	34205050 	strtcc	r5, [r0], #-80	; 0xffffffb0
    56d0:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    56d4:	2820414f 	stmdacs	r0!, {r0, r1, r2, r3, r6, r8, lr}
    56d8:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    56dc:	79545f4f 	ldmdbvc	r4, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    56e0:	65646570 	strbvs	r6, [r4, #-1392]!	; 0xfffffa90
    56e4:	47292a66 	strmi	r2, [r9, -r6, ror #20]!
    56e8:	414f4950 	cmpmi	pc, r0, asr r9	; <UNPREDICTABLE>
    56ec:	5341425f 	movtpl	r4, #4703	; 0x125f
    56f0:	5f002945 	svcpl	0x00002945
    56f4:	4343475f 	movtmi	r4, #14175	; 0x375f
    56f8:	4f54415f 	svcmi	0x0054415f
    56fc:	5f43494d 	svcpl	0x0043494d
    5700:	5f544e49 	svcpl	0x00544e49
    5704:	4b434f4c 	blmi	10d943c <_Min_Stack_Size+0x10d903c>
    5708:	4552465f 	ldrbmi	r4, [r2, #-1631]	; 0xfffff9a1
    570c:	00322045 	eorseq	r2, r2, r5, asr #32
    5710:	46535f5f 	usaxmi	r5, r3, pc	; <UNPREDICTABLE>
    5714:	54434152 	strbpl	r4, [r3], #-338	; 0xfffffeae
    5718:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    571c:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    5720:	352e302d 	strcc	r3, [lr, #-45]!	; 0xffffffd3
    5724:	302d5248 	eorcc	r5, sp, r8, asr #4
    5728:	5248352e 	subpl	r3, r8, #192937984	; 0xb800000
    572c:	5f5f0029 	svcpl	0x005f0029
    5730:	5f4d5241 	svcpl	0x004d5241
    5734:	54414546 	strbpl	r4, [r1], #-1350	; 0xfffffaba
    5738:	5f455255 	svcpl	0x00455255
    573c:	36315046 	ldrtcc	r5, [r1], -r6, asr #32
    5740:	4143535f 	cmpmi	r3, pc, asr r3
    5744:	5f52414c 	svcpl	0x0052414c
    5748:	54495241 	strbpl	r5, [r9], #-577	; 0xfffffdbf
    574c:	54454d48 	strbpl	r4, [r5], #-3400	; 0xfffff2b8
    5750:	5f004349 	svcpl	0x00004349
    5754:	4153555f 	cmpmi	r3, pc, asr r5
    5758:	4d554343 	ldclmi	3, cr4, [r5, #-268]	; 0xfffffef4
    575c:	5350455f 	cmppl	r0, #398458880	; 0x17c00000
    5760:	4e4f4c49 	cdpmi	12, 4, cr4, cr15, cr9, {2}
    5764:	30205f5f 	eorcc	r5, r0, pc, asr pc
    5768:	2d503178 	ldfcse	f3, [r0, #-480]	; 0xfffffe20
    576c:	4b485538 	blmi	121ac54 <_Min_Stack_Size+0x121a854>
    5770:	445f5f00 	ldrbmi	r5, [pc], #-3840	; 5778 <_Min_Stack_Size+0x5378>
    5774:	485f4c42 	ldmdami	pc, {r1, r6, sl, fp, lr}^	; <UNPREDICTABLE>
    5778:	515f5341 	cmppl	pc, r1, asr #6
    577c:	54454955 	strbpl	r4, [r5], #-2389	; 0xfffff6ab
    5780:	4e414e5f 	mcrmi	14, 2, r4, cr1, cr15, {2}
    5784:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    5788:	414c5000 	mrsmi	r5, (UNDEF: 76)
    578c:	524f4654 	subpl	r4, pc, #84, 12	; 0x5400000
    5790:	59545f4d 	ldmdbpl	r4, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    5794:	5f534550 	svcpl	0x00534550
    5798:	00205f48 	eoreq	r5, r0, r8, asr #30
    579c:	4c4c5f5f 	mcrrmi	15, 5, r5, ip, cr15
    57a0:	43415246 	movtmi	r5, #4678	; 0x1246
    57a4:	414d5f54 	cmpmi	sp, r4, asr pc
    57a8:	205f5f58 	subscs	r5, pc, r8, asr pc	; <UNPREDICTABLE>
    57ac:	46375830 			; <UNDEFINED> instruction: 0x46375830
    57b0:	46464646 	strbmi	r4, [r6], -r6, asr #12
    57b4:	46464646 	strbmi	r4, [r6], -r6, asr #12
    57b8:	46464646 	strbmi	r4, [r6], -r6, asr #12
    57bc:	2d504646 	ldclcs	6, cr4, [r0, #-280]	; 0xfffffee8
    57c0:	4c4c3336 	mcrrmi	3, 3, r3, ip, cr6
    57c4:	5f5f0052 	svcpl	0x005f0052
    57c8:	31434544 	cmpcc	r3, r4, asr #10
    57cc:	4d5f3832 	ldclmi	8, cr3, [pc, #-200]	; 570c <_Min_Stack_Size+0x530c>
    57d0:	455f5841 	ldrbmi	r5, [pc, #-2113]	; 4f97 <_Min_Stack_Size+0x4b97>
    57d4:	5f5f5058 	svcpl	0x005f5058
    57d8:	34313620 	ldrtcc	r3, [r1], #-1568	; 0xfffff9e0
    57dc:	52530035 	subspl	r0, r3, #53	; 0x35
    57e0:	4d5f4d41 	ldclmi	13, cr4, [pc, #-260]	; 56e4 <_Min_Stack_Size+0x52e4>
    57e4:	524f4d45 	subpl	r4, pc, #4416	; 0x1140
    57e8:	41425f59 	cmpmi	r2, r9, asr pc
    57ec:	30204553 	eorcc	r4, r0, r3, asr r5
    57f0:	30303278 	eorscc	r3, r0, r8, ror r2
    57f4:	30303030 	eorscc	r3, r0, r0, lsr r0
    57f8:	43520030 	cmpmi	r2, #48	; 0x30
    57fc:	53555f43 	cmppl	r5, #268	; 0x10c
    5800:	33545241 	cmpcc	r4, #268435460	; 0x10000004
    5804:	4b4c435f 	blmi	1316588 <_Min_Stack_Size+0x1316188>
    5808:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
    580c:	52282029 	eorpl	r2, r8, #41	; 0x29
    5810:	3e2d4343 	cdpcc	3, 2, cr4, cr13, cr3, {2}
    5814:	31425041 	cmpcc	r2, r1, asr #32
    5818:	20524e45 	subscs	r4, r2, r5, asr #28
    581c:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    5820:	313c3c31 	teqcc	ip, r1, lsr ip
    5824:	00292938 	eoreq	r2, r9, r8, lsr r9
    5828:	344d4954 	strbcc	r4, [sp], #-2388	; 0xfffff6ac
    582c:	5341425f 	movtpl	r4, #4703	; 0x125f
    5830:	78302045 	ldmdavc	r0!, {r0, r2, r6, sp}
    5834:	30303034 	eorscc	r3, r0, r4, lsr r0
    5838:	30303830 	eorscc	r3, r0, r0, lsr r8
    583c:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	; <UNPREDICTABLE>
    5840:	5450544e 	ldrbpl	r5, [r0], #-1102	; 0xfffffbb2
    5844:	59545f52 	ldmdbpl	r4, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    5848:	5f5f4550 	svcpl	0x005f4550
    584c:	746e6920 	strbtvc	r6, [lr], #-2336	; 0xfffff6e0
    5850:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 4958 <_Min_Stack_Size+0x4558>
    5854:	50544e49 	subspl	r4, r4, r9, asr #28
    5858:	545f5254 	ldrbpl	r5, [pc], #-596	; 5860 <_Min_Stack_Size+0x5460>
    585c:	5f455059 	svcpl	0x00455059
    5860:	6e75205f 	mrcvs	0, 3, r2, cr5, cr15, {2}
    5864:	6e676973 			; <UNDEFINED> instruction: 0x6e676973
    5868:	69206465 	stmdbvs	r0!, {r0, r2, r5, r6, sl, sp, lr}
    586c:	5f00746e 	svcpl	0x0000746e
    5870:	4745525f 	smlsldmi	r5, r5, pc, r2	; <UNPREDICTABLE>
    5874:	45545349 	ldrbmi	r5, [r4, #-841]	; 0xfffffcb7
    5878:	52505f52 	subspl	r5, r0, #328	; 0x148
    587c:	58494645 	stmdapl	r9, {r0, r2, r6, r9, sl, lr}^
    5880:	00205f5f 	eoreq	r5, r0, pc, asr pc
    5884:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    5888:	5f323354 	svcpl	0x00323354
    588c:	5f58414d 	svcpl	0x0058414d
    5890:	2e33205f 	mrccs	0, 1, r2, cr3, cr15, {2}
    5894:	38323034 	ldmdacc	r2!, {r2, r4, r5, ip, sp}
    5898:	36343332 			; <UNDEFINED> instruction: 0x36343332
    589c:	35383336 	ldrcc	r3, [r8, #-822]!	; 0xfffffcca
    58a0:	36383832 			; <UNDEFINED> instruction: 0x36383832
    58a4:	38332b65 	ldmdacc	r3!, {r0, r2, r5, r6, r8, r9, fp, sp}
    58a8:	00323346 	eorseq	r3, r2, r6, asr #6
    58ac:	42445f5f 	submi	r5, r4, #380	; 0x17c
    58b0:	49445f4c 	stmdbmi	r4, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    58b4:	205f5f47 	subscs	r5, pc, r7, asr #30
    58b8:	5f003531 	svcpl	0x00003531
    58bc:	464c555f 			; <UNDEFINED> instruction: 0x464c555f
    58c0:	54434152 	strbpl	r4, [r3], #-338	; 0xfffffeae
    58c4:	5350455f 	cmppl	r0, #398458880	; 0x17c00000
    58c8:	4e4f4c49 	cdpmi	12, 4, cr4, cr15, cr9, {2}
    58cc:	30205f5f 	eorcc	r5, r0, pc, asr pc
    58d0:	2d503178 	ldfcse	f3, [r0, #-480]	; 0xfffffe20
    58d4:	4c553233 	lfmmi	f3, 2, [r5], {51}	; 0x33
    58d8:	5f5f0052 	svcpl	0x005f0052
    58dc:	455a4953 	ldrbmi	r4, [sl, #-2387]	; 0xfffff6ad
    58e0:	535f464f 	cmppl	pc, #82837504	; 0x4f00000
    58e4:	5f455a49 	svcpl	0x00455a49
    58e8:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
    58ec:	5f5f0034 	svcpl	0x005f0034
    58f0:	544e4955 	strbpl	r4, [lr], #-2389	; 0xfffff6ab
    58f4:	545f3436 	ldrbpl	r3, [pc], #-1078	; 58fc <_Min_Stack_Size+0x54fc>
    58f8:	5f455059 	svcpl	0x00455059
    58fc:	6f6c205f 	svcvs	0x006c205f
    5900:	6c20676e 	stcvs	7, cr6, [r0], #-440	; 0xfffffe48
    5904:	20676e6f 	rsbcs	r6, r7, pc, ror #28
    5908:	69736e75 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, sl, fp, sp, lr}^
    590c:	64656e67 	strbtvs	r6, [r5], #-3687	; 0xfffff199
    5910:	746e6920 	strbtvc	r6, [lr], #-2336	; 0xfffff6e0
    5914:	445f5f00 	ldrbmi	r5, [pc], #-3840	; 591c <_Min_Stack_Size+0x551c>
    5918:	32314345 	eorscc	r4, r1, #335544321	; 0x14000001
    591c:	494d5f38 	stmdbmi	sp, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    5920:	205f5f4e 	subscs	r5, pc, lr, asr #30
    5924:	362d4531 			; <UNDEFINED> instruction: 0x362d4531
    5928:	44333431 	ldrtmi	r3, [r3], #-1073	; 0xfffffbcf
    592c:	5f5f004c 	svcpl	0x005f004c
    5930:	36544e49 	ldrbcc	r4, [r4], -r9, asr #28
    5934:	28435f34 	stmdacs	r3, {r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    5938:	63202963 			; <UNDEFINED> instruction: 0x63202963
    593c:	20232320 	eorcs	r2, r3, r0, lsr #6
    5940:	5f004c4c 	svcpl	0x00004c4c
    5944:	42444c5f 	submi	r4, r4, #24320	; 0x5f00
    5948:	494d5f4c 	stmdbmi	sp, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    594c:	30315f4e 	eorscc	r5, r1, lr, asr #30
    5950:	5058455f 	subspl	r4, r8, pc, asr r5
    5954:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    5958:	3730332d 	ldrcc	r3, [r0, -sp, lsr #6]!
    595c:	50470029 	subpl	r0, r7, r9, lsr #32
    5960:	505f4f49 	subspl	r4, pc, r9, asr #30
    5964:	315f4e49 	cmpcc	pc, r9, asr #28
    5968:	28282034 	stmdacs	r8!, {r2, r4, r5, sp}
    596c:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    5970:	745f3631 	ldrbvc	r3, [pc], #-1585	; 5978 <_Min_Stack_Size+0x5578>
    5974:	34783029 	ldrbtcc	r3, [r8], #-41	; 0xffffffd7
    5978:	29303030 	ldmdbcs	r0!, {r4, r5, ip, sp}
    597c:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    5980:	52495f43 	subpl	r5, r9, #268	; 0x10c
    5984:	5f383251 	svcpl	0x00383251
    5988:	28534944 	ldmdacs	r3, {r2, r6, r8, fp, lr}^
    598c:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    5990:	5f434956 	svcpl	0x00434956
    5994:	52454349 	subpl	r4, r5, #603979777	; 0x24000001
    5998:	3d7c2030 	ldclcc	0, cr2, [ip, #-192]!	; 0xffffff40
    599c:	3c312820 	ldccc	8, cr2, [r1], #-128	; 0xffffff80
    59a0:	2938323c 	ldmdbcs	r8!, {r2, r3, r4, r5, r9, ip, sp}
    59a4:	50470029 	subpl	r0, r7, r9, lsr #32
    59a8:	5f414f49 	svcpl	0x00414f49
    59ac:	45534142 	ldrbmi	r4, [r3, #-322]	; 0xfffffebe
    59b0:	34783020 	ldrbtcc	r3, [r8], #-32	; 0xffffffe0
    59b4:	30313030 	eorscc	r3, r1, r0, lsr r0
    59b8:	00303038 	eorseq	r3, r0, r8, lsr r0
    59bc:	444c5f5f 	strbmi	r5, [ip], #-3935	; 0xfffff0a1
    59c0:	4d5f4c42 	ldclmi	12, cr4, [pc, #-264]	; 58c0 <_Min_Stack_Size+0x54c0>
    59c4:	5f5f4e49 	svcpl	0x005f4e49
    59c8:	322e3220 	eorcc	r3, lr, #32, 4
    59cc:	37303532 			; <UNDEFINED> instruction: 0x37303532
    59d0:	38353833 	ldmdacc	r5!, {r0, r1, r4, r5, fp, ip, sp}
    59d4:	32373035 	eorscc	r3, r7, #53	; 0x35
    59d8:	65343130 	ldrvs	r3, [r4, #-304]!	; 0xfffffed0
    59dc:	3830332d 	ldmdacc	r0!, {r0, r2, r3, r5, r8, r9, ip, sp}
    59e0:	5f5f004c 	svcpl	0x005f004c
    59e4:	55434341 	strbpl	r4, [r3, #-833]	; 0xfffffcbf
    59e8:	42495f4d 	submi	r5, r9, #308	; 0x134
    59ec:	5f5f5449 	svcpl	0x005f5449
    59f0:	00363120 	eorseq	r3, r6, r0, lsr #2
    59f4:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    59f8:	3631544e 	ldrtcc	r5, [r1], -lr, asr #8
    59fc:	6328435f 			; <UNDEFINED> instruction: 0x6328435f
    5a00:	00632029 	rsbeq	r2, r3, r9, lsr #32
    5a04:	44555f5f 	ldrbmi	r5, [r5], #-3935	; 0xfffff0a1
    5a08:	42495f41 	submi	r5, r9, #260	; 0x104
    5a0c:	5f5f5449 	svcpl	0x005f5449
    5a10:	00323320 	eorseq	r3, r2, r0, lsr #6
    5a14:	4f4e5f5f 	svcmi	0x004e5f5f
    5a18:	4c4e495f 	mcrrmi	9, 5, r4, lr, cr15	; <UNPREDICTABLE>
    5a1c:	5f454e49 	svcpl	0x00454e49
    5a20:	0031205f 	eorseq	r2, r1, pc, asr r0
    5a24:	4f495047 	svcmi	0x00495047
    5a28:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    5a2c:	2820375f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, ip, sp}
    5a30:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    5a34:	5f363174 	svcpl	0x00363174
    5a38:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    5a3c:	30383030 	eorscc	r3, r8, r0, lsr r0
    5a40:	5f5f0029 	svcpl	0x005f0029
    5a44:	4d4f5441 	cfstrdmi	mvd5, [pc, #-260]	; 5948 <_Min_Stack_Size+0x5548>
    5a48:	525f4349 	subspl	r4, pc, #603979777	; 0x24000001
    5a4c:	58414c45 	stmdapl	r1, {r0, r2, r6, sl, fp, lr}^
    5a50:	30204445 	eorcc	r4, r0, r5, asr #8
    5a54:	445f5f00 	ldrbmi	r5, [pc], #-3840	; 5a5c <_Min_Stack_Size+0x565c>
    5a58:	485f4c42 	ldmdami	pc, {r1, r6, sl, fp, lr}^	; <UNPREDICTABLE>
    5a5c:	495f5341 	ldmdbmi	pc, {r0, r6, r8, r9, ip, lr}^	; <UNPREDICTABLE>
    5a60:	4e49464e 	cdpmi	6, 4, cr4, cr9, cr14, {2}
    5a64:	5f595449 	svcpl	0x00595449
    5a68:	0031205f 	eorseq	r2, r1, pc, asr r0
    5a6c:	49535f5f 	ldmdbmi	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    5a70:	54415f47 	strbpl	r5, [r1], #-3911	; 0xfffff0b9
    5a74:	43494d4f 	movtmi	r4, #40271	; 0x9d4f
    5a78:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    5a7c:	30205f5f 	eorcc	r5, r0, pc, asr pc
    5a80:	66663778 			; <UNDEFINED> instruction: 0x66663778
    5a84:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    5a88:	5f5f0066 	svcpl	0x005f0066
    5a8c:	36544c46 	ldrbcc	r4, [r4], -r6, asr #24
    5a90:	414d5f34 	cmpmi	sp, r4, lsr pc
    5a94:	445f544e 	ldrbmi	r5, [pc], #-1102	; 5a9c <_Min_Stack_Size+0x569c>
    5a98:	5f5f4749 	svcpl	0x005f4749
    5a9c:	00333520 	eorseq	r3, r3, r0, lsr #10
    5aa0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    5aa4:	20314550 	eorscs	r4, r1, r0, asr r5
    5aa8:	54584528 	ldrbpl	r4, [r8], #-1320	; 0xfffffad8
    5aac:	50475f49 	subpl	r5, r7, r9, asr #30
    5ab0:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 5994 <_Min_Stack_Size+0x5594>
    5ab4:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
    5ab8:	745f676e 	ldrbvc	r6, [pc], #-1902	; 5ac0 <_Min_Stack_Size+0x56c0>
    5abc:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
    5ac0:	315f4954 	cmpcc	pc, r4, asr r9	; <UNPREDICTABLE>
    5ac4:	4728202c 	strmi	r2, [r8, -ip, lsr #32]!
    5ac8:	5f4f4950 	svcpl	0x004f4950
    5acc:	436e6950 	cmnmi	lr, #80, 18	; 0x140000
    5ad0:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    5ad4:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    5ad8:	4950477b 	ldmdbmi	r0, {r0, r1, r3, r4, r5, r6, r8, r9, sl, lr}^
    5adc:	472c454f 	strmi	r4, [ip, -pc, asr #10]!
    5ae0:	5f4f4950 	svcpl	0x004f4950
    5ae4:	5f4e4950 	svcpl	0x004e4950
    5ae8:	50472c31 	subpl	r2, r7, r1, lsr ip
    5aec:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 59d0 <_Min_Stack_Size+0x55d0>
    5af0:	5f45444f 	svcpl	0x0045444f
    5af4:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    5af8:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    5afc:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    5b00:	554f5f4f 	strbpl	r5, [pc, #-3919]	; 4bb9 <_Min_Stack_Size+0x47b9>
    5b04:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    5b08:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    5b0c:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    5b10:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    5b14:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
    5b18:	45504954 	ldrbmi	r4, [r0, #-2388]	; 0xfffff6ac
    5b1c:	45282030 	strmi	r2, [r8, #-48]!	; 0xffffffd0
    5b20:	5f495458 	svcpl	0x00495458
    5b24:	4f495047 	svcmi	0x00495047
    5b28:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    5b2c:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    5b30:	7b29745f 	blvc	a62cb4 <_Min_Stack_Size+0xa628b4>
    5b34:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    5b38:	202c305f 	eorcs	r3, ip, pc, asr r0
    5b3c:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    5b40:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    5b44:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    5b48:	5f676966 	svcpl	0x00676966
    5b4c:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    5b50:	454f4950 	strbmi	r4, [pc, #-2384]	; 5208 <_Min_Stack_Size+0x4e08>
    5b54:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    5b58:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    5b5c:	2c305f4e 	ldccs	15, cr5, [r0], #-312	; 0xfffffec8
    5b60:	4f495047 	svcmi	0x00495047
    5b64:	444f4d5f 	strbmi	r4, [pc], #-3423	; 5b6c <_Min_Stack_Size+0x576c>
    5b68:	46415f45 	strbmi	r5, [r1], -r5, asr #30
    5b6c:	504e495f 	subpl	r4, lr, pc, asr r9
    5b70:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
    5b74:	5f4f4950 	svcpl	0x004f4950
    5b78:	5054554f 	subspl	r5, r4, pc, asr #10
    5b7c:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    5b80:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
    5b84:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    5b88:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    5b8c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    5b90:	52495f33 	subpl	r5, r9, #51, 30	; 0xcc
    5b94:	6e614851 	mcrvs	8, 3, r4, cr1, cr1, {2}
    5b98:	72656c64 	rsbvc	r6, r5, #100, 24	; 0x6400
    5b9c:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    5ba0:	31425049 	cmpcc	r2, r9, asr #32
    5ba4:	45282030 	strmi	r2, [r8, #-48]!	; 0xffffffd0
    5ba8:	5f495458 	svcpl	0x00495458
    5bac:	4f495047 	svcmi	0x00495047
    5bb0:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    5bb4:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    5bb8:	7b29745f 	blvc	a62d3c <_Min_Stack_Size+0xa6293c>
    5bbc:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    5bc0:	2c30315f 	ldfcss	f3, [r0], #-380	; 0xfffffe84
    5bc4:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    5bc8:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    5bcc:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    5bd0:	5f676966 	svcpl	0x00676966
    5bd4:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    5bd8:	424f4950 	submi	r4, pc, #80, 18	; 0x140000
    5bdc:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    5be0:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    5be4:	30315f4e 	eorscc	r5, r1, lr, asr #30
    5be8:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    5bec:	4f4d5f4f 	svcmi	0x004d5f4f
    5bf0:	415f4544 	cmpmi	pc, r4, asr #10
    5bf4:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    5bf8:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    5bfc:	4f495047 	svcmi	0x00495047
    5c00:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    5c04:	5f545550 	svcpl	0x00545550
    5c08:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    5c0c:	4f4e5f44 	svcmi	0x004e5f44
    5c10:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    5c14:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 4d1c <_Min_Stack_Size+0x491c>
    5c18:	5f534553 	svcpl	0x00534553
    5c1c:	54494e49 	strbpl	r4, [r9], #-3657	; 0xfffff1b7
    5c20:	494e4946 	stmdbmi	lr, {r1, r2, r6, r8, fp, lr}^
    5c24:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    5c28:	445f5f00 	ldrbmi	r5, [pc], #-3840	; 5c30 <_Min_Stack_Size+0x5830>
    5c2c:	34364345 	ldrtcc	r4, [r6], #-837	; 0xfffffcbb
    5c30:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    5c34:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    5c38:	38332d45 	ldmdacc	r3!, {r0, r2, r6, r8, sl, fp, sp}
    5c3c:	00444433 	subeq	r4, r4, r3, lsr r4
    5c40:	4349564e 	movtmi	r5, #38478	; 0x964e
    5c44:	5152495f 	cmppl	r2, pc, asr r9
    5c48:	455f3031 	ldrbmi	r3, [pc, #-49]	; 5c1f <_Min_Stack_Size+0x581f>
    5c4c:	2029284e 	eorcs	r2, r9, lr, asr #16
    5c50:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    5c54:	53495f43 	movtpl	r5, #40771	; 0x9f43
    5c58:	20305245 	eorscs	r5, r0, r5, asr #4
    5c5c:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    5c60:	313c3c31 	teqcc	ip, r1, lsr ip
    5c64:	00292930 	eoreq	r2, r9, r0, lsr r9
    5c68:	4349564e 	movtmi	r5, #38478	; 0x964e
    5c6c:	4241495f 	submi	r4, r1, #1556480	; 0x17c000
    5c70:	2a203052 	bcs	811dc0 <_Min_Stack_Size+0x8119c0>
    5c74:	69757628 	ldmdbvs	r5!, {r3, r5, r9, sl, ip, sp, lr}^
    5c78:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    5c7c:	292a745f 	stmdbcs	sl!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    5c80:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    5c84:	41425f43 	cmpmi	r2, r3, asr #30
    5c88:	302b4553 	eorcc	r4, fp, r3, asr r5
    5c8c:	30303278 	eorscc	r3, r0, r8, ror r2
    5c90:	58450029 	stmdapl	r5, {r0, r3, r5}^
    5c94:	44504954 	ldrbmi	r4, [r0], #-2388	; 0xfffff6ac
    5c98:	45282030 	strmi	r2, [r8, #-48]!	; 0xffffffd0
    5c9c:	5f495458 	svcpl	0x00495458
    5ca0:	4f495047 	svcmi	0x00495047
    5ca4:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    5ca8:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    5cac:	7b29745f 	blvc	a62e30 <_Min_Stack_Size+0xa62a30>
    5cb0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    5cb4:	202c305f 	eorcs	r3, ip, pc, asr r0
    5cb8:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    5cbc:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    5cc0:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    5cc4:	5f676966 	svcpl	0x00676966
    5cc8:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    5ccc:	444f4950 	strbmi	r4, [pc], #-2384	; 5cd4 <_Min_Stack_Size+0x58d4>
    5cd0:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    5cd4:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    5cd8:	2c305f4e 	ldccs	15, cr5, [r0], #-312	; 0xfffffec8
    5cdc:	4f495047 	svcmi	0x00495047
    5ce0:	444f4d5f 	strbmi	r4, [pc], #-3423	; 5ce8 <_Min_Stack_Size+0x58e8>
    5ce4:	46415f45 	strbmi	r5, [r1], -r5, asr #30
    5ce8:	504e495f 	subpl	r4, lr, pc, asr r9
    5cec:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
    5cf0:	5f4f4950 	svcpl	0x004f4950
    5cf4:	5054554f 	subspl	r5, r4, pc, asr #10
    5cf8:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    5cfc:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
    5d00:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    5d04:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    5d08:	5f434352 	svcpl	0x00434352
    5d0c:	4f494641 	svcmi	0x00494641
    5d10:	4b4c435f 	blmi	1316a94 <_Min_Stack_Size+0x1316694>
    5d14:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
