mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    5d18:	52282029 	eorpl	r2, r8, #41	; 0x29
    5d1c:	3e2d4343 	cdpcc	3, 2, cr4, cr13, cr3, {2}
    5d20:	32425041 	subcc	r5, r2, #65	; 0x41
    5d24:	20524e45 	subscs	r4, r2, r5, asr #28
    5d28:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    5d2c:	303c3c31 	eorscc	r3, ip, r1, lsr ip
    5d30:	47002929 	strmi	r2, [r0, -r9, lsr #18]
    5d34:	5f4f4950 	svcpl	0x004f4950
    5d38:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    5d3c:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    5d40:	5f545550 	svcpl	0x00545550
    5d44:	3520444f 	strcc	r4, [r0, #-1103]!	; 0xfffffbb1
    5d48:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    5d4c:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    5d50:	35315f4e 	ldrcc	r5, [r1, #-3918]!	; 0xfffff0b2
    5d54:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    5d58:	31746e69 	cmncc	r4, r9, ror #28
    5d5c:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    5d60:	30387830 	eorscc	r7, r8, r0, lsr r8
    5d64:	00293030 	eoreq	r3, r9, r0, lsr r0
    5d68:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    5d6c:	49575f54 	ldmdbmi	r7, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    5d70:	5f485444 	svcpl	0x00485444
    5d74:	3233205f 	eorscc	r2, r3, #95	; 0x5f
    5d78:	41434d00 	cmpmi	r3, r0, lsl #26
    5d7c:	58455f4c 	stmdapl	r5, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    5d80:	445f4954 	ldrbmi	r4, [pc], #-2388	; 5d88 <_Min_Stack_Size+0x5988>
    5d84:	696e4965 	stmdbvs	lr!, {r0, r2, r5, r6, r8, fp, lr}^
    5d88:	46410074 			; <UNDEFINED> instruction: 0x46410074
    5d8c:	455f4f49 	ldrbmi	r4, [pc, #-3913]	; 4e4b <_Min_Stack_Size+0x4a4b>
    5d90:	43495458 	movtmi	r5, #37976	; 0x9458
    5d94:	6e695f52 	mcrvs	15, 3, r5, cr9, cr2, {2}
    5d98:	00786564 	rsbseq	r6, r8, r4, ror #10
    5d9c:	52525342 	subspl	r5, r2, #134217729	; 0x8000001
    5da0:	54455300 	strbpl	r5, [r5], #-768	; 0xfffffd00
    5da4:	5449425f 	strbpl	r4, [r9], #-607	; 0xfffffda1
    5da8:	47455228 	strbmi	r5, [r5, -r8, lsr #4]
    5dac:	5449422c 	strbpl	r4, [r9], #-556	; 0xfffffdd4
    5db0:	20294f4e 	eorcs	r4, r9, lr, asr #30
    5db4:	47455228 	strbmi	r5, [r5, -r8, lsr #4]
    5db8:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    5dbc:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    5dc0:	4e544942 	vnmlami.f16	s9, s8, s4	; <UNPREDICTABLE>
    5dc4:	0029294f 	eoreq	r2, r9, pc, asr #18
    5dc8:	49535f5f 	ldmdbmi	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    5dcc:	54415f47 	strbpl	r5, [r1], #-3911	; 0xfffff0b9
    5dd0:	43494d4f 	movtmi	r4, #40271	; 0x9d4f
    5dd4:	4449575f 	strbmi	r5, [r9], #-1887	; 0xfffff8a1
    5dd8:	5f5f4854 	svcpl	0x005f4854
    5ddc:	00323320 	eorseq	r3, r2, r0, lsr #6
    5de0:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    5de4:	5f343654 	svcpl	0x00343654
    5de8:	49535045 	ldmdbmi	r3, {r0, r2, r6, ip, lr}^
    5dec:	5f4e4f4c 	svcpl	0x004e4f4c
    5df0:	2e32205f 	mrccs	0, 1, r2, cr2, cr15, {2}
    5df4:	34303232 	ldrtcc	r3, [r0], #-562	; 0xfffffdce
    5df8:	34303634 	ldrtcc	r3, [r0], #-1588	; 0xfffff9cc
    5dfc:	30353239 	eorscc	r3, r5, r9, lsr r2
    5e00:	31333133 	teqcc	r3, r3, lsr r1
    5e04:	36312d65 	ldrtcc	r2, [r1], -r5, ror #26
    5e08:	00343646 	eorseq	r3, r4, r6, asr #12
    5e0c:	5f434352 	svcpl	0x00434352
    5e10:	32495053 	subcc	r5, r9, #83	; 0x53
    5e14:	4b4c435f 	blmi	1316b98 <_Min_Stack_Size+0x1316798>
    5e18:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
    5e1c:	52282029 	eorpl	r2, r8, #41	; 0x29
    5e20:	3e2d4343 	cdpcc	3, 2, cr4, cr13, cr3, {2}
    5e24:	31425041 	cmpcc	r2, r1, asr #32
    5e28:	20524e45 	subscs	r4, r2, r5, asr #28
    5e2c:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    5e30:	313c3c31 	teqcc	ip, r1, lsr ip
    5e34:	00292934 	eoreq	r2, r9, r4, lsr r9
    5e38:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    5e3c:	52495f30 	subpl	r5, r9, #48, 30	; 0xc0
    5e40:	6e614851 	mcrvs	8, 3, r4, cr1, cr1, {2}
    5e44:	72656c64 	rsbvc	r6, r5, #100, 24	; 0x6400
    5e48:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 4f50 <_Min_Stack_Size+0x4b50>
    5e4c:	495f4154 	ldmdbmi	pc, {r2, r4, r6, r8, lr}^	; <UNPREDICTABLE>
    5e50:	5f544942 	svcpl	0x00544942
    5e54:	3436205f 	ldrtcc	r2, [r6], #-95	; 0xffffffa1
    5e58:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    5e5c:	43495f43 	movtmi	r5, #40771	; 0x9f43
    5e60:	20325245 	eorscs	r5, r2, r5, asr #4
    5e64:	7576282a 	ldrbvc	r2, [r6, #-2090]!	; 0xfffff7d6
    5e68:	33746e69 	cmncc	r4, #1680	; 0x690
    5e6c:	2a745f32 	bcs	1d1db3c <_Min_Stack_Size+0x1d1d73c>
    5e70:	564e2829 	strbpl	r2, [lr], -r9, lsr #16
    5e74:	425f4349 	subsmi	r4, pc, #603979777	; 0x24000001
    5e78:	2b455341 	blcs	115ab84 <_Min_Stack_Size+0x115a784>
    5e7c:	38307830 	ldmdacc	r0!, {r4, r5, fp, ip, sp, lr}
    5e80:	5f002938 	svcpl	0x00002938
    5e84:	4c4c555f 	cfstr64mi	mvdx5, [ip], {95}	; 0x5f
    5e88:	43415246 	movtmi	r5, #4678	; 0x1246
    5e8c:	50455f54 	subpl	r5, r5, r4, asr pc
    5e90:	4f4c4953 	svcmi	0x004c4953
    5e94:	205f5f4e 	subscs	r5, pc, lr, asr #30
    5e98:	50317830 	eorspl	r7, r1, r0, lsr r8
    5e9c:	5534362d 	ldrpl	r3, [r4, #-1581]!	; 0xfffff9d3
    5ea0:	00524c4c 	subseq	r4, r2, ip, asr #24
    5ea4:	4f495047 	svcmi	0x00495047
    5ea8:	444f4d5f 	strbmi	r4, [pc], #-3423	; 5eb0 <_Min_Stack_Size+0x5ab0>
    5eac:	4e495f45 	cdpmi	15, 4, cr5, cr9, cr5, {2}
    5eb0:	5f545550 	svcpl	0x00545550
    5eb4:	4c414e41 	mcrrmi	14, 4, r4, r1, cr1
    5eb8:	3020474f 	eorcc	r4, r0, pc, asr #14
    5ebc:	535f5f00 	cmppl	pc, #0, 30
    5ec0:	4f455a49 	svcmi	0x00455a49
    5ec4:	49575f46 	ldmdbmi	r7, {r1, r2, r6, r8, r9, sl, fp, ip, lr}^
    5ec8:	545f544e 	ldrbpl	r5, [pc], #-1102	; 5ed0 <_Min_Stack_Size+0x5ad0>
    5ecc:	34205f5f 	strtcc	r5, [r0], #-3935	; 0xfffff0a1
    5ed0:	415f5f00 	cmpmi	pc, r0, lsl #30
    5ed4:	465f4d52 			; <UNDEFINED> instruction: 0x465f4d52
    5ed8:	55544145 	ldrbpl	r4, [r4, #-325]	; 0xfffffebb
    5edc:	555f4552 	ldrbpl	r4, [pc, #-1362]	; 5992 <_Min_Stack_Size+0x5592>
    5ee0:	494c414e 	stmdbmi	ip, {r1, r2, r3, r6, r8, lr}^
    5ee4:	44454e47 	strbmi	r4, [r5], #-3655	; 0xfffff1b9
    5ee8:	5f003120 	svcpl	0x00003120
    5eec:	5858475f 	ldmdapl	r8, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    5ef0:	5059545f 	subspl	r5, r9, pc, asr r4
    5ef4:	464e4945 	strbmi	r4, [lr], -r5, asr #18
    5ef8:	51455f4f 	cmppl	r5, pc, asr #30
    5efc:	494c4155 	stmdbmi	ip, {r0, r2, r4, r6, r8, lr}^
    5f00:	495f5954 	ldmdbmi	pc, {r2, r4, r6, r8, fp, ip, lr}^	; <UNPREDICTABLE>
    5f04:	4e494c4e 	cdpmi	12, 4, cr4, cr9, cr14, {2}
    5f08:	00302045 	eorseq	r2, r0, r5, asr #32
    5f0c:	444c5f5f 	strbmi	r5, [ip], #-3935	; 0xfffff0a1
    5f10:	445f4c42 	ldrbmi	r4, [pc], #-3138	; 5f18 <_Min_Stack_Size+0x5b18>
    5f14:	4d494345 	stclmi	3, cr4, [r9, #-276]	; 0xfffffeec
    5f18:	445f4c41 	ldrbmi	r4, [pc], #-3137	; 5f20 <_Min_Stack_Size+0x5b20>
    5f1c:	5f5f4749 	svcpl	0x005f4749
    5f20:	00373120 	eorseq	r3, r7, r0, lsr #2
    5f24:	53555f5f 	cmppl	r5, #380	; 0x17c
    5f28:	42495f41 	submi	r5, r9, #260	; 0x104
    5f2c:	5f5f5449 	svcpl	0x005f5449
    5f30:	00363120 	eorseq	r3, r6, r0, lsr #2
    5f34:	414c5f5f 	cmpmi	ip, pc, asr pc
    5f38:	4d554343 	ldclmi	3, cr4, [r5, #-268]	; 0xfffffef4
    5f3c:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    5f40:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    5f44:	3158302d 	cmpcc	r8, sp, lsr #32
    5f48:	4c313350 	ldcmi	3, cr3, [r1], #-320	; 0xfffffec0
    5f4c:	58302d4b 	ldmdapl	r0!, {r0, r1, r3, r6, r8, sl, fp, sp}
    5f50:	31335031 	teqcc	r3, r1, lsr r0
    5f54:	00294b4c 	eoreq	r4, r9, ip, asr #22
    5f58:	4349564e 	movtmi	r5, #38478	; 0x964e
    5f5c:	4553495f 	ldrbmi	r4, [r3, #-2399]	; 0xfffff6a1
    5f60:	2a203052 	bcs	8120b0 <_Min_Stack_Size+0x811cb0>
    5f64:	69757628 	ldmdbvs	r5!, {r3, r5, r9, sl, ip, sp, lr}^
    5f68:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    5f6c:	292a745f 	stmdbcs	sl!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    5f70:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    5f74:	41425f43 	cmpmi	r2, r3, asr #30
    5f78:	302b4553 	eorcc	r4, fp, r3, asr r5
    5f7c:	30303078 	eorscc	r3, r0, r8, ror r0
    5f80:	5f5f0029 	svcpl	0x005f0029
    5f84:	5f544e49 	svcpl	0x00544e49
    5f88:	54534146 	ldrbpl	r4, [r3], #-326	; 0xfffffeba
    5f8c:	414d5f38 	cmpmi	sp, r8, lsr pc
    5f90:	205f5f58 	subscs	r5, pc, r8, asr pc	; <UNPREDICTABLE>
    5f94:	66377830 			; <UNDEFINED> instruction: 0x66377830
    5f98:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    5f9c:	5f006666 	svcpl	0x00006666
    5fa0:	544c465f 	strbpl	r4, [ip], #-1631	; 0xfffff9a1
    5fa4:	485f3233 	ldmdami	pc, {r0, r1, r4, r5, r9, ip, sp}^	; <UNPREDICTABLE>
    5fa8:	445f5341 	ldrbmi	r5, [pc], #-833	; 5fb0 <_Min_Stack_Size+0x5bb0>
    5fac:	524f4e45 	subpl	r4, pc, #1104	; 0x450
    5fb0:	205f5f4d 	subscs	r5, pc, sp, asr #30
    5fb4:	5f5f0031 	svcpl	0x005f0031
    5fb8:	33434544 	movtcc	r4, #13636	; 0x3544
    5fbc:	494d5f32 	stmdbmi	sp, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    5fc0:	58455f4e 	stmdapl	r5, {r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    5fc4:	205f5f50 	subscs	r5, pc, r0, asr pc	; <UNPREDICTABLE>
    5fc8:	34392d28 	ldrtcc	r2, [r9], #-3368	; 0xfffff2d8
    5fcc:	5f5f0029 	svcpl	0x005f0029
    5fd0:	414c4c55 	cmpmi	ip, r5, asr ip
    5fd4:	4d554343 	ldclmi	3, cr4, [r5, #-268]	; 0xfffffef4
    5fd8:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    5fdc:	30205f5f 	eorcc	r5, r0, pc, asr pc
    5fe0:	4c55302e 	mrrcmi	0, 2, r3, r5, cr14
    5fe4:	5f004b4c 	svcpl	0x00004b4c
    5fe8:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
    5fec:	5341465f 	movtpl	r4, #5727	; 0x165f
    5ff0:	5f323354 	svcpl	0x00323354
    5ff4:	54444957 	strbpl	r4, [r4], #-2391	; 0xfffff6a9
    5ff8:	205f5f48 	subscs	r5, pc, r8, asr #30
    5ffc:	49003233 	stmdbmi	r0, {r0, r1, r4, r5, r9, ip, sp}
    6000:	7475706e 	ldrbtvc	r7, [r5], #-110	; 0xffffff92
    6004:	6e694c5f 	mcrvs	12, 3, r4, cr9, cr15, {2}
    6008:	754e5f65 	strbvc	r5, [lr, #-3941]	; 0xfffff09b
    600c:	7265626d 	rsbvc	r6, r5, #-805306362	; 0xd0000006
    6010:	475f5f00 	ldrbmi	r5, [pc, -r0, lsl #30]
    6014:	415f4343 	cmpmi	pc, r3, asr #6
    6018:	494d4f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, lr}^
    601c:	43575f43 	cmpmi	r7, #268	; 0x10c
    6020:	5f524148 	svcpl	0x00524148
    6024:	4f4c5f54 	svcmi	0x004c5f54
    6028:	465f4b43 	ldrbmi	r4, [pc], -r3, asr #22
    602c:	20454552 	subcs	r4, r5, r2, asr r5
    6030:	58450032 	stmdapl	r5, {r1, r4, r5}^
    6034:	43504954 	cmpmi	r0, #84, 18	; 0x150000
    6038:	28203231 	stmdacs	r0!, {r0, r4, r5, r9, ip, sp}
    603c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    6040:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    6044:	614d5f4f 	cmpvs	sp, pc, asr #30
    6048:	6e697070 	mcrvs	0, 3, r7, cr9, cr0, {3}
    604c:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    6050:	5458457b 	ldrbpl	r4, [r8], #-1403	; 0xfffffa85
    6054:	32315f49 	eorscc	r5, r1, #292	; 0x124
    6058:	5047282c 	subpl	r2, r7, ip, lsr #16
    605c:	505f4f49 	subspl	r4, pc, r9, asr #30
    6060:	6f436e69 	svcvs	0x00436e69
    6064:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    6068:	7b29745f 	blvc	a631ec <_Min_Stack_Size+0xa62dec>
    606c:	4f495047 	svcmi	0x00495047
    6070:	50472c43 	subpl	r2, r7, r3, asr #24
    6074:	505f4f49 	subspl	r4, pc, r9, asr #30
    6078:	315f4e49 	cmpcc	pc, r9, asr #28
    607c:	50472c32 	subpl	r2, r7, r2, lsr ip
    6080:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 5f64 <_Min_Stack_Size+0x5b64>
    6084:	5f45444f 	svcpl	0x0045444f
    6088:	495f4641 	ldmdbmi	pc, {r0, r6, r9, sl, lr}^	; <UNPREDICTABLE>
    608c:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    6090:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    6094:	554f5f4f 	strbpl	r5, [pc, #-3919]	; 514d <_Min_Stack_Size+0x4d4d>
    6098:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    609c:	4550535f 	ldrbmi	r5, [r0, #-863]	; 0xfffffca1
    60a0:	4e5f4445 	cdpmi	4, 5, cr4, cr15, cr5, {2}
    60a4:	7d454e4f 	stclvc	14, cr4, [r5, #-316]	; 0xfffffec4
    60a8:	5f5f007d 	svcpl	0x005f007d
    60ac:	5f4d5241 	svcpl	0x004d5241
    60b0:	5f4d5341 	svcpl	0x004d5341
    60b4:	544e5953 	strbpl	r5, [lr], #-2387	; 0xfffff6ad
    60b8:	555f5841 	ldrbpl	r5, [pc, #-2113]	; 587f <_Min_Stack_Size+0x547f>
    60bc:	4946494e 	stmdbmi	r6, {r1, r2, r3, r6, r8, fp, lr}^
    60c0:	5f5f4445 	svcpl	0x005f4445
    60c4:	45003120 	strmi	r3, [r0, #-288]	; 0xfffffee0
    60c8:	31495458 	cmpcc	r9, r8, asr r4
    60cc:	5152495f 	cmppl	r2, pc, asr r9
    60d0:	646e6148 	strbtvs	r6, [lr], #-328	; 0xfffffeb8
    60d4:	0072656c 	rsbseq	r6, r2, ip, ror #10
    60d8:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    60dc:	5f363154 	svcpl	0x00363154
    60e0:	5f58414d 	svcpl	0x0058414d
    60e4:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    60e8:	66666637 			; <UNDEFINED> instruction: 0x66666637
    60ec:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 51f4 <_Min_Stack_Size+0x4df4>
    60f0:	33544e49 	cmpcc	r4, #1168	; 0x490
    60f4:	59545f32 	ldmdbpl	r4, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    60f8:	5f5f4550 	svcpl	0x005f4550
    60fc:	6e6f6c20 	cdpvs	12, 6, cr6, cr15, cr0, {1}
    6100:	6e752067 	cdpvs	0, 7, cr2, cr5, cr7, {3}
    6104:	6e676973 			; <UNDEFINED> instruction: 0x6e676973
    6108:	69206465 	stmdbvs	r0!, {r0, r2, r5, r6, sl, sp, lr}
    610c:	5f00746e 	svcpl	0x0000746e
    6110:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
    6114:	5341465f 	movtpl	r4, #5727	; 0x165f
    6118:	5f343654 	svcpl	0x00343654
    611c:	54444957 	strbpl	r4, [r4], #-2391	; 0xfffff6a9
    6120:	205f5f48 	subscs	r5, pc, r8, asr #30
    6124:	5f003436 	svcpl	0x00003436
    6128:	7568745f 	strbvc	r7, [r8, #-1119]!	; 0xfffffba1
    612c:	5f32626d 	svcpl	0x0032626d
    6130:	0031205f 	eorseq	r2, r1, pc, asr r0
    6134:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    6138:	33314550 	teqcc	r1, #80, 10	; 0x14000000
    613c:	58452820 	stmdapl	r5, {r5, fp, sp}^
    6140:	475f4954 			; <UNDEFINED> instruction: 0x475f4954
    6144:	5f4f4950 	svcpl	0x004f4950
    6148:	7070614d 	rsbsvc	r6, r0, sp, asr #2
    614c:	5f676e69 	svcpl	0x00676e69
    6150:	457b2974 	ldrbmi	r2, [fp, #-2420]!	; 0xfffff68c
    6154:	5f495458 	svcpl	0x00495458
    6158:	282c3331 	stmdacs	ip!, {r0, r4, r5, r8, r9, ip, sp}
    615c:	4f495047 	svcmi	0x00495047
    6160:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    6164:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    6168:	745f6769 	ldrbvc	r6, [pc], #-1897	; 6170 <_Min_Stack_Size+0x5d70>
    616c:	50477b29 	subpl	r7, r7, r9, lsr #22
    6170:	2c454f49 	mcrrcs	15, 4, r4, r5, cr9
    6174:	4f495047 	svcmi	0x00495047
    6178:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    617c:	2c33315f 	ldfcss	f3, [r3], #-380	; 0xfffffe84
    6180:	4f495047 	svcmi	0x00495047
    6184:	444f4d5f 	strbmi	r4, [pc], #-3423	; 618c <_Min_Stack_Size+0x5d8c>
    6188:	46415f45 	strbmi	r5, [r1], -r5, asr #30
    618c:	504e495f 	subpl	r4, lr, pc, asr r9
    6190:	472c5455 			; <UNDEFINED> instruction: 0x472c5455
    6194:	5f4f4950 	svcpl	0x004f4950
    6198:	5054554f 	subspl	r5, r4, pc, asr #10
    619c:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    61a0:	44454550 	strbmi	r4, [r5], #-1360	; 0xfffffab0
    61a4:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    61a8:	007d7d45 	rsbseq	r7, sp, r5, asr #26
    61ac:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    61b0:	315f3531 	cmpcc	pc, r1, lsr r5	; <UNPREDICTABLE>
    61b4:	52495f30 	subpl	r5, r9, #48, 30	; 0xc0
    61b8:	6e614851 	mcrvs	8, 3, r4, cr1, cr1, {2}
    61bc:	72656c64 	rsbvc	r6, r5, #100, 24	; 0x6400
    61c0:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 52c8 <_Min_Stack_Size+0x4ec8>
    61c4:	52464c4c 	subpl	r4, r6, #76, 24	; 0x4c00
    61c8:	5f544341 	svcpl	0x00544341
    61cc:	5f4e494d 	svcpl	0x004e494d
    61d0:	2e30205f 	mrccs	0, 1, r2, cr0, cr15, {2}
    61d4:	4c4c5530 	cfstr64mi	mvdx5, [ip], {48}	; 0x30
    61d8:	564e0052 			; <UNDEFINED> instruction: 0x564e0052
    61dc:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    61e0:	38335152 	ldmdacc	r3!, {r1, r4, r6, r8, ip, lr}
    61e4:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
    61e8:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    61ec:	5f434956 	svcpl	0x00434956
    61f0:	52455349 	subpl	r5, r5, #603979777	; 0x24000001
    61f4:	3d7c2031 	ldclcc	0, cr2, [ip, #-196]!	; 0xffffff3c
    61f8:	3c312820 	ldccc	8, cr2, [r1], #-128	; 0xffffff80
    61fc:	2929363c 	stmdbcs	r9!, {r2, r3, r4, r5, r9, sl, ip, sp}
    6200:	415f5f00 	cmpmi	pc, r0, lsl #30
    6204:	465f4d52 			; <UNDEFINED> instruction: 0x465f4d52
    6208:	5f363150 	svcpl	0x00363150
    620c:	53475241 	movtpl	r5, #29249	; 0x7241
    6210:	535f5f00 	cmppl	pc, #0, 30
    6214:	4f455a49 	svcmi	0x00455a49
    6218:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    621c:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
    6220:	5f5f0034 	svcpl	0x005f0034
    6224:	52464c4c 	subpl	r4, r6, #76, 24	; 0x4c00
    6228:	5f544341 	svcpl	0x00544341
    622c:	54494249 	strbpl	r4, [r9], #-585	; 0xfffffdb7
    6230:	30205f5f 	eorcc	r5, r0, pc, asr pc
    6234:	535f5f00 	cmppl	pc, #0, 30
    6238:	55434341 	strbpl	r4, [r3, #-833]	; 0xfffffcbf
    623c:	50455f4d 	subpl	r5, r5, sp, asr #30
    6240:	4f4c4953 	svcmi	0x004c4953
    6244:	205f5f4e 	subscs	r5, pc, lr, asr #30
    6248:	50317830 	eorspl	r7, r1, r0, lsr r8
    624c:	4b48372d 	blmi	1213f08 <_Min_Stack_Size+0x1213b08>
    6250:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    6254:	31425049 	cmpcc	r2, r9, asr #32
    6258:	45282033 	strmi	r2, [r8, #-51]!	; 0xffffffcd
    625c:	5f495458 	svcpl	0x00495458
    6260:	4f495047 	svcmi	0x00495047
    6264:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    6268:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    626c:	7b29745f 	blvc	a633f0 <_Min_Stack_Size+0xa62ff0>
    6270:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    6274:	2c33315f 	ldfcss	f3, [r3], #-380	; 0xfffffe84
    6278:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    627c:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    6280:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    6284:	5f676966 	svcpl	0x00676966
    6288:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    628c:	424f4950 	submi	r4, pc, #80, 18	; 0x140000
    6290:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    6294:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    6298:	33315f4e 	teqcc	r1, #312	; 0x138
    629c:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    62a0:	4f4d5f4f 	svcmi	0x004d5f4f
    62a4:	415f4544 	cmpmi	pc, r4, asr #10
    62a8:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    62ac:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    62b0:	4f495047 	svcmi	0x00495047
    62b4:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    62b8:	5f545550 	svcpl	0x00545550
    62bc:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    62c0:	4f4e5f44 	svcmi	0x004e5f44
    62c4:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    62c8:	555f5f00 	ldrbpl	r5, [pc, #-3840]	; 53d0 <_Min_Stack_Size+0x4fd0>
    62cc:	5f544e49 	svcpl	0x00544e49
    62d0:	54534146 	ldrbpl	r4, [r3], #-326	; 0xfffffeba
    62d4:	545f3631 	ldrbpl	r3, [pc], #-1585	; 62dc <_Min_Stack_Size+0x5edc>
    62d8:	5f455059 	svcpl	0x00455059
    62dc:	6e75205f 	mrcvs	0, 3, r2, cr5, cr15, {2}
    62e0:	6e676973 			; <UNDEFINED> instruction: 0x6e676973
    62e4:	69206465 	stmdbvs	r0!, {r0, r2, r5, r6, sl, sp, lr}
    62e8:	5f00746e 	svcpl	0x0000746e
    62ec:	4148555f 	cmpmi	r8, pc, asr r5
    62f0:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    62f4:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
    62f8:	58450038 	stmdapl	r5, {r3, r4, r5}^
    62fc:	315f4954 	cmpcc	pc, r4, asr r9	; <UNPREDICTABLE>
    6300:	4e003120 	adfmisp	f3, f0, f0
    6304:	5f434956 	svcpl	0x00434956
    6308:	33515249 	cmpcc	r1, #-1879048188	; 0x90000004
    630c:	49445f36 	stmdbmi	r4, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    6310:	20292853 	eorcs	r2, r9, r3, asr r8
    6314:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    6318:	43495f43 	movtmi	r5, #40771	; 0x9f43
    631c:	20315245 	eorscs	r5, r1, r5, asr #4
    6320:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    6324:	343c3c31 	ldrtcc	r3, [ip], #-3121	; 0xfffff3cf
    6328:	5f002929 	svcpl	0x00002929
    632c:	414c555f 	cmpmi	ip, pc, asr r5
    6330:	4d554343 	ldclmi	3, cr4, [r5, #-268]	; 0xfffffef4
    6334:	5350455f 	cmppl	r0, #398458880	; 0x17c00000
    6338:	4e4f4c49 	cdpmi	12, 4, cr4, cr15, cr9, {2}
    633c:	30205f5f 	eorcc	r5, r0, pc, asr pc
    6340:	2d503178 	ldfcse	f3, [r0, #-480]	; 0xfffffe20
    6344:	4c553233 	lfmmi	f3, 2, [r5], {51}	; 0x33
    6348:	5053004b 	subspl	r0, r3, fp, asr #32
    634c:	28203249 	stmdacs	r0!, {r0, r3, r6, r9, ip, sp}
    6350:	49505328 	ldmdbmi	r0, {r3, r5, r8, r9, ip, lr}^
    6354:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    6358:	66656465 	strbtvs	r6, [r5], -r5, ror #8
    635c:	5053292a 	subspl	r2, r3, sl, lsr #18
    6360:	425f3249 	subsmi	r3, pc, #-1879048188	; 0x90000004
    6364:	29455341 	stmdbcs	r5, {r0, r6, r8, r9, ip, lr}^
    6368:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	; <UNPREDICTABLE>
    636c:	5f4c4244 	svcpl	0x004c4244
    6370:	5f474944 	svcpl	0x00474944
    6374:	3531205f 	ldrcc	r2, [r1, #-95]!	; 0xffffffa1
    6378:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    637c:	2820424f 	stmdacs	r0!, {r0, r1, r2, r3, r6, r9, lr}
    6380:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    6384:	79545f4f 	ldmdbvc	r4, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    6388:	65646570 	strbvs	r6, [r4, #-1392]!	; 0xfffffa90
    638c:	47292a66 	strmi	r2, [r9, -r6, ror #20]!
    6390:	424f4950 	submi	r4, pc, #80, 18	; 0x140000
    6394:	5341425f 	movtpl	r4, #4703	; 0x125f
    6398:	5f002945 	svcpl	0x00002945
    639c:	4e49575f 	mcrmi	7, 2, r5, cr9, cr15, {2}
    63a0:	494d5f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    63a4:	205f5f4e 	subscs	r5, pc, lr, asr #30
    63a8:	5f005530 	svcpl	0x00005530
    63ac:	544c465f 	strbpl	r4, [ip], #-1631	; 0xfffff9a1
    63b0:	445f3436 	ldrbmi	r3, [pc], #-1078	; 63b8 <_Min_Stack_Size+0x5fb8>
    63b4:	5f5f4749 	svcpl	0x005f4749
    63b8:	00353120 	eorseq	r3, r5, r0, lsr #2
    63bc:	45445f5f 	strbmi	r5, [r4, #-3935]	; 0xfffff0a1
    63c0:	5f343643 	svcpl	0x00343643
    63c4:	49535045 	ldmdbmi	r3, {r0, r2, r6, ip, lr}^
    63c8:	5f4e4f4c 	svcpl	0x004e4f4c
    63cc:	4531205f 	ldrmi	r2, [r1, #-95]!	; 0xffffffa1
    63d0:	4435312d 	ldrtmi	r3, [r5], #-301	; 0xfffffed3
    63d4:	58450044 	stmdapl	r5, {r2, r6}^
    63d8:	365f4954 			; <UNDEFINED> instruction: 0x365f4954
    63dc:	5f003620 	svcpl	0x00003620
    63e0:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
    63e4:	41454c5f 	cmpmi	r5, pc, asr ip
    63e8:	5f385453 	svcpl	0x00385453
    63ec:	54444957 	strbpl	r4, [r4], #-2391	; 0xfffff6a9
    63f0:	205f5f48 	subscs	r5, pc, r8, asr #30
    63f4:	53550038 	cmppl	r5, #56	; 0x38
    63f8:	31545241 	cmpcc	r4, r1, asr #4
    63fc:	55282820 	strpl	r2, [r8, #-2080]!	; 0xfffff7e0
    6400:	54524153 	ldrbpl	r4, [r2], #-339	; 0xfffffead
    6404:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    6408:	66656465 	strbtvs	r6, [r5], -r5, ror #8
    640c:	5355292a 	cmppl	r5, #688128	; 0xa8000
    6410:	31545241 	cmpcc	r4, r1, asr #4
    6414:	5341425f 	movtpl	r4, #4703	; 0x125f
    6418:	5f002945 	svcpl	0x00002945
    641c:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
    6420:	41454c5f 	cmpmi	r5, pc, asr ip
    6424:	36315453 			; <UNDEFINED> instruction: 0x36315453
    6428:	5059545f 	subspl	r5, r9, pc, asr r4
    642c:	205f5f45 	subscs	r5, pc, r5, asr #30
    6430:	726f6873 	rsbvc	r6, pc, #7536640	; 0x730000
    6434:	6e692074 	mcrvs	0, 3, r2, cr9, cr4, {3}
    6438:	5f5f0074 	svcpl	0x005f0074
    643c:	465f5151 			; <UNDEFINED> instruction: 0x465f5151
    6440:	5f544942 	svcpl	0x00544942
    6444:	0037205f 	eorseq	r2, r7, pc, asr r0
    6448:	42445f5f 	submi	r5, r4, #380	; 0x17c
    644c:	414d5f4c 	cmpmi	sp, ip, asr #30
