mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    6450:	205f5f58 	subscs	r5, pc, r8, asr pc	; <UNPREDICTABLE>
    6454:	6f642828 	svcvs	0x00642828
    6458:	656c6275 	strbvs	r6, [ip, #-629]!	; 0xfffffd8b
    645c:	372e3129 	strcc	r3, [lr, -r9, lsr #2]!
    6460:	39363739 	ldmdbcc	r6!, {r0, r3, r4, r5, r8, r9, sl, ip, sp}
    6464:	34333133 	ldrtcc	r3, [r3], #-307	; 0xfffffecd
    6468:	33323638 	teqcc	r2, #56, 12	; 0x3800000
    646c:	65373531 	ldrvs	r3, [r7, #-1329]!	; 0xfffffacf
    6470:	3830332b 	ldmdacc	r0!, {r0, r1, r3, r5, r8, r9, ip, sp}
    6474:	4700294c 	strmi	r2, [r0, -ip, asr #18]
    6478:	5f4f4950 	svcpl	0x004f4950
    647c:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    6480:	504e495f 	subpl	r4, lr, pc, asr r9
    6484:	465f5455 			; <UNDEFINED> instruction: 0x465f5455
    6488:	31204f4c 			; <UNDEFINED> instruction: 0x31204f4c
    648c:	6f6c6600 	svcvs	0x006c6600
    6490:	5f007461 	svcpl	0x00007461
    6494:	464c4c5f 			; <UNDEFINED> instruction: 0x464c4c5f
    6498:	54434152 	strbpl	r4, [r3], #-338	; 0xfffffeae
    649c:	4942465f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
    64a0:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
    64a4:	5f003336 	svcpl	0x00003336
    64a8:	544c465f 	strbpl	r4, [ip], #-1631	; 0xfffff9a1
    64ac:	485f3233 	ldmdami	pc, {r0, r1, r4, r5, r9, ip, sp}^	; <UNPREDICTABLE>
    64b0:	495f5341 	ldmdbmi	pc, {r0, r6, r8, r9, ip, lr}^	; <UNPREDICTABLE>
    64b4:	4e49464e 	cdpmi	6, 4, cr4, cr9, cr14, {2}
    64b8:	5f595449 	svcpl	0x00595449
    64bc:	0031205f 	eorseq	r2, r1, pc, asr r0
    64c0:	4f495047 	svcmi	0x00495047
    64c4:	41425f45 	cmpmi	r2, r5, asr #30
    64c8:	30204553 	eorcc	r4, r0, r3, asr r5
    64cc:	30303478 	eorscc	r3, r0, r8, ror r4
    64d0:	30383131 	eorscc	r3, r8, r1, lsr r1
    64d4:	5f5f0030 	svcpl	0x005f0030
    64d8:	454d5241 	strbmi	r5, [sp, #-577]	; 0xfffffdbf
    64dc:	205f5f4c 	subscs	r5, pc, ip, asr #30
    64e0:	564e0031 			; <UNDEFINED> instruction: 0x564e0031
    64e4:	425f4349 	subsmi	r4, pc, #603979777	; 0x24000001
    64e8:	20455341 	subcs	r5, r5, r1, asr #6
    64ec:	30457830 	subcc	r7, r5, r0, lsr r8
    64f0:	31453030 	cmpcc	r5, r0, lsr r0
    64f4:	5f003030 	svcpl	0x00003030
    64f8:	5f51485f 	svcpl	0x0051485f
    64fc:	54494246 	strbpl	r4, [r9], #-582	; 0xfffffdba
    6500:	31205f5f 			; <UNDEFINED> instruction: 0x31205f5f
    6504:	5f5f0035 	svcpl	0x005f0035
    6508:	455a4953 	ldrbmi	r4, [sl, #-2387]	; 0xfffff6ad
    650c:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    6510:	30205f5f 	eorcc	r5, r0, pc, asr pc
    6514:	66666678 			; <UNDEFINED> instruction: 0x66666678
    6518:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    651c:	47005566 	strmi	r5, [r0, -r6, ror #10]
    6520:	434f4950 	movtmi	r4, #63824	; 0xf950
    6524:	5341425f 	movtpl	r4, #4703	; 0x125f
    6528:	78302045 	ldmdavc	r0!, {r0, r2, r6, sp}
    652c:	31303034 	teqcc	r0, r4, lsr r0
    6530:	30303031 	eorscc	r3, r0, r1, lsr r0
    6534:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    6538:	52495f43 	subpl	r5, r9, #268	; 0x10c
    653c:	5f383351 	svcpl	0x00383351
    6540:	28534944 	ldmdacs	r3, {r2, r6, r8, fp, lr}^
    6544:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    6548:	5f434956 	svcpl	0x00434956
    654c:	52454349 	subpl	r4, r5, #603979777	; 0x24000001
    6550:	3d7c2031 	ldclcc	0, cr2, [ip, #-196]!	; 0xffffff3c
    6554:	3c312820 	ldccc	8, cr2, [r1], #-128	; 0xffffff80
    6558:	2929363c 	stmdbcs	r9!, {r2, r3, r4, r5, r9, sl, ip, sp}
    655c:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	; <UNPREDICTABLE>
    6560:	5f474e4f 	svcpl	0x00474e4f
    6564:	5f58414d 	svcpl	0x0058414d
    6568:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    656c:	66666637 			; <UNDEFINED> instruction: 0x66666637
    6570:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    6574:	4e47004c 	cdpmi	0, 4, cr0, cr7, cr12, {2}
    6578:	31432055 	qdaddcc	r2, r5, r3
    657c:	2e372031 	mrccs	0, 1, r2, cr7, cr1, {1}
    6580:	20312e33 	eorscs	r2, r1, r3, lsr lr
    6584:	38313032 	ldmdacc	r1!, {r1, r4, r5, ip, sp}
    6588:	32323630 	eorscc	r3, r2, #48, 12	; 0x3000000
    658c:	65722820 	ldrbvs	r2, [r2, #-2080]!	; 0xfffff7e0
    6590:	7361656c 	cmnvc	r1, #108, 10	; 0x1b000000
    6594:	5b202965 	blpl	810b30 <_Min_Stack_Size+0x810730>
    6598:	2f4d5241 	svccs	0x004d5241
    659c:	65626d65 	strbvs	r6, [r2, #-3429]!	; 0xfffff29b
    65a0:	64656464 	strbtvs	r6, [r5], #-1124	; 0xfffffb9c
    65a4:	622d372d 	eorvs	r3, sp, #11796480	; 0xb40000
    65a8:	636e6172 	cmnvs	lr, #-2147483620	; 0x8000001c
    65ac:	65722068 	ldrbvs	r2, [r2, #-104]!	; 0xffffff98
    65b0:	69736976 	ldmdbvs	r3!, {r1, r2, r4, r5, r6, r8, fp, sp, lr}^
    65b4:	32206e6f 	eorcc	r6, r0, #1776	; 0x6f0
    65b8:	30393136 	eorscc	r3, r9, r6, lsr r1
    65bc:	2d205d37 	stccs	13, cr5, [r0, #-220]!	; 0xffffff24
    65c0:	7570636d 	ldrbvc	r6, [r0, #-877]!	; 0xfffffc93
    65c4:	726f633d 	rsbvc	r6, pc, #-201326592	; 0xf4000000
    65c8:	2d786574 	cfldr64cs	mvdx6, [r8, #-464]!	; 0xfffffe30
    65cc:	2d20336d 	stccs	3, cr3, [r0, #-436]!	; 0xfffffe4c
    65d0:	6f6c666d 	svcvs	0x006c666d
    65d4:	612d7461 			; <UNDEFINED> instruction: 0x612d7461
    65d8:	733d6962 	teqvc	sp, #1605632	; 0x188000
    65dc:	2074666f 	rsbscs	r6, r4, pc, ror #12
    65e0:	68746d2d 	ldmdavs	r4!, {r0, r2, r3, r5, r8, sl, fp, sp, lr}^
    65e4:	20626d75 	rsbcs	r6, r2, r5, ror sp
    65e8:	7764672d 	strbvc	r6, [r4, -sp, lsr #14]!
    65ec:	2d667261 	sfmcs	f7, 2, [r6, #-388]!	; 0xfffffe7c
    65f0:	672d2032 			; <UNDEFINED> instruction: 0x672d2032
    65f4:	4f2d2033 	svcmi	0x002d2033
    65f8:	732d2030 			; <UNDEFINED> instruction: 0x732d2030
    65fc:	673d6474 			; <UNDEFINED> instruction: 0x673d6474
    6600:	3131756e 	teqcc	r1, lr, ror #10
    6604:	66662d20 	strbtvs	r2, [r6], -r0, lsr #26
    6608:	74636e75 	strbtvc	r6, [r3], #-3701	; 0xfffff18b
    660c:	2d6e6f69 	stclcs	15, cr6, [lr, #-420]!	; 0xfffffe5c
    6610:	74636573 	strbtvc	r6, [r3], #-1395	; 0xfffffa8d
    6614:	736e6f69 	cmnvc	lr, #420	; 0x1a4
    6618:	64662d20 	strbtvs	r2, [r6], #-3360	; 0xfffff2e0
    661c:	2d617461 	cfstrdcs	mvd7, [r1, #-388]!	; 0xfffffe7c
    6620:	74636573 	strbtvc	r6, [r3], #-1395	; 0xfffffa8d
    6624:	736e6f69 	cmnvc	lr, #420	; 0x1a4
    6628:	73662d20 	cmnvc	r6, #32, 26	; 0x800
    662c:	6b636174 	blvs	18dec04 <_Min_Stack_Size+0x18de804>
    6630:	6173752d 	cmnvs	r3, sp, lsr #10
    6634:	47006567 	strmi	r6, [r0, -r7, ror #10]
    6638:	5f4f4950 	svcpl	0x004f4950
    663c:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    6640:	5f46415f 	svcpl	0x0046415f
    6644:	5054554f 	subspl	r5, r4, pc, asr #10
    6648:	505f5455 	subspl	r5, pc, r5, asr r4	; <UNPREDICTABLE>
    664c:	00362050 	eorseq	r2, r6, r0, asr r0
    6650:	52415f5f 	subpl	r5, r1, #380	; 0x17c
    6654:	45465f4d 	strbmi	r5, [r6, #-3917]	; 0xfffff0b3
    6658:	52555441 	subspl	r5, r5, #1090519040	; 0x41000000
    665c:	444c5f45 	strbmi	r5, [ip], #-3909	; 0xfffff0bb
    6660:	20584552 	subscs	r4, r8, r2, asr r5
    6664:	5f5f0037 	svcpl	0x005f0037
    6668:	455a4953 	ldrbmi	r4, [sl, #-2387]	; 0xfffff6ad
    666c:	5059545f 	subspl	r5, r9, pc, asr r4
    6670:	205f5f45 	subscs	r5, pc, r5, asr #30
    6674:	69736e75 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, sl, fp, sp, lr}^
    6678:	64656e67 	strbtvs	r6, [r5], #-3687	; 0xfffff199
    667c:	746e6920 	strbtvc	r6, [lr], #-2336	; 0xfffff6e0
    6680:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	; <UNPREDICTABLE>
    6684:	4152464c 	cmpmi	r2, ip, asr #12
    6688:	455f5443 	ldrbmi	r5, [pc, #-1091]	; 624d <_Min_Stack_Size+0x5e4d>
    668c:	4c495350 	mcrrmi	3, 5, r5, r9, cr0
    6690:	5f5f4e4f 	svcpl	0x005f4e4f
    6694:	31783020 	cmncc	r8, r0, lsr #32
    6698:	33362d50 	teqcc	r6, #80, 26	; 0x1400
    669c:	00524c4c 	subseq	r4, r2, ip, asr #24
    66a0:	52415f5f 	subpl	r5, r1, #380	; 0x17c
    66a4:	45465f4d 	strbmi	r5, [r6, #-3917]	; 0xfffff0b3
    66a8:	52555441 	subspl	r5, r5, #1090519040	; 0x41000000
    66ac:	49535f45 	ldmdbmi	r3, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
    66b0:	3233444d 	eorscc	r4, r3, #1291845632	; 0x4d000000
    66b4:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    66b8:	3233544c 	eorscc	r5, r3, #76, 8	; 0x4c000000
    66bc:	414d5f58 	cmpmi	sp, r8, asr pc
    66c0:	445f544e 	ldrbmi	r5, [pc], #-1102	; 66c8 <_Min_Stack_Size+0x62c8>
    66c4:	5f5f4749 	svcpl	0x005f4749
    66c8:	00333520 	eorseq	r3, r3, r0, lsr #10
    66cc:	4f495047 	svcmi	0x00495047
    66d0:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    66d4:	2031315f 	eorscs	r3, r1, pc, asr r1
    66d8:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    66dc:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    66e0:	3029745f 	eorcc	r7, r9, pc, asr r4
    66e4:	30383078 	eorscc	r3, r8, r8, ror r0
    66e8:	5f002930 	svcpl	0x00002930
    66ec:	4843575f 	stmdami	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, ip, lr}^
    66f0:	575f5241 	ldrbpl	r5, [pc, -r1, asr #4]
    66f4:	48544449 	ldmdami	r4, {r0, r3, r6, sl, lr}^
    66f8:	33205f5f 			; <UNDEFINED> instruction: 0x33205f5f
    66fc:	564e0032 			; <UNDEFINED> instruction: 0x564e0032
    6700:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    6704:	39335152 	ldmdbcc	r3!, {r1, r4, r6, r8, ip, lr}
    6708:	5349445f 	movtpl	r4, #37983	; 0x945f
    670c:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    6710:	4349564e 	movtmi	r5, #38478	; 0x964e
    6714:	4543495f 	strbmi	r4, [r3, #-2399]	; 0xfffff6a1
    6718:	7c203152 	stfvcs	f3, [r0], #-328	; 0xfffffeb8
    671c:	3128203d 			; <UNDEFINED> instruction: 0x3128203d
    6720:	29373c3c 	ldmdbcs	r7!, {r2, r3, r4, r5, sl, fp, ip, sp}
    6724:	5f5f0029 	svcpl	0x005f0029
    6728:	31544e49 	cmpcc	r4, r9, asr #28
    672c:	28435f36 	stmdacs	r3, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    6730:	63202963 			; <UNDEFINED> instruction: 0x63202963
    6734:	445f5f00 	ldrbmi	r5, [pc], #-3840	; 673c <_Min_Stack_Size+0x633c>
    6738:	42495f41 	submi	r5, r9, #260	; 0x104
    673c:	5f5f5449 	svcpl	0x005f5449
    6740:	00323320 	eorseq	r3, r2, r0, lsr #6
    6744:	54505f5f 	ldrbpl	r5, [r0], #-3935	; 0xfffff0a1
    6748:	46494452 			; <UNDEFINED> instruction: 0x46494452
    674c:	49575f46 	ldmdbmi	r7, {r1, r2, r6, r8, r9, sl, fp, ip, lr}^
    6750:	5f485444 	svcpl	0x00485444
    6754:	3233205f 	eorscc	r2, r3, #95	; 0x5f
    6758:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    675c:	31435049 	cmpcc	r3, r9, asr #32
    6760:	45282030 	strmi	r2, [r8, #-48]!	; 0xffffffd0
    6764:	5f495458 	svcpl	0x00495458
    6768:	4f495047 	svcmi	0x00495047
    676c:	70614d5f 	rsbvc	r4, r1, pc, asr sp
    6770:	676e6970 			; <UNDEFINED> instruction: 0x676e6970
    6774:	7b29745f 	blvc	a638f8 <_Min_Stack_Size+0xa634f8>
    6778:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    677c:	2c30315f 	ldfcss	f3, [r0], #-380	; 0xfffffe84
    6780:	49504728 	ldmdbmi	r0, {r3, r5, r8, r9, sl, lr}^
    6784:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    6788:	6e6f436e 	cdpvs	3, 6, cr4, cr15, cr14, {3}
    678c:	5f676966 	svcpl	0x00676966
    6790:	477b2974 			; <UNDEFINED> instruction: 0x477b2974
    6794:	434f4950 	movtmi	r4, #63824	; 0xf950
    6798:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    679c:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    67a0:	30315f4e 	eorscc	r5, r1, lr, asr #30
    67a4:	4950472c 	ldmdbmi	r0, {r2, r3, r5, r8, r9, sl, lr}^
    67a8:	4f4d5f4f 	svcmi	0x004d5f4f
    67ac:	415f4544 	cmpmi	pc, r4, asr #10
    67b0:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    67b4:	2c545550 	cfldr64cs	mvdx5, [r4], {80}	; 0x50
    67b8:	4f495047 	svcmi	0x00495047
    67bc:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    67c0:	5f545550 	svcpl	0x00545550
    67c4:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    67c8:	4f4e5f44 	svcmi	0x004e5f44
    67cc:	7d7d454e 	cfldr64vc	mvdx4, [sp, #-312]!	; 0xfffffec8
    67d0:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    67d4:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    67d8:	4c435f4e 	mcrrmi	15, 4, r5, r3, cr14
    67dc:	20524145 	subscs	r4, r2, r5, asr #2
    67e0:	5f5f0030 	svcpl	0x005f0030
    67e4:	4d4f5441 	cfstrdmi	mvd5, [pc, #-260]	; 66e8 <_Min_Stack_Size+0x62e8>
    67e8:	415f4349 	cmpmi	pc, r9, asr #6
    67ec:	525f5143 	subspl	r5, pc, #-1073741808	; 0xc0000010
    67f0:	34204c45 	strtcc	r4, [r0], #-3141	; 0xfffff3bb
    67f4:	485f5f00 	ldmdami	pc, {r8, r9, sl, fp, ip, lr}^	; <UNPREDICTABLE>
    67f8:	42495f51 	submi	r5, r9, #324	; 0x144
    67fc:	5f5f5449 	svcpl	0x005f5449
    6800:	5f003020 	svcpl	0x00003020
    6804:	4c42445f 	cfstrdmi	mvd4, [r2], {95}	; 0x5f
    6808:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    680c:	5f30315f 	svcpl	0x0030315f
    6810:	5f505845 	svcpl	0x00505845
    6814:	2d28205f 	stccs	0, cr2, [r8, #-380]!	; 0xfffffe84
    6818:	29373033 	ldmdbcs	r7!, {r0, r1, r4, r5, ip, sp}
    681c:	4d495400 	cfstrdmi	mvd5, [r9, #-0]
    6820:	28282032 	stmdacs	r8!, {r1, r4, r5, sp}
    6824:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    6828:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    682c:	66656465 	strbtvs	r6, [r5], -r5, ror #8
    6830:	4954292a 	ldmdbmi	r4, {r1, r3, r5, r8, fp, sp}^
    6834:	425f324d 	subsmi	r3, pc, #-805306364	; 0xd0000004
    6838:	29455341 	stmdbcs	r5, {r0, r6, r8, r9, ip, lr}^
    683c:	4d545300 	ldclmi	3, cr5, [r4, #-0]
    6840:	31463233 	cmpcc	r6, r3, lsr r2
    6844:	5f003120 	svcpl	0x00003120
    6848:	4c4c555f 	cfstr64mi	mvdx5, [ip], {95}	; 0x5f
    684c:	43415246 	movtmi	r5, #4678	; 0x1246
    6850:	42465f54 	submi	r5, r6, #84, 30	; 0x150
    6854:	5f5f5449 	svcpl	0x005f5449
    6858:	00343620 	eorseq	r3, r4, r0, lsr #12
    685c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    6860:	616e455f 	cmnvs	lr, pc, asr r5
    6864:	00656c62 	rsbeq	r6, r5, r2, ror #24
    6868:	4f495047 	svcmi	0x00495047
    686c:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    6870:	5f545550 	svcpl	0x00545550
    6874:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    6878:	4f4e5f44 	svcmi	0x004e5f44
    687c:	3020454e 	eorcc	r4, r0, lr, asr #10
    6880:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    6884:	50475f49 	subpl	r5, r7, r9, asr #30
    6888:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	; 676c <_Min_Stack_Size+0x636c>
    688c:	69707061 	ldmdbvs	r0!, {r0, r5, r6, ip, sp, lr}^
    6890:	745f676e 	ldrbvc	r6, [pc], #-1902	; 6898 <_Min_Stack_Size+0x6498>
    6894:	49464100 	stmdbmi	r6, {r8, lr}^
    6898:	2828204f 	stmdacs	r8!, {r0, r1, r2, r3, r6, sp}
    689c:	4f494641 	svcmi	0x00494641
    68a0:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    68a4:	66656465 	strbtvs	r6, [r5], -r5, ror #8
    68a8:	4641292a 	strbmi	r2, [r1], -sl, lsr #18
    68ac:	425f4f49 	subsmi	r4, pc, #292	; 0x124
    68b0:	29455341 	stmdbcs	r5, {r0, r6, r8, r9, ip, lr}^
    68b4:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    68b8:	52495f43 	subpl	r5, r9, #268	; 0x10c
    68bc:	455f3951 	ldrbmi	r3, [pc, #-2385]	; 5f73 <_Min_Stack_Size+0x5b73>
    68c0:	2029284e 	eorcs	r2, r9, lr, asr #16
    68c4:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    68c8:	53495f43 	movtpl	r5, #40771	; 0x9f43
    68cc:	20305245 	eorscs	r5, r0, r5, asr #4
    68d0:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    68d4:	393c3c31 	ldmdbcc	ip!, {r0, r4, r5, sl, fp, ip, sp}
    68d8:	5f002929 	svcpl	0x00002929
    68dc:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    68e0:	58414d54 	stmdapl	r1, {r2, r4, r6, r8, sl, fp, lr}^
    68e4:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    68e8:	30205f5f 	eorcc	r5, r0, pc, asr pc
    68ec:	66666678 			; <UNDEFINED> instruction: 0x66666678
    68f0:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    68f4:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    68f8:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    68fc:	4c4c5566 	cfstr64mi	mvdx5, [ip], {102}	; 0x66
    6900:	445f5f00 	ldrbmi	r5, [pc], #-3840	; 6908 <_Min_Stack_Size+0x6508>
    6904:	4d5f4c42 	ldclmi	12, cr4, [pc, #-264]	; 6804 <_Min_Stack_Size+0x6404>
    6908:	5f544e41 	svcpl	0x00544e41
    690c:	5f474944 	svcpl	0x00474944
    6910:	3335205f 	teqcc	r5, #95	; 0x5f
    6914:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    6918:	43495f43 	movtmi	r5, #40771	; 0x9f43
    691c:	20305245 	eorscs	r5, r0, r5, asr #4
    6920:	7576282a 	ldrbvc	r2, [r6, #-2090]!	; 0xfffff7d6
    6924:	33746e69 	cmncc	r4, #1680	; 0x690
    6928:	2a745f32 	bcs	1d1e5f8 <_Min_Stack_Size+0x1d1e1f8>
    692c:	564e2829 	strbpl	r2, [lr], -r9, lsr #16
    6930:	425f4349 	subsmi	r4, pc, #603979777	; 0x24000001
    6934:	2b455341 	blcs	115b640 <_Min_Stack_Size+0x115b240>
    6938:	38307830 	ldmdacc	r0!, {r4, r5, fp, ip, sp, lr}
    693c:	5f002930 	svcpl	0x00002930
    6940:	464c555f 			; <UNDEFINED> instruction: 0x464c555f
    6944:	54434152 	strbpl	r4, [r3], #-338	; 0xfffffeae
    6948:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    694c:	205f5f54 	subscs	r5, pc, r4, asr pc	; <UNPREDICTABLE>
    6950:	564e0030 			; <UNDEFINED> instruction: 0x564e0030
    6954:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	; <UNPREDICTABLE>
    6958:	31525043 	cmpcc	r2, r3, asr #32
    695c:	76282a20 	strtvc	r2, [r8], -r0, lsr #20
    6960:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    6964:	745f3233 	ldrbvc	r3, [pc], #-563	; 696c <_Min_Stack_Size+0x656c>
    6968:	4e28292a 	vmulmi.f16	s4, s16, s21	; <UNPREDICTABLE>
    696c:	5f434956 	svcpl	0x00434956
    6970:	45534142 	ldrbmi	r4, [r3, #-322]	; 0xfffffebe
    6974:	3178302b 	cmncc	r8, fp, lsr #32
    6978:	00293438 	eoreq	r3, r9, r8, lsr r4
    697c:	52415f5f 	subpl	r5, r1, #380	; 0x17c
    6980:	41455f4d 	cmpmi	r5, sp, asr #30
    6984:	5f5f4942 	svcpl	0x005f4942
    6988:	5f003120 	svcpl	0x00003120
    698c:	544e495f 	strbpl	r4, [lr], #-2399	; 0xfffff6a1
    6990:	41454c5f 	cmpmi	r5, pc, asr ip
    6994:	34365453 	ldrtcc	r5, [r6], #-1107	; 0xfffffbad
    6998:	5059545f 	subspl	r5, r9, pc, asr r4
    699c:	205f5f45 	subscs	r5, pc, r5, asr #30
    69a0:	676e6f6c 	strbvs	r6, [lr, -ip, ror #30]!
    69a4:	6e6f6c20 	cdpvs	12, 6, cr6, cr15, cr0, {1}
    69a8:	6e692067 	cdpvs	0, 6, cr2, cr9, cr7, {3}
    69ac:	50470074 	subpl	r0, r7, r4, ror r0
    69b0:	505f4f49 	subspl	r4, pc, r9, asr #30
    69b4:	415f4e49 	cmpmi	pc, r9, asr #28
    69b8:	28204c4c 	stmdacs	r0!, {r2, r3, r6, sl, fp, lr}
    69bc:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    69c0:	5f363174 	svcpl	0x00363174
    69c4:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    69c8:	46464646 	strbmi	r4, [r6], -r6, asr #12
    69cc:	5f5f0029 	svcpl	0x005f0029
    69d0:	43434153 	movtmi	r4, #12627	; 0x3153
    69d4:	465f4d55 			; <UNDEFINED> instruction: 0x465f4d55
    69d8:	5f544942 	svcpl	0x00544942
    69dc:	0037205f 	eorseq	r2, r7, pc, asr r0
    69e0:	5f434e49 	svcpl	0x00434e49
    69e4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    69e8:	205f485f 	subscs	r4, pc, pc, asr r8	; <UNPREDICTABLE>
    69ec:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    69f0:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    69f4:	4f43434e 	svcmi	0x0043434e
    69f8:	4749464e 	strbmi	r4, [r9, -lr, asr #12]
    69fc:	434f4c5f 	movtmi	r4, #64607	; 0xfc5f
    6a00:	2044454b 	subcs	r4, r4, fp, asr #10
    6a04:	44420031 	strbmi	r0, [r2], #-49	; 0xffffffcf
    6a08:	41005243 	tstmi	r0, r3, asr #4
    6a0c:	45314250 	ldrmi	r4, [r1, #-592]!	; 0xfffffdb0
    6a10:	5000524e 	andpl	r5, r0, lr, asr #4
    6a14:	6f436e69 	svcvs	0x00436e69
    6a18:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    6a1c:	6c61565f 	stclvs	6, cr5, [r1], #-380	; 0xfffffe84
    6a20:	52006575 	andpl	r6, r0, #490733568	; 0x1d400000
    6a24:	545f4343 	ldrbpl	r4, [pc], #-835	; 6a2c <_Min_Stack_Size+0x662c>
    6a28:	64657079 	strbtvs	r7, [r5], #-121	; 0xffffff87
    6a2c:	41006665 	tstmi	r0, r5, ror #12
    6a30:	52324250 	eorspl	r4, r2, #80, 4
    6a34:	00525453 	subseq	r5, r2, r3, asr r4
    6a38:	45424841 	strbmi	r4, [r2, #-2113]	; 0xfffff7bf
    6a3c:	5000524e 	andpl	r5, r0, lr, asr #4
    6a40:	61566e69 	cmpvs	r6, r9, ror #28
    6a44:	0065756c 	rsbeq	r7, r5, ip, ror #10
    6a48:	31425041 	cmpcc	r2, r1, asr #32
    6a4c:	52545352 	subspl	r5, r4, #1207959553	; 0x48000001
    6a50:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    6a54:	52435f4f 	subpl	r5, r3, #316	; 0x13c
    6a58:	69500078 	ldmdbvs	r0, {r3, r4, r5, r6}^
    6a5c:	6d754e6e 	ldclvs	14, cr4, [r5, #-440]!	; 0xfffffe48
    6a60:	00726562 	rsbseq	r6, r2, r2, ror #10
    6a64:	4f495047 	svcmi	0x00495047
    6a68:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
    6a6c:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    6a70:	74506769 	ldrbvc	r6, [r0], #-1897	; 0xfffff897
    6a74:	434d0072 	movtmi	r0, #53362	; 0xd072
    6a78:	475f4c41 	ldrbmi	r4, [pc, -r1, asr #24]
    6a7c:	5f4f4950 	svcpl	0x004f4950
    6a80:	74697257 	strbtvc	r7, [r9], #-599	; 0xfffffda9
    6a84:	6e695065 	cdpvs	0, 6, cr5, cr9, cr5, {3}
    6a88:	2f2e2e00 	svccs	0x002e2e00
    6a8c:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
    6a90:	4950472f 	ldmdbmi	r0, {r0, r1, r2, r3, r5, r8, r9, sl, lr}^
    6a94:	00632e4f 	rsbeq	r2, r3, pc, asr #28
    6a98:	4f495047 	svcmi	0x00495047
    6a9c:	74505f78 	ldrbvc	r5, [r0], #-3960	; 0xfffff088
    6aa0:	434d0072 	movtmi	r0, #53362	; 0xd072
    6aa4:	475f4c41 	ldrbmi	r4, [pc, -r1, asr #24]
    6aa8:	5f4f4950 	svcpl	0x004f4950
    6aac:	64616552 	strbtvs	r6, [r1], #-1362	; 0xfffffaae
    6ab0:	006e6950 	rsbeq	r6, lr, r0, asr r9
    6ab4:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
    6ab8:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    6abc:	6f4c5f4f 	svcvs	0x004c5f4f
    6ac0:	69506b63 	ldmdbvs	r0, {r0, r1, r5, r6, r8, r9, fp, sp, lr}^
    6ac4:	5047006e 	subpl	r0, r7, lr, rrx
    6ac8:	435f4f49 	cmpmi	pc, #292	; 0x124
    6acc:	495f4b4c 	ldmdbmi	pc, {r2, r3, r6, r8, r9, fp, lr}^	; <UNPREDICTABLE>
    6ad0:	4674696e 	ldrbtmi	r6, [r4], -lr, ror #18
    6ad4:	0067616c 	rsbeq	r6, r7, ip, ror #2
    6ad8:	74726f50 	ldrbtvc	r6, [r2], #-3920	; 0xfffff0b0
    6adc:	756c6156 	strbvc	r6, [ip, #-342]!	; 0xfffffeaa
    6ae0:	65470065 	strbvs	r0, [r7, #-101]	; 0xffffff9b
    6ae4:	52435f74 	subpl	r5, r3, #116, 30	; 0x1d0
    6ae8:	6f505f78 	svcvs	0x00505f78
    6aec:	69746973 	ldmdbvs	r4!, {r0, r1, r4, r5, r6, r8, fp, sp, lr}^
    6af0:	41006e6f 	tstmi	r0, pc, ror #28
    6af4:	45324250 	ldrmi	r4, [r2, #-592]!	; 0xfffffdb0
    6af8:	4d00524e 	sfmmi	f5, 4, [r0, #-312]	; 0xfffffec8
    6afc:	5f4c4143 	svcpl	0x004c4143
    6b00:	4f495047 	svcmi	0x00495047
    6b04:	676f545f 			; <UNDEFINED> instruction: 0x676f545f
    6b08:	50656c67 	rsbpl	r6, r5, r7, ror #24
    6b0c:	4d006e69 	stcmi	14, cr6, [r0, #-420]	; 0xfffffe5c
    6b10:	5f4c4143 	svcpl	0x004c4143
    6b14:	4f495047 	svcmi	0x00495047
    6b18:	6165525f 	cmnvs	r5, pc, asr r2
    6b1c:	726f5064 	rsbvc	r5, pc, #100	; 0x64
    6b20:	434d0074 	movtmi	r0, #53364	; 0xd074
    6b24:	475f4c41 	ldrbmi	r4, [pc, -r1, asr #24]
    6b28:	5f4f4950 	svcpl	0x004f4950
    6b2c:	74696e49 	strbtvc	r6, [r9], #-3657	; 0xfffff1b7
    6b30:	41434d00 	cmpmi	r3, r0, lsl #26
    6b34:	50475f4c 	subpl	r5, r7, ip, asr #30
    6b38:	445f4f49 	ldrbmi	r4, [pc], #-3913	; 6b40 <_Min_Stack_Size+0x6740>
    6b3c:	696e4965 	stmdbvs	lr!, {r0, r2, r5, r6, r8, fp, lr}^
    6b40:	434d0074 	movtmi	r0, #53364	; 0xd074
    6b44:	475f4c41 	ldrbmi	r4, [pc, -r1, asr #24]
    6b48:	5f4f4950 	svcpl	0x004f4950
    6b4c:	74697257 	strbtvc	r7, [r9], #-599	; 0xfffffda9
    6b50:	726f5065 	rsbvc	r5, pc, #101	; 0x65
    6b54:	50470074 	subpl	r0, r7, r4, ror r0
    6b58:	555f4d54 	ldrbpl	r4, [pc, #-3412]	; 5e0c <_Min_Stack_Size+0x5a0c>
    6b5c:	54414450 	strbpl	r4, [r1], #-1104	; 0xfffffbb0
    6b60:	56455f45 	strbpl	r5, [r5], -r5, asr #30
    6b64:	5f544e45 	svcpl	0x00544e45
    6b68:	4f5f4e4f 	svcmi	0x005f4e4f
    6b6c:	28204656 	stmdacs	r0!, {r1, r2, r4, r6, r9, sl, lr}
    6b70:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    6b74:	5f363174 	svcpl	0x00363174
    6b78:	31282974 			; <UNDEFINED> instruction: 0x31282974
    6b7c:	29323c3c 	ldmdbcs	r2!, {r2, r3, r4, r5, sl, fp, ip, sp}
    6b80:	50470029 	subpl	r0, r7, r9, lsr #32
    6b84:	495f4d54 	ldmdbmi	pc, {r2, r4, r6, r8, sl, fp, lr}^	; <UNPREDICTABLE>
