mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    6b88:	455f5152 	ldrbmi	r5, [pc, #-338]	; 6a3e <_Min_Stack_Size+0x663e>
    6b8c:	49555f4e 	ldmdbmi	r5, {r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    6b90:	28282045 	stmdacs	r8!, {r0, r2, r6, sp}
    6b94:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    6b98:	745f3631 	ldrbvc	r3, [pc], #-1585	; 6ba0 <_Min_Stack_Size+0x67a0>
    6b9c:	3c312829 	ldccc	8, cr2, [r1], #-164	; 0xffffff5c
    6ba0:	2929303c 	stmdbcs	r9!, {r2, r3, r4, r5, ip, sp}
    6ba4:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    6ba8:	58455f4d 	stmdapl	r5, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    6bac:	49525454 	ldmdbmi	r2, {r2, r4, r6, sl, ip, lr}^
    6bb0:	49445f47 	stmdbmi	r4, {r0, r1, r2, r6, r8, r9, sl, fp, ip, lr}^
    6bb4:	4c424153 	stfmie	f4, [r2], {83}	; 0x53
    6bb8:	28282045 	stmdacs	r8!, {r0, r2, r6, sp}
    6bbc:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    6bc0:	745f3631 	ldrbvc	r3, [pc], #-1585	; 6bc8 <_Min_Stack_Size+0x67c8>
    6bc4:	3c302829 	ldccc	8, cr2, [r0], #-164	; 0xffffff5c
    6bc8:	2934313c 	ldmdbcs	r4!, {r2, r3, r4, r5, r8, ip, sp}
    6bcc:	69540029 	ldmdbvs	r4, {r0, r3, r5}^
    6bd0:	6843346d 	stmdavs	r3, {r0, r2, r3, r5, r6, sl, ip, sp}^
    6bd4:	656e6e61 	strbvs	r6, [lr, #-3681]!	; 0xfffff19f
    6bd8:	4700326c 	strmi	r3, [r0, -ip, ror #4]
    6bdc:	5f4d5450 	svcpl	0x004d5450
    6be0:	4f5f4843 	svcmi	0x005f4843
    6be4:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    6be8:	4f4d5f54 	svcmi	0x004d5f54
    6bec:	465f4544 	ldrbmi	r4, [pc], -r4, asr #10
    6bf0:	4543524f 	strbmi	r5, [r3, #-591]	; 0xfffffdb1
    6bf4:	5443415f 	strbpl	r4, [r3], #-351	; 0xfffffea1
    6bf8:	5f455649 	svcpl	0x00455649
    6bfc:	4556454c 	ldrbmi	r4, [r6, #-1356]	; 0xfffffab4
    6c00:	2828204c 	stmdacs	r8!, {r2, r3, r6, sp}
    6c04:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    6c08:	745f3631 	ldrbvc	r3, [pc], #-1585	; 6c10 <_Min_Stack_Size+0x6810>
    6c0c:	3c352829 	ldccc	8, cr2, [r5], #-164	; 0xffffff5c
    6c10:	2929343c 	stmdbcs	r9!, {r2, r3, r4, r5, sl, ip, sp}
    6c14:	6d695400 	cfstrdvs	mvd5, [r9, #-0]
    6c18:	61684334 	cmnvs	r8, r4, lsr r3
    6c1c:	6c656e6e 	stclvs	14, cr6, [r5], #-440	; 0xfffffe48
    6c20:	50470034 	subpl	r0, r7, r4, lsr r0
    6c24:	435f4d54 	cmpmi	pc, #84, 26	; 0x1500
    6c28:	554f5f48 	strbpl	r5, [pc, #-3912]	; 5ce8 <_Min_Stack_Size+0x58e8>
    6c2c:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    6c30:	4552505f 	ldrbmi	r5, [r2, #-95]	; 0xffffffa1
    6c34:	44414f4c 	strbmi	r4, [r1], #-3916	; 0xfffff0b4
    6c38:	414e455f 	cmpmi	lr, pc, asr r5
    6c3c:	20454c42 	subcs	r4, r5, r2, asr #24
    6c40:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    6c44:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    6c48:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    6c4c:	333c3c31 	teqcc	ip, #12544	; 0x3100
    6c50:	54002929 	strpl	r2, [r0], #-2345	; 0xfffff6d7
    6c54:	43346d69 	teqmi	r4, #6720	; 0x1a40
    6c58:	6e6e6168 	powvsez	f6, f6, #0.0
    6c5c:	00316c65 	eorseq	r6, r1, r5, ror #24
    6c60:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    6c64:	5f48435f 	svcpl	0x0048435f
    6c68:	43435f34 	movtmi	r5, #16180	; 0x3f34
    6c6c:	535f5245 	cmppl	pc, #1342177284	; 0x50000004
    6c70:	54464948 	strbpl	r4, [r6], #-2376	; 0xfffff6b8
    6c74:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    6c78:	31746e69 	cmncc	r4, r9, ror #28
    6c7c:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    6c80:	00293231 	eoreq	r3, r9, r1, lsr r2
    6c84:	346d6954 	strbtcc	r6, [sp], #-2388	; 0xfffff6ac
    6c88:	6e616843 	cdpvs	8, 6, cr6, cr1, cr3, {2}
    6c8c:	336c656e 	cmncc	ip, #461373440	; 0x1b800000
    6c90:	5f484300 	svcpl	0x00484300
    6c94:	65646f4d 	strbvs	r6, [r4, #-3917]!	; 0xfffff0b3
    6c98:	52434300 	subpl	r4, r3, #0, 6
    6c9c:	646e4978 	strbtvs	r4, [lr], #-2424	; 0xfffff688
    6ca0:	47007865 	strmi	r7, [r0, -r5, ror #16]
    6ca4:	5f4d5450 	svcpl	0x004d5450
    6ca8:	54545845 	ldrbpl	r5, [r4], #-2117	; 0xfffff7bb
    6cac:	5f474952 	svcpl	0x00474952
    6cb0:	504d4153 	subpl	r4, sp, r3, asr r1
    6cb4:	474e494c 	strbmi	r4, [lr, -ip, asr #18]
    6cb8:	5444665f 	strbpl	r6, [r4], #-1631	; 0xfffff9a1
    6cbc:	49445f53 	stmdbmi	r4, {r0, r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    6cc0:	5f385f56 	svcpl	0x00385f56
    6cc4:	20385f4e 	eorscs	r5, r8, lr, asr #30
    6cc8:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    6ccc:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    6cd0:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    6cd4:	383c3c39 	ldmdacc	ip!, {r0, r3, r4, r5, sl, fp, ip, sp}
    6cd8:	45002929 	strmi	r2, [r0, #-2345]	; 0xfffff6d7
    6cdc:	52545458 	subspl	r5, r4, #88, 8	; 0x58000000
    6ce0:	535f4749 	cmppl	pc, #19136512	; 0x1240000
    6ce4:	6c706d61 	ldclvs	13, cr6, [r0], #-388	; 0xfffffe7c
    6ce8:	46676e69 	strbtmi	r6, [r7], -r9, ror #28
    6cec:	65746c69 	ldrbvs	r6, [r4, #-3177]!	; 0xfffff397
    6cf0:	676e6972 			; <UNDEFINED> instruction: 0x676e6972
    6cf4:	2f2e2e00 	svccs	0x002e2e00
    6cf8:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
    6cfc:	5450472f 	ldrbpl	r4, [r0], #-1839	; 0xfffff8d1
    6d00:	00632e4d 	rsbeq	r2, r3, sp, asr #28
    6d04:	784d4954 	stmdavc	sp, {r2, r4, r6, r8, fp, lr}^
    6d08:	3152435f 	cmpcc	r2, pc, asr r3
    6d0c:	4d495400 	cfstrdmi	mvd5, [r9, #-0]
    6d10:	52435f78 	subpl	r5, r3, #120, 30	; 0x1e0
    6d14:	48430032 	stmdami	r3, {r1, r4, r5}^
    6d18:	78434f5f 	stmdavc	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, lr}^
    6d1c:	62616e45 	rsbvs	r6, r1, #1104	; 0x450
    6d20:	4500656c 	strmi	r6, [r0, #-1388]	; 0xfffffa94
    6d24:	52545458 	subspl	r5, r4, #88, 8	; 0x58000000
    6d28:	455f4749 	ldrbmi	r4, [pc, #-1865]	; 65e7 <_Min_Stack_Size+0x61e7>
    6d2c:	6c62616e 	stfvse	f6, [r2], #-440	; 0xfffffe48
    6d30:	434d0065 	movtmi	r0, #53349	; 0xd065
    6d34:	475f4c41 	ldrbmi	r4, [pc, -r1, asr #24]
    6d38:	5f4d5450 	svcpl	0x004d5450
    6d3c:	43746547 	cmnmi	r4, #297795584	; 0x11c00000
    6d40:	00785243 	rsbseq	r5, r8, r3, asr #4
    6d44:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    6d48:	74754f5f 	ldrbtvc	r4, [r5], #-3935	; 0xfffff0a1
    6d4c:	43747570 	cmnmi	r4, #112, 10	; 0x1c000000
    6d50:	6e6e6168 	powvsez	f6, f6, #0.0
    6d54:	5f586c65 	svcpl	0x00586c65
    6d58:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    6d5c:	745f6769 	ldrbvc	r6, [pc], #-1897	; 6d64 <_Min_Stack_Size+0x6964>
    6d60:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    6d64:	4f435f4d 	svcmi	0x00435f4d
    6d68:	45544e55 	ldrbmi	r4, [r4, #-3669]	; 0xfffff1ab
    6d6c:	49445f52 	stmdbmi	r4, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    6d70:	4f445f52 	svcmi	0x00445f52
    6d74:	28204e57 	stmdacs	r0!, {r0, r1, r2, r4, r6, r9, sl, fp, lr}
    6d78:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    6d7c:	5f363174 	svcpl	0x00363174
    6d80:	31282974 			; <UNDEFINED> instruction: 0x31282974
    6d84:	29343c3c 	ldmdbcs	r4!, {r2, r3, r4, r5, sl, fp, ip, sp}
    6d88:	49540029 	ldmdbmi	r4, {r0, r3, r5}^
    6d8c:	495f334d 	ldmdbmi	pc, {r0, r2, r3, r6, r8, r9, ip, sp}^	; <UNPREDICTABLE>
    6d90:	61485152 	cmpvs	r8, r2, asr r1
    6d94:	656c646e 	strbvs	r6, [ip, #-1134]!	; 0xfffffb92
    6d98:	4d440072 	stclmi	0, cr0, [r4, #-456]	; 0xfffffe38
    6d9c:	54005241 	strpl	r5, [r0], #-577	; 0xfffffdbf
    6da0:	5f784d49 	svcpl	0x00784d49
    6da4:	52454343 	subpl	r4, r5, #201326593	; 0xc000001
    6da8:	4d495400 	cfstrdmi	mvd5, [r9, #-0]
    6dac:	43435f78 	movtmi	r5, #16248	; 0x3f78
    6db0:	4300524d 	movwmi	r5, #589	; 0x24d
    6db4:	6e495f48 	cdpvs	15, 4, cr5, cr9, cr8, {2}
    6db8:	46747570 			; <UNDEFINED> instruction: 0x46747570
    6dbc:	65746c69 	ldrbvs	r6, [r4, #-3177]!	; 0xfffff397
    6dc0:	50470072 	subpl	r0, r7, r2, ror r0
    6dc4:	495f4d54 	ldmdbmi	pc, {r2, r4, r6, r8, sl, fp, lr}^	; <UNPREDICTABLE>
    6dc8:	455f5152 	ldrbmi	r5, [pc, #-338]	; 6c7e <_Min_Stack_Size+0x687e>
    6dcc:	5047004e 	subpl	r0, r7, lr, asr #32
    6dd0:	435f4d54 	cmpmi	pc, #84, 26	; 0x1500
    6dd4:	45544e45 	ldrbmi	r4, [r4, #-3653]	; 0xfffff1bb
    6dd8:	4c415f52 	mcrrmi	15, 5, r5, r1, cr2
    6ddc:	454e4749 	strbmi	r4, [lr, #-1865]	; 0xfffff8b7
    6de0:	4f4d5f44 	svcmi	0x004d5f44
    6de4:	325f4544 	subscc	r4, pc, #68, 10	; 0x11000000
    6de8:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    6dec:	31746e69 	cmncc	r4, r9, ror #28
    6df0:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    6df4:	3c3c3228 	lfmcc	f3, 4, [ip], #-160	; 0xffffff60
    6df8:	00292935 	eoreq	r2, r9, r5, lsr r9
    6dfc:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    6e00:	5f48435f 	svcpl	0x0048435f
    6e04:	43435f33 	movtmi	r5, #16179	; 0x3f33
    6e08:	535f5245 	cmppl	pc, #1342177284	; 0x50000004
    6e0c:	54464948 	strbpl	r4, [r6], #-2376	; 0xfffff6b8
    6e10:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    6e14:	31746e69 	cmncc	r4, r9, ror #28
    6e18:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    6e1c:	47002938 	smladxmi	r0, r8, r9, r2
    6e20:	5f4d5450 	svcpl	0x004d5450
    6e24:	445f4843 	ldrbmi	r4, [pc], #-2115	; 6e2c <_Min_Stack_Size+0x6a2c>
    6e28:	495f5249 	ldmdbmi	pc, {r0, r3, r6, r9, ip, lr}^	; <UNPREDICTABLE>
    6e2c:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    6e30:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    6e34:	31746e69 	cmncc	r4, r9, ror #28
    6e38:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    6e3c:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    6e40:	00292930 	eoreq	r2, r9, r0, lsr r9
    6e44:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    6e48:	5152495f 	cmppl	r2, pc, asr r9
    6e4c:	5f4e455f 	svcpl	0x004e455f
    6e50:	41534944 	cmpmi	r3, r4, asr #18
    6e54:	20454c42 	subcs	r4, r5, r2, asr #24
    6e58:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    6e5c:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    6e60:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    6e64:	303c3c30 	eorscc	r3, ip, r0, lsr ip
    6e68:	47002929 	strmi	r2, [r0, -r9, lsr #18]
    6e6c:	5f4d5450 	svcpl	0x004d5450
    6e70:	335f4843 	cmpcc	pc, #4390912	; 0x430000
    6e74:	4d43435f 	stclmi	3, cr4, [r3, #-380]	; 0xfffffe84
    6e78:	48535f52 	ldmdami	r3, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    6e7c:	20544649 	subscs	r4, r4, r9, asr #12
    6e80:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    6e84:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    6e88:	3029745f 	eorcc	r7, r9, pc, asr r4
    6e8c:	50470029 	subpl	r0, r7, r9, lsr #32
    6e90:	435f4d54 	cmpmi	pc, #84, 26	; 0x1500
    6e94:	4e495f48 	cdpmi	15, 4, cr5, cr9, cr8, {2}
    6e98:	5f545550 	svcpl	0x00545550
    6e9c:	504d4153 	subpl	r4, sp, r3, asr r1
    6ea0:	474e494c 	strbmi	r4, [lr, -ip, asr #18]
    6ea4:	4b43665f 	blmi	10e0828 <_Min_Stack_Size+0x10e0428>
    6ea8:	5f544e49 	svcpl	0x00544e49
    6eac:	20345f4e 	eorscs	r5, r4, lr, asr #30
    6eb0:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    6eb4:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    6eb8:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    6ebc:	343c3c32 	ldrtcc	r3, [ip], #-3122	; 0xfffff3ce
    6ec0:	4d002929 	vstrmi.16	s4, [r0, #-82]	; 0xffffffae	; <UNPREDICTABLE>
    6ec4:	5f4c4143 	svcpl	0x004c4143
    6ec8:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    6ecc:	4965445f 	stmdbmi	r5!, {r0, r1, r2, r3, r4, r6, sl, lr}^
    6ed0:	0074696e 	rsbseq	r6, r4, lr, ror #18
    6ed4:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    6ed8:	4e45435f 	mcrmi	3, 2, r4, cr5, cr15, {2}
    6edc:	5f524554 	svcpl	0x00524554
    6ee0:	47494c41 	strbmi	r4, [r9, -r1, asr #24]
    6ee4:	5f44454e 	svcpl	0x0044454e
    6ee8:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    6eec:	2820335f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, ip, sp}
    6ef0:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    6ef4:	5f363174 	svcpl	0x00363174
    6ef8:	33282974 			; <UNDEFINED> instruction: 0x33282974
    6efc:	29353c3c 	ldmdbcs	r5!, {r2, r3, r4, r5, sl, fp, ip, sp}
    6f00:	50470029 	subpl	r0, r7, r9, lsr #32
    6f04:	455f4d54 	ldrbmi	r4, [pc, #-3412]	; 61b8 <_Min_Stack_Size+0x5db8>
    6f08:	52545458 	subspl	r5, r4, #88, 8	; 0x58000000
    6f0c:	535f4749 	cmppl	pc, #19136512	; 0x1240000
    6f10:	4c504d41 	mrrcmi	13, 4, r4, r0, cr1
    6f14:	5f474e49 	svcpl	0x00474e49
    6f18:	53544466 	cmppl	r4, #1711276032	; 0x66000000
    6f1c:	5f4f4e5f 	svcpl	0x004f4e5f
    6f20:	544c4946 	strbpl	r4, [ip], #-2374	; 0xfffff6ba
    6f24:	28205245 	stmdacs	r0!, {r0, r2, r6, r9, ip, lr}
    6f28:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    6f2c:	5f363174 	svcpl	0x00363174
    6f30:	30282974 	eorcc	r2, r8, r4, ror r9
    6f34:	29383c3c 	ldmdbcs	r8!, {r2, r3, r4, r5, sl, fp, ip, sp}
    6f38:	48430029 	stmdami	r3, {r0, r3, r5}^
    6f3c:	6572505f 	ldrbvs	r5, [r2, #-95]!	; 0xffffffa1
    6f40:	64616f6c 	strbtvs	r6, [r1], #-3948	; 0xfffff094
    6f44:	62616e45 	rsbvs	r6, r1, #1104	; 0x450
    6f48:	4700656c 	strmi	r6, [r0, -ip, ror #10]
    6f4c:	5f4d5450 	svcpl	0x004d5450
    6f50:	495f4843 	ldmdbmi	pc, {r0, r1, r6, fp, lr}^	; <UNPREDICTABLE>
    6f54:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    6f58:	4d41535f 	stclmi	3, cr5, [r1, #-380]	; 0xfffffe84
    6f5c:	4e494c50 	mcrmi	12, 2, r4, cr9, cr0, {2}
    6f60:	44665f47 	strbtmi	r5, [r6], #-3911	; 0xfffff0b9
    6f64:	4e5f5354 	mrcmi	3, 2, r5, cr15, cr4, {2}
    6f68:	49465f4f 	stmdbmi	r6, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    6f6c:	5245544c 	subpl	r5, r5, #76, 8	; 0x4c000000
    6f70:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    6f74:	31746e69 	cmncc	r4, r9, ror #28
    6f78:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    6f7c:	3c3c3028 	ldccc	0, cr3, [ip], #-160	; 0xffffff60
    6f80:	00292934 	eoreq	r2, r9, r4, lsr r9
    6f84:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    6f88:	5458455f 	ldrbpl	r4, [r8], #-1375	; 0xfffffaa1
    6f8c:	47495254 	smlsldmi	r5, r9, r4, r2
    6f90:	4552505f 	ldrbmi	r5, [r2, #-95]	; 0xffffffa1
    6f94:	414c4353 	cmpmi	ip, r3, asr r3
    6f98:	445f5245 	ldrbmi	r5, [pc], #-581	; 6fa0 <_Min_Stack_Size+0x6ba0>
    6f9c:	325f5649 	subscc	r5, pc, #76546048	; 0x4900000
    6fa0:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    6fa4:	31746e69 	cmncc	r4, r9, ror #28
    6fa8:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    6fac:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    6fb0:	29293231 	stmdbcs	r9!, {r0, r4, r5, r9, ip, sp}
    6fb4:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    6fb8:	75415f4d 	strbvc	r5, [r1, #-3917]	; 0xfffff0b3
    6fbc:	65526f74 	ldrbvs	r6, [r2, #-3956]	; 0xfffff08c
    6fc0:	64616f6c 	strbtvs	r6, [r1], #-3948	; 0xfffff094
    6fc4:	61647055 	qdsubvs	r7, r5, r4
    6fc8:	47006574 	smlsdxmi	r0, r4, r5, r6
    6fcc:	5f4d5450 	svcpl	0x004d5450
    6fd0:	5f515249 	svcpl	0x00515249
    6fd4:	435f4e45 	cmpmi	pc, #1104	; 0x450
    6fd8:	45493143 	strbmi	r3, [r9, #-323]	; 0xfffffebd
    6fdc:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    6fe0:	31746e69 	cmncc	r4, r9, ror #28
    6fe4:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    6fe8:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    6fec:	00292931 	eoreq	r2, r9, r1, lsr r9
    6ff0:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    6ff4:	5458455f 	ldrbpl	r4, [r8], #-1375	; 0xfffffaa1
    6ff8:	47495254 	smlsldmi	r5, r9, r4, r2
    6ffc:	4552505f 	ldrbmi	r5, [r2, #-95]	; 0xffffffa1
    7000:	414c4353 	cmpmi	ip, r3, asr r3
    7004:	445f5245 	ldrbmi	r5, [pc], #-581	; 700c <_Min_Stack_Size+0x6c0c>
    7008:	385f5649 	ldmdacc	pc, {r0, r3, r6, r9, sl, ip, lr}^	; <UNPREDICTABLE>
    700c:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    7010:	31746e69 	cmncc	r4, r9, ror #28
    7014:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    7018:	3c3c3328 	ldccc	3, cr3, [ip], #-160	; 0xffffff60
    701c:	29293231 	stmdbcs	r9!, {r0, r4, r5, r9, ip, sp}
    7020:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7024:	48435f4d 	stmdami	r3, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    7028:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    702c:	5f545550 	svcpl	0x00545550
    7030:	5f78434f 	svcpl	0x0078434f
    7034:	28204e4f 	stmdacs	r0!, {r0, r1, r2, r3, r6, r9, sl, fp, lr}
    7038:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    703c:	5f363174 	svcpl	0x00363174
    7040:	31282974 			; <UNDEFINED> instruction: 0x31282974
    7044:	29303c3c 	ldmdbcs	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    7048:	48430029 	stmdami	r3, {r0, r3, r5}^
    704c:	454e4e41 	strbmi	r4, [lr, #-3649]	; 0xfffff1bf
    7050:	5f345f4c 	svcpl	0x00345f4c
    7054:	45444e49 	strbmi	r4, [r4, #-3657]	; 0xfffff1b7
    7058:	28282058 	stmdacs	r8!, {r3, r4, r6, sp}
    705c:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7060:	745f3631 	ldrbvc	r3, [pc], #-1585	; 7068 <_Min_Stack_Size+0x6c68>
    7064:	00293329 	eoreq	r3, r9, r9, lsr #6
    7068:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    706c:	5f48435f 	svcpl	0x0048435f
    7070:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    7074:	41535f54 	cmpmi	r3, r4, asr pc
    7078:	494c504d 	stmdbmi	ip, {r0, r2, r3, r6, ip, lr}^
    707c:	665f474e 	ldrbvs	r4, [pc], -lr, asr #14
    7080:	4e494b43 	vmlsmi.f64	d20, d9, d3
    7084:	5f4e5f54 	svcpl	0x004e5f54
    7088:	28282032 	stmdacs	r8!, {r1, r4, r5, sp}
    708c:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7090:	745f3631 	ldrbvc	r3, [pc], #-1585	; 7098 <_Min_Stack_Size+0x6c98>
    7094:	3c312829 	ldccc	8, cr2, [r1], #-164	; 0xffffff5c
    7098:	2929343c 	stmdbcs	r9!, {r2, r3, r4, r5, sl, ip, sp}
    709c:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    70a0:	58455f4d 	stmdapl	r5, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    70a4:	49525454 	ldmdbmi	r2, {r2, r4, r6, sl, ip, lr}^
    70a8:	41535f47 	cmpmi	r3, r7, asr #30
    70ac:	494c504d 	stmdbmi	ip, {r0, r2, r3, r6, ip, lr}^
    70b0:	665f474e 	ldrbvs	r4, [pc], -lr, asr #14
    70b4:	5f535444 	svcpl	0x00535444
    70b8:	5f564944 	svcpl	0x00564944
    70bc:	5f4e5f32 	svcpl	0x004e5f32
    70c0:	28282038 	stmdacs	r8!, {r3, r4, r5, sp}
    70c4:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    70c8:	745f3631 	ldrbvc	r3, [pc], #-1585	; 70d0 <_Min_Stack_Size+0x6cd0>
    70cc:	3c352829 	ldccc	8, cr2, [r5], #-164	; 0xffffff5c
    70d0:	2929383c 	stmdbcs	r9!, {r2, r3, r4, r5, fp, ip, sp}
    70d4:	4d434300 	stclmi	3, cr4, [r3, #-0]
    70d8:	68435f52 	stmdavs	r3, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    70dc:	656e6e61 	strbvs	r6, [lr, #-3681]!	; 0xfffff19f
    70e0:	68535f6c 	ldmdavs	r3, {r2, r3, r5, r6, r8, r9, sl, fp, ip, lr}^
    70e4:	00746669 	rsbseq	r6, r4, r9, ror #12
    70e8:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    70ec:	5f48435f 	svcpl	0x0048435f
    70f0:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    70f4:	41535f54 	cmpmi	r3, r4, asr pc
    70f8:	494c504d 	stmdbmi	ip, {r0, r2, r3, r6, ip, lr}^
    70fc:	665f474e 	ldrbvs	r4, [pc], -lr, asr #14
    7100:	5f535444 	svcpl	0x00535444
    7104:	5f564944 	svcpl	0x00564944
    7108:	5f4e5f32 	svcpl	0x004e5f32
    710c:	28282038 	stmdacs	r8!, {r3, r4, r5, sp}
    7110:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7114:	745f3631 	ldrbvc	r3, [pc], #-1585	; 711c <_Min_Stack_Size+0x6d1c>
    7118:	3c352829 	ldccc	8, cr2, [r5], #-164	; 0xffffff5c
    711c:	2929343c 	stmdbcs	r9!, {r2, r3, r4, r5, sl, ip, sp}
    7120:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7124:	48435f4d 	stmdami	r3, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    7128:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    712c:	5f545550 	svcpl	0x00545550
    7130:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    7134:	5445535f 	strbpl	r5, [r5], #-863	; 0xfffffca1
    7138:	5443415f 	strbpl	r4, [r3], #-351	; 0xfffffea1
    713c:	5f455649 	svcpl	0x00455649
    7140:	4556454c 	ldrbmi	r4, [r6, #-1356]	; 0xfffffab4
    7144:	4e4f5f4c 	cdpmi	15, 4, cr5, cr15, cr12, {2}
    7148:	54414d5f 	strbpl	r4, [r1], #-3423	; 0xfffff2a1
    714c:	28204843 	stmdacs	r0!, {r0, r1, r6, fp, lr}
    7150:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    7154:	5f363174 	svcpl	0x00363174
    7158:	31282974 			; <UNDEFINED> instruction: 0x31282974
    715c:	29343c3c 	ldmdbcs	r4!, {r2, r3, r4, r5, sl, fp, ip, sp}
    7160:	50470029 	subpl	r0, r7, r9, lsr #32
    7164:	455f4d54 	ldrbmi	r4, [pc, #-3412]	; 6418 <_Min_Stack_Size+0x6018>
    7168:	52545458 	subspl	r5, r4, #88, 8	; 0x58000000
    716c:	535f4749 	cmppl	pc, #19136512	; 0x1240000
    7170:	4c504d41 	mrrcmi	13, 4, r4, r0, cr1
    7174:	5f474e49 	svcpl	0x00474e49
    7178:	53544466 	cmppl	r4, #1711276032	; 0x66000000
    717c:	5649445f 			; <UNDEFINED> instruction: 0x5649445f
    7180:	4e5f385f 	mrcmi	8, 2, r3, cr15, cr15, {2}
    7184:	2820365f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r9, sl, ip, sp}
    7188:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    718c:	5f363174 	svcpl	0x00363174
    7190:	38282974 	stmdacc	r8!, {r2, r4, r5, r6, r8, fp, sp}
    7194:	29383c3c 	ldmdbcs	r8!, {r2, r3, r4, r5, sl, fp, ip, sp}
    7198:	69540029 	ldmdbvs	r4, {r0, r3, r5}^
    719c:	4700586d 	strmi	r5, [r0, -sp, ror #16]
    71a0:	5f4d5450 	svcpl	0x004d5450
    71a4:	5f434d53 	svcpl	0x00434d53
    71a8:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    71ac:	434e455f 	movtmi	r4, #58719	; 0xe55f
    71b0:	5245444f 	subpl	r4, r5, #1325400064	; 0x4f000000
    71b4:	2820325f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r9, ip, sp}
    71b8:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    71bc:	5f363174 	svcpl	0x00363174
    71c0:	29322974 	ldmdbcs	r2!, {r2, r4, r5, r6, r8, fp, sp}
    71c4:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    71c8:	48435f4d 	stmdami	r3, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    71cc:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    71d0:	5f545550 	svcpl	0x00545550
    71d4:	41484542 	cmpmi	r8, r2, asr #10
    71d8:	5f534556 	svcpl	0x00534556
    71dc:	4d524f4e 	ldclmi	15, cr4, [r2, #-312]	; 0xfffffec8
    71e0:	594c4c41 	stmdbpl	ip, {r0, r6, sl, fp, lr}^
    71e4:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    71e8:	31746e69 	cmncc	r4, r9, ror #28
    71ec:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    71f0:	3c3c3028 	ldccc	0, cr3, [ip], #-160	; 0xffffff60
    71f4:	00292932 	eoreq	r2, r9, r2, lsr r9
    71f8:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    71fc:	434d535f 	movtmi	r5, #54111	; 0xd35f
    7200:	444f4d5f 	strbmi	r4, [pc], #-3423	; 7208 <_Min_Stack_Size+0x6e08>
    7204:	4e455f45 	cdpmi	15, 4, cr5, cr5, cr5, {2}
    7208:	45444f43 	strbmi	r4, [r4, #-3907]	; 0xfffff0bd
    720c:	20315f52 	eorscs	r5, r1, r2, asr pc
    7210:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    7214:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    7218:	3129745f 			; <UNDEFINED> instruction: 0x3129745f
    721c:	50470029 	subpl	r0, r7, r9, lsr #32
    7220:	455f4d54 	ldrbmi	r4, [pc, #-3412]	; 64d4 <_Min_Stack_Size+0x60d4>
    7224:	5f454744 	svcpl	0x00454744
    7228:	47494c41 	strbmi	r4, [r9, -r1, asr #24]
    722c:	5f44454e 	svcpl	0x0044454e
    7230:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    7234:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    7238:	31746e69 	cmncc	r4, r9, ror #28
    723c:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    7240:	3c3c3028 	ldccc	0, cr3, [ip], #-160	; 0xffffff60
    7244:	00292935 	eoreq	r2, r9, r5, lsr r9
    7248:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    724c:	5458455f 	ldrbpl	r4, [r8], #-1375	; 0xfffffaa1
    7250:	47495254 	smlsldmi	r5, r9, r4, r2
    7254:	414e455f 	cmpmi	lr, pc, asr r5
    7258:	20454c42 	subcs	r4, r5, r2, asr #24
    725c:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    7260:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    7264:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    7268:	313c3c31 	teqcc	ip, r1, lsr ip
    726c:	00292934 	eoreq	r2, r9, r4, lsr r9
    7270:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    7274:	7478455f 	ldrbtvc	r4, [r8], #-1375	; 0xfffffaa1
    7278:	616e7265 	cmnvs	lr, r5, ror #4
    727c:	72545f6c 	subsvc	r5, r4, #108, 30	; 0x1b0
    7280:	65676769 	strbvs	r6, [r7, #-1897]!	; 0xfffff897
