mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    7284:	00745f72 	rsbseq	r5, r4, r2, ror pc
    7288:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    728c:	554f435f 	strbpl	r4, [pc, #-863]	; 6f35 <_Min_Stack_Size+0x6b35>
    7290:	5245544e 	subpl	r5, r5, #1308622848	; 0x4e000000
    7294:	5249445f 	subpl	r4, r9, #1593835520	; 0x5f000000
    7298:	2050555f 	subscs	r5, r0, pc, asr r5
    729c:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    72a0:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    72a4:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    72a8:	343c3c30 	ldrtcc	r3, [ip], #-3120	; 0xfffff3d0
    72ac:	4d002929 	vstrmi.16	s4, [r0, #-82]	; 0xffffffae	; <UNPREDICTABLE>
    72b0:	5f4c4143 	svcpl	0x004c4143
    72b4:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    72b8:	696e495f 	stmdbvs	lr!, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    72bc:	434d0074 	movtmi	r0, #53364	; 0xd074
    72c0:	475f4c41 	ldrbmi	r4, [pc, -r1, asr #24]
    72c4:	5f4d5450 	svcpl	0x004d5450
    72c8:	41746547 	cmnmi	r4, r7, asr #10
    72cc:	526f7475 	rsbpl	r7, pc, #1962934272	; 0x75000000
    72d0:	616f6c65 	cmnvs	pc, r5, ror #24
    72d4:	50470064 	subpl	r0, r7, r4, rrx
    72d8:	435f4d54 	cmpmi	pc, #84, 26	; 0x1500
    72dc:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    72e0:	00745f67 	rsbseq	r5, r4, r7, ror #30
    72e4:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    72e8:	5f48435f 	svcpl	0x0048435f
    72ec:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    72f0:	41435f54 	cmpmi	r3, r4, asr pc
    72f4:	52555450 	subspl	r5, r5, #80, 8	; 0x50000000
    72f8:	4e4f5f45 	cdpmi	15, 4, cr5, cr15, cr5, {2}
    72fc:	455f4543 	ldrbmi	r4, [pc, #-1347]	; 6dc1 <_Min_Stack_Size+0x69c1>
    7300:	59524556 	ldmdbpl	r2, {r1, r2, r4, r6, r8, sl, lr}^
    7304:	455f385f 	ldrbmi	r3, [pc, #-2143]	; 6aad <_Min_Stack_Size+0x66ad>
    7308:	544e4556 	strbpl	r4, [lr], #-1366	; 0xfffffaaa
    730c:	28282053 	stmdacs	r8!, {r0, r1, r4, r6, sp}
    7310:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7314:	745f3631 	ldrbvc	r3, [pc], #-1585	; 731c <_Min_Stack_Size+0x6f1c>
    7318:	3c332829 	ldccc	8, cr2, [r3], #-164	; 0xffffff5c
    731c:	2929323c 	stmdbcs	r9!, {r2, r3, r4, r5, r9, ip, sp}
    7320:	4d434300 	stclmi	3, cr4, [r3, #-0]
    7324:	6e495f52 	mcrvs	15, 2, r5, cr9, cr2, {2}
    7328:	00786564 	rsbseq	r6, r8, r4, ror #10
    732c:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    7330:	5f48435f 	svcpl	0x0048435f
    7334:	5054554f 	subspl	r5, r4, pc, asr #10
    7338:	4d5f5455 	cfldrdmi	mvd5, [pc, #-340]	; 71ec <_Min_Stack_Size+0x6dec>
    733c:	5f45444f 	svcpl	0x0045444f
    7340:	314d5750 	cmpcc	sp, r0, asr r7
    7344:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    7348:	31746e69 	cmncc	r4, r9, ror #28
    734c:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    7350:	3c3c3628 	ldccc	6, cr3, [ip], #-160	; 0xffffff60
    7354:	00292934 	eoreq	r2, r9, r4, lsr r9
    7358:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    735c:	5458455f 	ldrbpl	r4, [r8], #-1375	; 0xfffffaa1
    7360:	47495254 	smlsldmi	r5, r9, r4, r2
    7364:	4d41535f 	stclmi	3, cr5, [r1, #-380]	; 0xfffffe84
    7368:	4e494c50 	mcrmi	12, 2, r4, cr9, cr0, {2}
    736c:	43665f47 	cmnmi	r6, #284	; 0x11c
    7370:	544e494b 	strbpl	r4, [lr], #-2379	; 0xfffff6b5
    7374:	345f4e5f 	ldrbcc	r4, [pc], #-3679	; 737c <_Min_Stack_Size+0x6f7c>
    7378:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    737c:	31746e69 	cmncc	r4, r9, ror #28
    7380:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    7384:	3c3c3228 	lfmcc	f3, 4, [ip], #-160	; 0xffffff60
    7388:	00292938 	eoreq	r2, r9, r8, lsr r9
    738c:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
    7390:	5450475f 	ldrbpl	r4, [r0], #-1887	; 0xfffff8a1
    7394:	65535f4d 	ldrbvs	r5, [r3, #-3917]	; 0xfffff0b3
    7398:	65725074 	ldrbvs	r5, [r2, #-116]!	; 0xffffff8c
    739c:	6c616353 	stclvs	3, cr6, [r1], #-332	; 0xfffffeb4
    73a0:	54007265 	strpl	r7, [r0], #-613	; 0xfffffd9b
    73a4:	5f344d49 	svcpl	0x00344d49
    73a8:	48515249 	ldmdami	r1, {r0, r3, r6, r9, ip, lr}^
    73ac:	6c646e61 	stclvs	14, cr6, [r4], #-388	; 0xfffffe7c
    73b0:	47007265 	strmi	r7, [r0, -r5, ror #4]
    73b4:	5f4d5450 	svcpl	0x004d5450
    73b8:	75706e49 	ldrbvc	r6, [r0, #-3657]!	; 0xfffff1b7
    73bc:	61684374 	smcvs	33844	; 0x8434
    73c0:	6c656e6e 	stclvs	14, cr6, [r5], #-440	; 0xfffffe48
    73c4:	6f435f58 	svcvs	0x00435f58
    73c8:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    73cc:	4300745f 	movwmi	r7, #1119	; 0x45f
    73d0:	6c435f48 	mcrrvs	15, 4, r5, r3, cr8
    73d4:	45726165 	ldrbmi	r6, [r2, #-357]!	; 0xfffffe9b
    73d8:	6c62616e 	stfvse	f6, [r2], #-440	; 0xfffffe48
    73dc:	50470065 	subpl	r0, r7, r5, rrx
    73e0:	435f4d54 	cmpmi	pc, #84, 26	; 0x1500
    73e4:	4e495f48 	cdpmi	15, 4, cr5, cr9, cr8, {2}
    73e8:	5f545550 	svcpl	0x00545550
    73ec:	504d4153 	subpl	r4, sp, r3, asr r1
    73f0:	474e494c 	strbmi	r4, [lr, -ip, asr #18]
    73f4:	5444665f 	strbpl	r6, [r4], #-1631	; 0xfffff9a1
    73f8:	49445f53 	stmdbmi	r4, {r0, r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    73fc:	36315f56 	shsaxcc	r5, r1, r6
    7400:	365f4e5f 			; <UNDEFINED> instruction: 0x365f4e5f
    7404:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    7408:	31746e69 	cmncc	r4, r9, ror #28
    740c:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    7410:	3c313128 	ldfccs	f3, [r1], #-160	; 0xffffff60
    7414:	2929343c 	stmdbcs	r9!, {r2, r3, r4, r5, sl, ip, sp}
    7418:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    741c:	48435f4d 	stmdami	r3, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    7420:	435f325f 	cmpmi	pc, #-268435451	; 0xf0000005
    7424:	5f524543 	svcpl	0x00524543
    7428:	46494853 			; <UNDEFINED> instruction: 0x46494853
    742c:	28282054 	stmdacs	r8!, {r2, r4, r6, sp}
    7430:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7434:	745f3631 	ldrbvc	r3, [pc], #-1585	; 743c <_Min_Stack_Size+0x703c>
    7438:	00293429 	eoreq	r3, r9, r9, lsr #8
    743c:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    7440:	5f48435f 	svcpl	0x0048435f
    7444:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    7448:	41535f54 	cmpmi	r3, r4, asr pc
    744c:	494c504d 	stmdbmi	ip, {r0, r2, r3, r6, ip, lr}^
    7450:	665f474e 	ldrbvs	r4, [pc], -lr, asr #14
    7454:	5f535444 	svcpl	0x00535444
    7458:	5f564944 	svcpl	0x00564944
    745c:	4e5f3631 	mrcmi	6, 2, r3, cr15, cr1, {1}
    7460:	2820385f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, fp, ip, sp}
    7464:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    7468:	5f363174 	svcpl	0x00363174
    746c:	31282974 			; <UNDEFINED> instruction: 0x31282974
    7470:	343c3c32 	ldrtcc	r3, [ip], #-3122	; 0xfffff3ce
    7474:	43002929 	movwmi	r2, #2345	; 0x929
    7478:	61465f48 	cmpvs	r6, r8, asr #30
    747c:	6e457473 	mcrvs	4, 2, r7, cr5, cr3, {3}
    7480:	656c6261 	strbvs	r6, [ip, #-609]!	; 0xfffffd9f
    7484:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7488:	4f435f4d 	svcmi	0x00435f4d
    748c:	45544e55 	ldrbmi	r4, [r4, #-3669]	; 0xfffff1ab
    7490:	4e455f52 	mcrmi	15, 2, r5, cr5, cr2, {2}
    7494:	454c4241 	strbmi	r4, [ip, #-577]	; 0xfffffdbf
    7498:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    749c:	31746e69 	cmncc	r4, r9, ror #28
    74a0:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    74a4:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    74a8:	00292930 	eoreq	r2, r9, r0, lsr r9
    74ac:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    74b0:	5f48435f 	svcpl	0x0048435f
    74b4:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    74b8:	41535f54 	cmpmi	r3, r4, asr pc
    74bc:	494c504d 	stmdbmi	ip, {r0, r2, r3, r6, ip, lr}^
    74c0:	665f474e 	ldrbvs	r4, [pc], -lr, asr #14
    74c4:	5f535444 	svcpl	0x00535444
    74c8:	5f564944 	svcpl	0x00564944
    74cc:	4e5f3233 	mrcmi	2, 2, r3, cr15, cr3, {1}
    74d0:	2820365f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r9, sl, ip, sp}
    74d4:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    74d8:	5f363174 	svcpl	0x00363174
    74dc:	31282974 			; <UNDEFINED> instruction: 0x31282974
    74e0:	343c3c34 	ldrtcc	r3, [ip], #-3124	; 0xfffff3cc
    74e4:	47002929 	strmi	r2, [r0, -r9, lsr #18]
    74e8:	5f4d5450 	svcpl	0x004d5450
    74ec:	495f4843 	ldmdbmi	pc, {r0, r1, r6, fp, lr}^	; <UNPREDICTABLE>
    74f0:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    74f4:	4d41535f 	stclmi	3, cr5, [r1, #-380]	; 0xfffffe84
    74f8:	4e494c50 	mcrmi	12, 2, r4, cr9, cr0, {2}
    74fc:	43665f47 	cmnmi	r6, #284	; 0x11c
    7500:	544e494b 	strbpl	r4, [lr], #-2379	; 0xfffff6b5
    7504:	385f4e5f 	ldmdacc	pc, {r0, r1, r2, r3, r4, r6, r9, sl, fp, lr}^	; <UNPREDICTABLE>
    7508:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    750c:	31746e69 	cmncc	r4, r9, ror #28
    7510:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    7514:	3c3c3328 	ldccc	3, cr3, [ip], #-160	; 0xffffff60
    7518:	00292934 	eoreq	r2, r9, r4, lsr r9
    751c:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    7520:	5f48435f 	svcpl	0x0048435f
    7524:	5f524944 	svcpl	0x00524944
    7528:	5054554f 	subspl	r5, r4, pc, asr #10
    752c:	28205455 	stmdacs	r0!, {r0, r2, r4, r6, sl, ip, lr}
    7530:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    7534:	5f363174 	svcpl	0x00363174
    7538:	29302974 	ldmdbcs	r0!, {r2, r4, r5, r6, r8, fp, sp}
    753c:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7540:	50555f4d 	subspl	r5, r5, sp, asr #30
    7544:	45544144 	ldrbmi	r4, [r4, #-324]	; 0xfffffebc
    7548:	4556455f 	ldrbmi	r4, [r6, #-1375]	; 0xfffffaa1
    754c:	445f544e 	ldrbmi	r5, [pc], #-1102	; 7554 <_Min_Stack_Size+0x7154>
    7550:	42415349 	submi	r5, r1, #603979777	; 0x24000001
    7554:	2820454c 	stmdacs	r0!, {r2, r3, r6, r8, sl, lr}
    7558:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    755c:	5f363174 	svcpl	0x00363174
    7560:	31282974 			; <UNDEFINED> instruction: 0x31282974
    7564:	29313c3c 	ldmdbcs	r1!, {r2, r3, r4, r5, sl, fp, ip, sp}
    7568:	50470029 	subpl	r0, r7, r9, lsr #32
    756c:	455f4d54 	ldrbmi	r4, [pc, #-3412]	; 6820 <_Min_Stack_Size+0x6420>
    7570:	52545458 	subspl	r5, r4, #88, 8	; 0x58000000
    7574:	505f4749 	subspl	r4, pc, r9, asr #14
    7578:	52414c4f 	subpl	r4, r1, #20224	; 0x4f00
    757c:	5f595449 	svcpl	0x00595449
    7580:	4c4c4146 	stfmie	f4, [ip], {70}	; 0x46
    7584:	20474e49 	subcs	r4, r7, r9, asr #28
    7588:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    758c:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    7590:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    7594:	313c3c31 	teqcc	ip, r1, lsr ip
    7598:	00292935 	eoreq	r2, r9, r5, lsr r9
    759c:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    75a0:	5f48435f 	svcpl	0x0048435f
    75a4:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    75a8:	41535f54 	cmpmi	r3, r4, asr pc
    75ac:	494c504d 	stmdbmi	ip, {r0, r2, r3, r6, ip, lr}^
    75b0:	665f474e 	ldrbvs	r4, [pc], -lr, asr #14
    75b4:	5f535444 	svcpl	0x00535444
    75b8:	5f564944 	svcpl	0x00564944
    75bc:	4e5f3233 	mrcmi	2, 2, r3, cr15, cr3, {1}
    75c0:	2820385f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, fp, ip, sp}
    75c4:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    75c8:	5f363174 	svcpl	0x00363174
    75cc:	31282974 			; <UNDEFINED> instruction: 0x31282974
    75d0:	343c3c35 	ldrtcc	r3, [ip], #-3125	; 0xfffff3cb
    75d4:	47002929 	strmi	r2, [r0, -r9, lsr #18]
    75d8:	5f4d5450 	svcpl	0x004d5450
    75dc:	7074754f 	rsbsvc	r7, r4, pc, asr #10
    75e0:	68437475 	stmdavs	r3, {r0, r2, r4, r5, r6, sl, ip, sp, lr}^
    75e4:	656e6e61 	strbvs	r6, [lr, #-3681]!	; 0xfffff19f
    75e8:	4700586c 	strmi	r5, [r0, -ip, ror #16]
    75ec:	5f4d5450 	svcpl	0x004d5450
    75f0:	54545845 	ldrbpl	r5, [r4], #-2117	; 0xfffff7bb
    75f4:	5f474952 	svcpl	0x00474952
    75f8:	504d4153 	subpl	r4, sp, r3, asr r1
    75fc:	474e494c 	strbmi	r4, [lr, -ip, asr #18]
    7600:	5444665f 	strbpl	r6, [r4], #-1631	; 0xfffff9a1
    7604:	49445f53 	stmdbmi	r4, {r0, r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    7608:	5f345f56 	svcpl	0x00345f56
    760c:	20365f4e 	eorscs	r5, r6, lr, asr #30
    7610:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    7614:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    7618:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    761c:	383c3c36 	ldmdacc	ip!, {r1, r2, r4, r5, sl, fp, ip, sp}
    7620:	43002929 	movwmi	r2, #2345	; 0x929
    7624:	6e495f48 	cdpvs	15, 4, cr5, cr9, cr8, {2}
    7628:	50747570 	rsbspl	r7, r4, r0, ror r5
    762c:	63536572 	cmpvs	r3, #478150656	; 0x1c800000
    7630:	72656c61 	rsbvc	r6, r5, #24832	; 0x6100
    7634:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7638:	48435f4d 	stmdami	r3, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    763c:	5249445f 	subpl	r4, r9, #1593835520	; 0x5f000000
    7640:	504e495f 	subpl	r4, lr, pc, asr r9
    7644:	4d5f5455 	cfldrdmi	mvd5, [pc, #-340]	; 74f8 <_Min_Stack_Size+0x70f8>
    7648:	45505041 	ldrbmi	r5, [r0, #-65]	; 0xffffffbf
    764c:	52545f44 	subspl	r5, r4, #68, 30	; 0x110
    7650:	28282043 	stmdacs	r8!, {r0, r1, r6, sp}
    7654:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7658:	745f3631 	ldrbvc	r3, [pc], #-1585	; 7660 <_Min_Stack_Size+0x7260>
    765c:	3c332829 	ldccc	8, cr2, [r3], #-164	; 0xffffff5c
    7660:	2929303c 	stmdbcs	r9!, {r2, r3, r4, r5, ip, sp}
    7664:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7668:	50555f4d 	subspl	r5, r5, sp, asr #30
    766c:	45544144 	ldrbmi	r4, [r4, #-324]	; 0xfffffebc
    7670:	4e45475f 	mcrmi	7, 2, r4, cr5, cr15, {2}
    7674:	54415245 	strbpl	r5, [r1], #-581	; 0xfffffdbb
    7678:	204e4f49 	subcs	r4, lr, r9, asr #30
    767c:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    7680:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    7684:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    7688:	303c3c31 	eorscc	r3, ip, r1, lsr ip
    768c:	47002929 	strmi	r2, [r0, -r9, lsr #18]
    7690:	5f4d5450 	svcpl	0x004d5450
    7694:	5f515249 	svcpl	0x00515249
    7698:	435f4e45 	cmpmi	pc, #1104	; 0x450
    769c:	45493343 	strbmi	r3, [r9, #-835]	; 0xfffffcbd
    76a0:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    76a4:	31746e69 	cmncc	r4, r9, ror #28
    76a8:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    76ac:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    76b0:	00292933 	eoreq	r2, r9, r3, lsr r9
    76b4:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    76b8:	5f48435f 	svcpl	0x0048435f
    76bc:	5054554f 	subspl	r5, r4, pc, asr #10
    76c0:	4d5f5455 	cfldrdmi	mvd5, [pc, #-340]	; 7574 <_Min_Stack_Size+0x7174>
    76c4:	5f45444f 	svcpl	0x0045444f
    76c8:	324d5750 	subcc	r5, sp, #80, 14	; 0x1400000
    76cc:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    76d0:	31746e69 	cmncc	r4, r9, ror #28
    76d4:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    76d8:	3c3c3728 	ldccc	7, cr3, [ip], #-160	; 0xffffff60
    76dc:	00292934 	eoreq	r2, r9, r4, lsr r9
    76e0:	455f4843 	ldrbmi	r4, [pc, #-2115]	; 6ea5 <_Min_Stack_Size+0x6aa5>
    76e4:	6c62616e 	stfvse	f6, [r2], #-440	; 0xfffffe48
    76e8:	50470065 	subpl	r0, r7, r5, rrx
    76ec:	455f4d54 	ldrbmi	r4, [pc, #-3412]	; 69a0 <_Min_Stack_Size+0x65a0>
    76f0:	52545458 	subspl	r5, r4, #88, 8	; 0x58000000
    76f4:	535f4749 	cmppl	pc, #19136512	; 0x1240000
    76f8:	4c504d41 	mrrcmi	13, 4, r4, r0, cr1
    76fc:	5f474e49 	svcpl	0x00474e49
    7700:	494b4366 	stmdbmi	fp, {r1, r2, r5, r6, r8, r9, lr}^
    7704:	4e5f544e 	cdpmi	4, 5, cr5, cr15, cr14, {2}
    7708:	2820325f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r9, ip, sp}
    770c:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    7710:	5f363174 	svcpl	0x00363174
    7714:	31282974 			; <UNDEFINED> instruction: 0x31282974
    7718:	29383c3c 	ldmdbcs	r8!, {r2, r3, r4, r5, sl, fp, ip, sp}
    771c:	48430029 	stmdami	r3, {r0, r3, r5}^
    7720:	7269445f 	rsbvc	r4, r9, #1593835520	; 0x5f000000
    7724:	69746365 	ldmdbvs	r4!, {r0, r2, r5, r6, r8, r9, sp, lr}^
    7728:	45006e6f 	strmi	r6, [r0, #-3695]	; 0xfffff191
    772c:	52545458 	subspl	r5, r4, #88, 8	; 0x58000000
    7730:	505f4749 	subspl	r4, pc, r9, asr #14
    7734:	63536572 	cmpvs	r3, #478150656	; 0x1c800000
    7738:	72656c61 	rsbvc	r6, r5, #24832	; 0x6100
    773c:	4d495400 	cfstrdmi	mvd5, [r9, #-0]
    7740:	52495f32 	subpl	r5, r9, #50, 30	; 0xc8
    7744:	6e614851 	mcrvs	8, 3, r4, cr1, cr1, {2}
    7748:	72656c64 	rsbvc	r6, r5, #100, 24	; 0x6400
    774c:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7750:	48435f4d 	stmdami	r3, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    7754:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    7758:	5f545550 	svcpl	0x00545550
    775c:	41454c43 	cmpmi	r5, r3, asr #24
    7760:	49445f52 	stmdbmi	r4, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    7764:	4c424153 	stfmie	f4, [r2], {83}	; 0x53
    7768:	28282045 	stmdacs	r8!, {r0, r2, r6, sp}
    776c:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7770:	745f3631 	ldrbvc	r3, [pc], #-1585	; 7778 <_Min_Stack_Size+0x7378>
    7774:	3c302829 	ldccc	8, cr2, [r0], #-164	; 0xffffff5c
    7778:	2929373c 	stmdbcs	r9!, {r2, r3, r4, r5, r8, r9, sl, ip, sp}
    777c:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7780:	4d535f4d 	ldclmi	15, cr5, [r3, #-308]	; 0xfffffecc
    7784:	6f4d5f43 	svcvs	0x004d5f43
    7788:	47006564 	strmi	r6, [r0, -r4, ror #10]
    778c:	5f4d5450 	svcpl	0x004d5450
    7790:	495f4843 	ldmdbmi	pc, {r0, r1, r6, fp, lr}^	; <UNPREDICTABLE>
    7794:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    7798:	4d41535f 	stclmi	3, cr5, [r1, #-380]	; 0xfffffe84
    779c:	4e494c50 	mcrmi	12, 2, r4, cr9, cr0, {2}
    77a0:	44665f47 	strbtmi	r5, [r6], #-3911	; 0xfffff0b9
    77a4:	445f5354 	ldrbmi	r5, [pc], #-852	; 77ac <_Min_Stack_Size+0x73ac>
    77a8:	315f5649 	cmpcc	pc, r9, asr #12
    77ac:	5f4e5f36 	svcpl	0x004e5f36
    77b0:	28282035 	stmdacs	r8!, {r0, r2, r4, r5, sp}
    77b4:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    77b8:	745f3631 	ldrbvc	r3, [pc], #-1585	; 77c0 <_Min_Stack_Size+0x73c0>
    77bc:	30312829 	eorscc	r2, r1, r9, lsr #16
    77c0:	29343c3c 	ldmdbcs	r4!, {r2, r3, r4, r5, sl, fp, ip, sp}
    77c4:	50470029 	subpl	r0, r7, r9, lsr #32
    77c8:	455f4d54 	ldrbmi	r4, [pc, #-3412]	; 6a7c <_Min_Stack_Size+0x667c>
    77cc:	52545458 	subspl	r5, r4, #88, 8	; 0x58000000
    77d0:	535f4749 	cmppl	pc, #19136512	; 0x1240000
    77d4:	4c504d41 	mrrcmi	13, 4, r4, r0, cr1
    77d8:	5f474e49 	svcpl	0x00474e49
    77dc:	53544466 	cmppl	r4, #1711276032	; 0x66000000
    77e0:	5649445f 			; <UNDEFINED> instruction: 0x5649445f
    77e4:	5f32335f 	svcpl	0x0032335f
    77e8:	20365f4e 	eorscs	r5, r6, lr, asr #30
    77ec:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    77f0:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    77f4:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    77f8:	3c3c3431 	cfldrscc	mvf3, [ip], #-196	; 0xffffff3c
    77fc:	00292938 	eoreq	r2, r9, r8, lsr r9
    7800:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    7804:	706e495f 	rsbvc	r4, lr, pc, asr r9
    7808:	68437475 	stmdavs	r3, {r0, r2, r4, r5, r6, sl, ip, sp, lr}^
    780c:	656e6e61 	strbvs	r6, [lr, #-3681]!	; 0xfffff19f
    7810:	4700586c 	strmi	r5, [r0, -ip, ror #16]
    7814:	5f4d5450 	svcpl	0x004d5450
    7818:	445f4843 	ldrbmi	r4, [pc], #-2115	; 7820 <_Min_Stack_Size+0x7420>
    781c:	495f5249 	ldmdbmi	pc, {r0, r3, r6, r9, ip, lr}^	; <UNPREDICTABLE>
    7820:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    7824:	50414d5f 	subpl	r4, r1, pc, asr sp
    7828:	5f444550 	svcpl	0x00444550
    782c:	45544c41 	ldrbmi	r4, [r4, #-3137]	; 0xfffff3bf
    7830:	54414e52 	strbpl	r4, [r1], #-3666	; 0xfffff1ae
    7834:	49545f45 	ldmdbmi	r4, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
    7838:	28282078 	stmdacs	r8!, {r3, r4, r5, r6, sp}
    783c:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7840:	745f3631 	ldrbvc	r3, [pc], #-1585	; 7848 <_Min_Stack_Size+0x7448>
    7844:	3c322829 	ldccc	8, cr2, [r2], #-164	; 0xffffff5c
    7848:	2929303c 	stmdbcs	r9!, {r2, r3, r4, r5, ip, sp}
    784c:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7850:	50555f4d 	subspl	r5, r5, sp, asr #30
    7854:	45544144 	ldrbmi	r4, [r4, #-324]	; 0xfffffebc
    7858:	4556455f 	ldrbmi	r4, [r6, #-1375]	; 0xfffffaa1
    785c:	455f544e 	ldrbmi	r5, [pc, #-1102]	; 7416 <_Min_Stack_Size+0x7016>
    7860:	4c42414e 	stfmie	f4, [r2], {78}	; 0x4e
    7864:	28282045 	stmdacs	r8!, {r0, r2, r6, sp}
    7868:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    786c:	745f3631 	ldrbvc	r3, [pc], #-1585	; 7874 <_Min_Stack_Size+0x7474>
    7870:	3c302829 	ldccc	8, cr2, [r0], #-164	; 0xffffff5c
    7874:	2929313c 	stmdbcs	r9!, {r2, r3, r4, r5, r8, ip, sp}
    7878:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    787c:	48435f4d 	stmdami	r3, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    7880:	504e495f 	subpl	r4, lr, pc, asr r9
    7884:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    7888:	4c504d41 	mrrcmi	13, 4, r4, r0, cr1
    788c:	5f474e49 	svcpl	0x00474e49
    7890:	53544466 	cmppl	r4, #1711276032	; 0x66000000
    7894:	5649445f 			; <UNDEFINED> instruction: 0x5649445f
    7898:	5f32335f 	svcpl	0x0032335f
    789c:	20355f4e 	eorscs	r5, r5, lr, asr #30
    78a0:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    78a4:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    78a8:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    78ac:	3c3c3331 	ldccc	3, cr3, [ip], #-196	; 0xffffff3c
    78b0:	00292934 	eoreq	r2, r9, r4, lsr r9
    78b4:	784d4954 	stmdavc	sp, {r2, r4, r6, r8, fp, lr}^
    78b8:	4549445f 	strbmi	r4, [r9, #-1119]	; 0xfffffba1
    78bc:	50470052 	subpl	r0, r7, r2, asr r0
    78c0:	545f4d54 	ldrbpl	r4, [pc], #-3412	; 78c8 <_Min_Stack_Size+0x74c8>
    78c4:	64657079 	strbtvs	r7, [r5], #-121	; 0xffffff87
    78c8:	47006665 	strmi	r6, [r0, -r5, ror #12]
    78cc:	5f4d5450 	svcpl	0x004d5450
    78d0:	4f5f4843 	svcmi	0x005f4843
    78d4:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    78d8:	4f4d5f54 	svcmi	0x004d5f54
    78dc:	465f4544 	ldrbmi	r4, [pc], -r4, asr #10
    78e0:	4543524f 	strbmi	r5, [r3, #-591]	; 0xfffffdb1
    78e4:	414e495f 	cmpmi	lr, pc, asr r9
    78e8:	56495443 	strbpl	r5, [r9], -r3, asr #8
    78ec:	454c5f45 	strbmi	r5, [ip, #-3909]	; 0xfffff0bb
    78f0:	204c4556 	subcs	r4, ip, r6, asr r5
    78f4:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    78f8:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    78fc:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    7900:	343c3c34 	ldrtcc	r3, [ip], #-3124	; 0xfffff3cc
    7904:	47002929 	strmi	r2, [r0, -r9, lsr #18]
    7908:	5f4d5450 	svcpl	0x004d5450
    790c:	4f5f4843 	svcmi	0x005f4843
    7910:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    7914:	4c435f54 	mcrrmi	15, 5, r5, r3, cr4
    7918:	5f524145 	svcpl	0x00524145
    791c:	42414e45 	submi	r4, r1, #1104	; 0x450
    7920:	2820454c 	stmdacs	r0!, {r2, r3, r6, r8, sl, lr}
    7924:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    7928:	5f363174 	svcpl	0x00363174
    792c:	31282974 			; <UNDEFINED> instruction: 0x31282974
    7930:	29373c3c 	ldmdbcs	r7!, {r2, r3, r4, r5, sl, fp, ip, sp}
    7934:	50470029 	subpl	r0, r7, r9, lsr #32
    7938:	435f4d54 	cmpmi	pc, #84, 26	; 0x1500
    793c:	746e756f 	strbtvc	r7, [lr], #-1391	; 0xfffffa91
    7940:	69447265 	stmdbvs	r4, {r0, r2, r5, r6, r9, ip, sp, lr}^
    7944:	74636572 	strbtvc	r6, [r3], #-1394	; 0xfffffa8e
    7948:	006e6f69 	rsbeq	r6, lr, r9, ror #30
    794c:	52454343 	subpl	r4, r5, #201326593	; 0xc000001
    7950:	6168435f 	cmnvs	r8, pc, asr r3
    7954:	6c656e6e 	stclvs	14, cr6, [r5], #-440	; 0xfffffe48
    7958:	6968535f 	stmdbvs	r8!, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
    795c:	47007466 	strmi	r7, [r0, -r6, ror #8]
    7960:	5f4d5450 	svcpl	0x004d5450
    7964:	4f545541 	svcmi	0x00545541
    7968:	4c45525f 	sfmmi	f5, 2, [r5], {95}	; 0x5f
    796c:	5f44414f 	svcpl	0x0044414f
    7970:	41445055 	qdaddmi	r5, r5, r4
    7974:	4f5f4554 	svcmi	0x005f4554
    7978:	50555f4e 	subspl	r5, r5, lr, asr #30
    797c:	45544144 	ldrbmi	r4, [r4, #-324]	; 0xfffffebc
    7980:	4556455f 	ldrbmi	r4, [r6, #-1375]	; 0xfffffaa1
