mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    7984:	2820544e 	stmdacs	r0!, {r1, r2, r3, r6, sl, ip, lr}
    7988:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    798c:	5f363174 	svcpl	0x00363174
    7990:	31282974 			; <UNDEFINED> instruction: 0x31282974
    7994:	29373c3c 	ldmdbcs	r7!, {r2, r3, r4, r5, sl, fp, ip, sp}
    7998:	50470029 	subpl	r0, r7, r9, lsr #32
    799c:	455f4d54 	ldrbmi	r4, [pc, #-3412]	; 6c50 <_Min_Stack_Size+0x6850>
    79a0:	52545458 	subspl	r5, r4, #88, 8	; 0x58000000
    79a4:	535f4749 	cmppl	pc, #19136512	; 0x1240000
    79a8:	4c504d41 	mrrcmi	13, 4, r4, r0, cr1
    79ac:	5f474e49 	svcpl	0x00474e49
    79b0:	53544466 	cmppl	r4, #1711276032	; 0x66000000
    79b4:	5649445f 			; <UNDEFINED> instruction: 0x5649445f
    79b8:	5f36315f 	svcpl	0x0036315f
    79bc:	20355f4e 	eorscs	r5, r5, lr, asr #30
    79c0:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    79c4:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    79c8:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    79cc:	3c3c3031 	ldccc	0, cr3, [ip], #-196	; 0xffffff3c
    79d0:	00292938 	eoreq	r2, r9, r8, lsr r9
    79d4:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    79d8:	5f48435f 	svcpl	0x0048435f
    79dc:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    79e0:	41435f54 	cmpmi	r3, r4, asr pc
    79e4:	52555450 	subspl	r5, r5, #80, 8	; 0x50000000
    79e8:	49445f45 	stmdbmi	r4, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
    79ec:	4c424153 	stfmie	f4, [r2], {83}	; 0x53
    79f0:	28204445 	stmdacs	r0!, {r0, r2, r6, sl, lr}
    79f4:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    79f8:	5f363174 	svcpl	0x00363174
    79fc:	30282974 	eorcc	r2, r8, r4, ror r9
    7a00:	29303c3c 	ldmdbcs	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    7a04:	50470029 	subpl	r0, r7, r9, lsr #32
    7a08:	455f4d54 	ldrbmi	r4, [pc, #-3412]	; 6cbc <_Min_Stack_Size+0x68bc>
    7a0c:	52545458 	subspl	r5, r4, #88, 8	; 0x58000000
    7a10:	505f4749 	subspl	r4, pc, r9, asr #14
    7a14:	43534552 	cmpmi	r3, #343932928	; 0x14800000
    7a18:	5245414c 	subpl	r4, r5, #76, 2
    7a1c:	5649445f 			; <UNDEFINED> instruction: 0x5649445f
    7a20:	2820345f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, sl, ip, sp}
    7a24:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    7a28:	5f363174 	svcpl	0x00363174
    7a2c:	32282974 	eorcc	r2, r8, #116, 18	; 0x1d0000
    7a30:	32313c3c 	eorscc	r3, r1, #60, 24	; 0x3c00
    7a34:	43002929 	movwmi	r2, #2345	; 0x929
    7a38:	56785243 	ldrbtpl	r5, [r8], -r3, asr #4
    7a3c:	65756c61 	ldrbvs	r6, [r5, #-3169]!	; 0xfffff39f
    7a40:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7a44:	4d535f4d 	ldclmi	15, cr5, [r3, #-308]	; 0xfffffecc
    7a48:	48435f43 	stmdami	r3, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    7a4c:	454e4e41 	strbmi	r4, [lr, #-3649]	; 0xfffff1bf
    7a50:	20315f4c 	eorscs	r5, r1, ip, asr #30
    7a54:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    7a58:	5f38746e 	svcpl	0x0038746e
    7a5c:	29312974 	ldmdbcs	r1!, {r2, r4, r5, r6, r8, fp, sp}
    7a60:	5f484300 	svcpl	0x00484300
    7a64:	75706e49 	ldrbvc	r6, [r0, #-3657]!	; 0xfffff1b7
    7a68:	70614374 	rsbvc	r4, r1, r4, ror r3
    7a6c:	65727574 	ldrbvs	r7, [r2, #-1396]!	; 0xfffffa8c
    7a70:	62616e45 	rsbvs	r6, r1, #1104	; 0x450
    7a74:	4700656c 	strmi	r6, [r0, -ip, ror #10]
    7a78:	5f4d5450 	svcpl	0x004d5450
    7a7c:	495f4843 	ldmdbmi	pc, {r0, r1, r6, fp, lr}^	; <UNPREDICTABLE>
    7a80:	5455504e 	ldrbpl	r5, [r5], #-78	; 0xffffffb2
    7a84:	5041435f 	subpl	r4, r1, pc, asr r3
    7a88:	45525554 	ldrbmi	r5, [r2, #-1364]	; 0xfffffaac
    7a8c:	414e455f 	cmpmi	lr, pc, asr r5
    7a90:	44454c42 	strbmi	r4, [r5], #-3138	; 0xfffff3be
    7a94:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    7a98:	31746e69 	cmncc	r4, r9, ror #28
    7a9c:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    7aa0:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    7aa4:	00292930 	eoreq	r2, r9, r0, lsr r9
    7aa8:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
    7aac:	5450475f 	ldrbpl	r4, [r0], #-1887	; 0xfffff8a1
    7ab0:	65475f4d 	strbvs	r5, [r7, #-3917]	; 0xfffff0b3
    7ab4:	65725074 	ldrbvs	r5, [r2, #-116]!	; 0xffffff8c
    7ab8:	6c616353 	stclvs	3, cr6, [r1], #-332	; 0xfffffeb4
    7abc:	47007265 	strmi	r7, [r0, -r5, ror #4]
    7ac0:	5f4d5450 	svcpl	0x004d5450
    7ac4:	5f434d53 	svcpl	0x00434d53
    7ac8:	4e414843 	cdpmi	8, 4, cr4, cr1, cr3, {2}
    7acc:	5f4c454e 	svcpl	0x004c454e
    7ad0:	28282032 	stmdacs	r8!, {r1, r4, r5, sp}
    7ad4:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7ad8:	29745f38 	ldmdbcs	r4!, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    7adc:	47002932 	smladxmi	r0, r2, r9, r2
    7ae0:	5f4d5450 	svcpl	0x004d5450
    7ae4:	61647055 	qdsubvs	r7, r5, r4
    7ae8:	76456574 			; <UNDEFINED> instruction: 0x76456574
    7aec:	00746e65 	rsbseq	r6, r4, r5, ror #28
    7af0:	326d6954 	rsbcc	r6, sp, #84, 18	; 0x150000
    7af4:	6e616843 	cdpvs	8, 6, cr6, cr1, cr3, {2}
    7af8:	586c656e 	stmdapl	ip!, {r1, r2, r3, r5, r6, r8, sl, sp, lr}^
    7afc:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7b00:	58455f4d 	stmdapl	r5, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    7b04:	49525454 	ldmdbmi	r2, {r2, r4, r6, sl, ip, lr}^
    7b08:	52505f47 	subspl	r5, r0, #284	; 0x11c
    7b0c:	4c435345 	mcrrmi	3, 4, r5, r3, cr5
    7b10:	5f524541 	svcpl	0x00524541
    7b14:	2046464f 	subcs	r4, r6, pc, asr #12
    7b18:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    7b1c:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    7b20:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    7b24:	313c3c30 	teqcc	ip, r0, lsr ip
    7b28:	00292932 	eoreq	r2, r9, r2, lsr r9
    7b2c:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    7b30:	5f48435f 	svcpl	0x0048435f
    7b34:	414c4f50 	cmpmi	ip, r0, asr pc
    7b38:	59544952 	ldmdbpl	r4, {r1, r4, r6, r8, fp, lr}^
    7b3c:	4c41465f 	mcrrmi	6, 5, r4, r1, cr15
    7b40:	474e494c 	strbmi	r4, [lr, -ip, asr #18]
    7b44:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    7b48:	31746e69 	cmncc	r4, r9, ror #28
    7b4c:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    7b50:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    7b54:	00292931 	eoreq	r2, r9, r1, lsr r9
    7b58:	54545845 	ldrbpl	r5, [r4], #-2117	; 0xfffff7bb
    7b5c:	5f474952 	svcpl	0x00474952
    7b60:	616c6f50 	cmnvs	ip, r0, asr pc
    7b64:	79746972 	ldmdbvc	r4!, {r1, r4, r5, r6, r8, fp, sp, lr}^
    7b68:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7b6c:	48435f4d 	stmdami	r3, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    7b70:	435f315f 	cmpmi	pc, #-1073741801	; 0xc0000017
    7b74:	5f524543 	svcpl	0x00524543
    7b78:	46494853 			; <UNDEFINED> instruction: 0x46494853
    7b7c:	28282054 	stmdacs	r8!, {r2, r4, r6, sp}
    7b80:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7b84:	745f3631 	ldrbvc	r3, [pc], #-1585	; 7b8c <_Min_Stack_Size+0x778c>
    7b88:	00293029 	eoreq	r3, r9, r9, lsr #32
    7b8c:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    7b90:	5152495f 	cmppl	r2, pc, asr r9
    7b94:	5f4e455f 	svcpl	0x004e455f
    7b98:	49324343 	ldmdbmi	r2!, {r0, r1, r6, r8, r9, lr}
    7b9c:	28282045 	stmdacs	r8!, {r0, r2, r6, sp}
    7ba0:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7ba4:	745f3631 	ldrbvc	r3, [pc], #-1585	; 7bac <_Min_Stack_Size+0x77ac>
    7ba8:	3c312829 	ldccc	8, cr2, [r1], #-164	; 0xffffff5c
    7bac:	2929323c 	stmdbcs	r9!, {r2, r3, r4, r5, r9, ip, sp}
    7bb0:	41434d00 	cmpmi	r3, r0, lsl #26
    7bb4:	50475f4c 	subpl	r5, r7, ip, asr #30
    7bb8:	535f4d54 	cmppl	pc, #84, 26	; 0x1500
    7bbc:	75417465 	strbvc	r7, [r1, #-1125]	; 0xfffffb9b
    7bc0:	65526f74 	ldrbvs	r6, [r2, #-3956]	; 0xfffff08c
    7bc4:	64616f6c 	strbtvs	r6, [r1], #-3948	; 0xfffff094
    7bc8:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7bcc:	58455f4d 	stmdapl	r5, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    7bd0:	49525454 	ldmdbmi	r2, {r2, r4, r6, sl, ip, lr}^
    7bd4:	4f505f47 	svcmi	0x00505f47
    7bd8:	4952414c 	ldmdbmi	r2, {r2, r3, r6, r8, lr}^
    7bdc:	525f5954 	subspl	r5, pc, #84, 18	; 0x150000
    7be0:	4e495349 	cdpmi	3, 4, cr5, cr9, cr9, {2}
    7be4:	28282047 	stmdacs	r8!, {r0, r1, r2, r6, sp}
    7be8:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7bec:	745f3631 	ldrbvc	r3, [pc], #-1585	; 7bf4 <_Min_Stack_Size+0x77f4>
    7bf0:	3c302829 	ldccc	8, cr2, [r0], #-164	; 0xffffff5c
    7bf4:	2935313c 	ldmdbcs	r5!, {r2, r3, r4, r5, r8, ip, sp}
    7bf8:	48430029 	stmdami	r3, {r0, r3, r5}^
    7bfc:	74754f5f 	ldrbtvc	r4, [r5], #-3935	; 0xfffff0a1
    7c00:	50747570 	rsbspl	r7, r4, r0, ror r5
    7c04:	72616c6f 	rsbvc	r6, r1, #28416	; 0x6f00
    7c08:	53797469 	cmnpl	r9, #1761607680	; 0x69000000
    7c0c:	63656c65 	cmnvs	r5, #25856	; 0x6500
    7c10:	00646574 	rsbeq	r6, r4, r4, ror r5
    7c14:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    7c18:	5458455f 	ldrbpl	r4, [r8], #-1375	; 0xfffffaa1
    7c1c:	47495254 	smlsldmi	r5, r9, r4, r2
    7c20:	4d41535f 	stclmi	3, cr5, [r1, #-380]	; 0xfffffe84
    7c24:	4e494c50 	mcrmi	12, 2, r4, cr9, cr0, {2}
    7c28:	44665f47 	strbtmi	r5, [r6], #-3911	; 0xfffff0b9
    7c2c:	445f5354 	ldrbmi	r5, [pc], #-852	; 7c34 <_Min_Stack_Size+0x7834>
    7c30:	335f5649 	cmpcc	pc, #76546048	; 0x4900000
    7c34:	5f4e5f32 	svcpl	0x004e5f32
    7c38:	28282035 	stmdacs	r8!, {r0, r2, r4, r5, sp}
    7c3c:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7c40:	745f3631 	ldrbvc	r3, [pc], #-1585	; 7c48 <_Min_Stack_Size+0x7848>
    7c44:	33312829 	teqcc	r1, #2686976	; 0x290000
    7c48:	29383c3c 	ldmdbcs	r8!, {r2, r3, r4, r5, sl, fp, ip, sp}
    7c4c:	50470029 	subpl	r0, r7, r9, lsr #32
    7c50:	495f4d54 	ldmdbmi	pc, {r2, r4, r6, r8, sl, fp, lr}^	; <UNPREDICTABLE>
    7c54:	455f5152 	ldrbmi	r5, [pc, #-338]	; 7b0a <_Min_Stack_Size+0x770a>
    7c58:	49545f4e 	ldmdbmi	r4, {r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    7c5c:	28282045 	stmdacs	r8!, {r0, r2, r6, sp}
    7c60:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7c64:	745f3631 	ldrbvc	r3, [pc], #-1585	; 7c6c <_Min_Stack_Size+0x786c>
    7c68:	3c312829 	ldccc	8, cr2, [r1], #-164	; 0xffffff5c
    7c6c:	2929363c 	stmdbcs	r9!, {r2, r3, r4, r5, r9, sl, ip, sp}
    7c70:	41434d00 	cmpmi	r3, r0, lsl #26
    7c74:	50475f4c 	subpl	r5, r7, ip, asr #30
    7c78:	475f4d54 			; <UNDEFINED> instruction: 0x475f4d54
    7c7c:	5f4f4950 	svcpl	0x004f4950
    7c80:	50746553 	rsbspl	r6, r4, r3, asr r5
    7c84:	00736e69 	rsbseq	r6, r3, r9, ror #28
    7c88:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    7c8c:	5f48435f 	svcpl	0x0048435f
    7c90:	43435f34 	movtmi	r5, #16180	; 0x3f34
    7c94:	535f524d 	cmppl	pc, #-805306364	; 0xd0000004
    7c98:	54464948 	strbpl	r4, [r6], #-2376	; 0xfffff6b8
    7c9c:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    7ca0:	31746e69 	cmncc	r4, r9, ror #28
    7ca4:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    7ca8:	47002938 	smladxmi	r0, r8, r9, r2
    7cac:	5f4d5450 	svcpl	0x004d5450
    7cb0:	5f434d53 	svcpl	0x00434d53
    7cb4:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    7cb8:	434e455f 	movtmi	r4, #58719	; 0xe55f
    7cbc:	5245444f 	subpl	r4, r5, #1325400064	; 0x4f000000
    7cc0:	2820335f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, ip, sp}
    7cc4:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    7cc8:	5f363174 	svcpl	0x00363174
    7ccc:	29332974 	ldmdbcs	r3!, {r2, r4, r5, r6, r8, fp, sp}
    7cd0:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7cd4:	48435f4d 	stmdami	r3, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    7cd8:	414e455f 	cmpmi	lr, pc, asr r5
    7cdc:	44454c42 	strbmi	r4, [r5], #-3138	; 0xfffff3be
    7ce0:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    7ce4:	38746e69 	ldmdacc	r4!, {r0, r3, r5, r6, r9, sl, fp, sp, lr}^
    7ce8:	3129745f 			; <UNDEFINED> instruction: 0x3129745f
    7cec:	50470029 	subpl	r0, r7, r9, lsr #32
    7cf0:	435f4d54 	cmpmi	pc, #84, 26	; 0x1500
    7cf4:	4e495f48 	cdpmi	15, 4, cr5, cr9, cr8, {2}
    7cf8:	5f545550 	svcpl	0x00545550
    7cfc:	54504143 	ldrbpl	r4, [r0], #-323	; 0xfffffebd
    7d00:	5f455255 	svcpl	0x00455255
    7d04:	45434e4f 	strbmi	r4, [r3, #-3663]	; 0xfffff1b1
    7d08:	4556455f 	ldrbmi	r4, [r6, #-1375]	; 0xfffffaa1
    7d0c:	345f5952 	ldrbcc	r5, [pc], #-2386	; 7d14 <_Min_Stack_Size+0x7914>
    7d10:	4556455f 	ldrbmi	r4, [r6, #-1375]	; 0xfffffaa1
    7d14:	2053544e 	subscs	r5, r3, lr, asr #8
    7d18:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    7d1c:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    7d20:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    7d24:	323c3c32 	eorscc	r3, ip, #12800	; 0x3200
    7d28:	47002929 	strmi	r2, [r0, -r9, lsr #18]
    7d2c:	5f4d5450 	svcpl	0x004d5450
    7d30:	5f434d53 	svcpl	0x00434d53
    7d34:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    7d38:	5458455f 	ldrbpl	r4, [r8], #-1375	; 0xfffffaa1
    7d3c:	414e5245 	cmpmi	lr, r5, asr #4
    7d40:	4c435f4c 	mcrrmi	15, 4, r5, r3, cr12
    7d44:	204b434f 	subcs	r4, fp, pc, asr #6
    7d48:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    7d4c:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    7d50:	3729745f 			; <UNDEFINED> instruction: 0x3729745f
    7d54:	434d0029 	movtmi	r0, #53289	; 0xd029
    7d58:	495f4c41 	ldmdbmi	pc, {r0, r6, sl, fp, lr}^	; <UNPREDICTABLE>
    7d5c:	475f434e 	ldrbmi	r4, [pc, -lr, asr #6]
    7d60:	5f4d5450 	svcpl	0x004d5450
    7d64:	00205f48 	eoreq	r5, r0, r8, asr #30
    7d68:	495f4843 	ldmdbmi	pc, {r0, r1, r6, fp, lr}^	; <UNPREDICTABLE>
    7d6c:	7475706e 	ldrbtvc	r7, [r5], #-110	; 0xffffff92
    7d70:	616c6f50 	cmnvs	ip, r0, asr pc
    7d74:	79746972 	ldmdbvc	r4!, {r1, r4, r5, r6, r8, fp, sp, lr}^
    7d78:	65746544 	ldrbvs	r6, [r4, #-1348]!	; 0xfffffabc
    7d7c:	64657463 	strbtvs	r7, [r5], #-1123	; 0xfffffb9d
    7d80:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7d84:	52495f4d 	subpl	r5, r9, #308	; 0x134
    7d88:	4e455f51 	mcrmi	15, 2, r5, cr5, cr1, {2}
    7d8c:	3443435f 	strbcc	r4, [r3], #-863	; 0xfffffca1
    7d90:	28204549 	stmdacs	r0!, {r0, r3, r6, r8, sl, lr}
    7d94:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    7d98:	5f363174 	svcpl	0x00363174
    7d9c:	31282974 			; <UNDEFINED> instruction: 0x31282974
    7da0:	29343c3c 	ldmdbcs	r4!, {r2, r3, r4, r5, sl, fp, ip, sp}
    7da4:	50470029 	subpl	r0, r7, r9, lsr #32
    7da8:	435f4d54 	cmpmi	pc, #84, 26	; 0x1500
    7dac:	4f505f48 	svcmi	0x00505f48
    7db0:	4952414c 	ldmdbmi	r2, {r2, r3, r6, r8, lr}^
    7db4:	525f5954 	subspl	r5, pc, #84, 18	; 0x150000
    7db8:	4e495349 	cdpmi	3, 4, cr5, cr9, cr9, {2}
    7dbc:	28282047 	stmdacs	r8!, {r0, r1, r2, r6, sp}
    7dc0:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7dc4:	745f3631 	ldrbvc	r3, [pc], #-1585	; 7dcc <_Min_Stack_Size+0x79cc>
    7dc8:	3c302829 	ldccc	8, cr2, [r0], #-164	; 0xffffff5c
    7dcc:	2929313c 	stmdbcs	r9!, {r2, r3, r4, r5, r8, ip, sp}
    7dd0:	41434d00 	cmpmi	r3, r0, lsl #26
    7dd4:	50475f4c 	subpl	r5, r7, ip, asr #30
    7dd8:	535f4d54 	cmppl	pc, #84, 26	; 0x1500
    7ddc:	74726174 	ldrbtvc	r6, [r2], #-372	; 0xfffffe8c
    7de0:	6e756f43 	cdpvs	15, 7, cr6, cr5, cr3, {2}
    7de4:	00726574 	rsbseq	r6, r2, r4, ror r5
    7de8:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    7dec:	5458455f 	ldrbpl	r4, [r8], #-1375	; 0xfffffaa1
    7df0:	47495254 	smlsldmi	r5, r9, r4, r2
    7df4:	4d41535f 	stclmi	3, cr5, [r1, #-380]	; 0xfffffe84
    7df8:	4e494c50 	mcrmi	12, 2, r4, cr9, cr0, {2}
    7dfc:	44665f47 	strbtmi	r5, [r6], #-3911	; 0xfffff0b9
    7e00:	445f5354 	ldrbmi	r5, [pc], #-852	; 7e08 <_Min_Stack_Size+0x7a08>
    7e04:	315f5649 	cmpcc	pc, r9, asr #12
    7e08:	5f4e5f36 	svcpl	0x004e5f36
    7e0c:	28282036 	stmdacs	r8!, {r1, r2, r4, r5, sp}
    7e10:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7e14:	745f3631 	ldrbvc	r3, [pc], #-1585	; 7e1c <_Min_Stack_Size+0x7a1c>
    7e18:	31312829 	teqcc	r1, r9, lsr #16
    7e1c:	29383c3c 	ldmdbcs	r8!, {r2, r3, r4, r5, sl, fp, ip, sp}
    7e20:	50470029 	subpl	r0, r7, r9, lsr #32
    7e24:	435f4d54 	cmpmi	pc, #84, 26	; 0x1500
    7e28:	554f5f48 	strbpl	r5, [pc, #-3912]	; 6ee8 <_Min_Stack_Size+0x6ae8>
    7e2c:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    7e30:	444f4d5f 	strbmi	r4, [pc], #-3423	; 7e38 <_Min_Stack_Size+0x7a38>
    7e34:	4f545f45 	svcmi	0x00545f45
    7e38:	454c4747 	strbmi	r4, [ip, #-1863]	; 0xfffff8b9
    7e3c:	5f4e4f5f 	svcpl	0x004e4f5f
    7e40:	4354414d 	cmpmi	r4, #1073741843	; 0x40000013
    7e44:	28282048 	stmdacs	r8!, {r3, r6, sp}
    7e48:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7e4c:	745f3631 	ldrbvc	r3, [pc], #-1585	; 7e54 <_Min_Stack_Size+0x7a54>
    7e50:	3c332829 	ldccc	8, cr2, [r3], #-164	; 0xffffff5c
    7e54:	2929343c 	stmdbcs	r9!, {r2, r3, r4, r5, sl, ip, sp}
    7e58:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7e5c:	58455f4d 	stmdapl	r5, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    7e60:	49525454 	ldmdbmi	r2, {r2, r4, r6, sl, ip, lr}^
    7e64:	41535f47 	cmpmi	r3, r7, asr #30
    7e68:	494c504d 	stmdbmi	ip, {r0, r2, r3, r6, ip, lr}^
    7e6c:	665f474e 	ldrbvs	r4, [pc], -lr, asr #14
    7e70:	4e494b43 	vmlsmi.f64	d20, d9, d3
    7e74:	5f4e5f54 	svcpl	0x004e5f54
    7e78:	28282038 	stmdacs	r8!, {r3, r4, r5, sp}
    7e7c:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7e80:	745f3631 	ldrbvc	r3, [pc], #-1585	; 7e88 <_Min_Stack_Size+0x7a88>
    7e84:	3c332829 	ldccc	8, cr2, [r3], #-164	; 0xffffff5c
    7e88:	2929383c 	stmdbcs	r9!, {r2, r3, r4, r5, fp, ip, sp}
    7e8c:	41484300 	mrsmi	r4, (UNDEF: 120)
    7e90:	4c454e4e 	mcrrmi	14, 4, r4, r5, cr14
    7e94:	495f325f 	ldmdbmi	pc, {r0, r1, r2, r3, r4, r6, r9, ip, sp}^	; <UNPREDICTABLE>
    7e98:	5845444e 	stmdapl	r5, {r1, r2, r3, r6, sl, lr}^
    7e9c:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    7ea0:	31746e69 	cmncc	r4, r9, ror #28
    7ea4:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    7ea8:	47002931 	smladxmi	r0, r1, r9, r2
    7eac:	5f4d5450 	svcpl	0x004d5450
    7eb0:	4f5f4843 	svcmi	0x005f4843
    7eb4:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    7eb8:	52545f54 	subspl	r5, r4, #84, 30	; 0x150
    7ebc:	435f4749 	cmpmi	pc, #19136512	; 0x1240000
    7ec0:	45535541 	ldrbmi	r5, [r3, #-1345]	; 0xfffffabf
    7ec4:	4d4f435f 	stclmi	3, cr4, [pc, #-380]	; 7d50 <_Min_Stack_Size+0x7950>
    7ec8:	45524150 	ldrbmi	r4, [r2, #-336]	; 0xfffffeb0
    7ecc:	54414d5f 	strbpl	r4, [r1], #-3423	; 0xfffff2a1
    7ed0:	28204843 	stmdacs	r0!, {r0, r1, r6, fp, lr}
    7ed4:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    7ed8:	5f363174 	svcpl	0x00363174
    7edc:	31282974 			; <UNDEFINED> instruction: 0x31282974
    7ee0:	29323c3c 	ldmdbcs	r2!, {r2, r3, r4, r5, sl, fp, ip, sp}
    7ee4:	50470029 	subpl	r0, r7, r9, lsr #32
    7ee8:	455f4d54 	ldrbmi	r4, [pc, #-3412]	; 719c <_Min_Stack_Size+0x6d9c>
    7eec:	52545458 	subspl	r5, r4, #88, 8	; 0x58000000
    7ef0:	535f4749 	cmppl	pc, #19136512	; 0x1240000
    7ef4:	4c504d41 	mrrcmi	13, 4, r4, r0, cr1
    7ef8:	5f474e49 	svcpl	0x00474e49
    7efc:	53544466 	cmppl	r4, #1711276032	; 0x66000000
    7f00:	5649445f 			; <UNDEFINED> instruction: 0x5649445f
    7f04:	4e5f325f 	mrcmi	2, 2, r3, cr15, cr15, {2}
    7f08:	2820365f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r9, sl, ip, sp}
    7f0c:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    7f10:	5f363174 	svcpl	0x00363174
    7f14:	34282974 	strtcc	r2, [r8], #-2420	; 0xfffff68c
    7f18:	29383c3c 	ldmdbcs	r8!, {r2, r3, r4, r5, sl, fp, ip, sp}
    7f1c:	50470029 	subpl	r0, r7, r9, lsr #32
    7f20:	435f4d54 	cmpmi	pc, #84, 26	; 0x1500
    7f24:	554f5f48 	strbpl	r5, [pc, #-3912]	; 6fe4 <_Min_Stack_Size+0x6be4>
    7f28:	54555054 	ldrbpl	r5, [r5], #-84	; 0xffffffac
    7f2c:	444f4d5f 	strbmi	r4, [pc], #-3423	; 7f34 <_Min_Stack_Size+0x7b34>
    7f30:	52465f45 	subpl	r5, r6, #276	; 0x114
    7f34:	4e455a4f 	vmlsmi.f32	s11, s10, s30
    7f38:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    7f3c:	31746e69 	cmncc	r4, r9, ror #28
    7f40:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    7f44:	3c3c3028 	ldccc	0, cr3, [ip], #-160	; 0xffffff60
    7f48:	00292934 	eoreq	r2, r9, r4, lsr r9
    7f4c:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    7f50:	5f48435f 	svcpl	0x0048435f
    7f54:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    7f58:	41535f54 	cmpmi	r3, r4, asr pc
    7f5c:	494c504d 	stmdbmi	ip, {r0, r2, r3, r6, ip, lr}^
    7f60:	665f474e 	ldrbvs	r4, [pc], -lr, asr #14
    7f64:	5f535444 	svcpl	0x00535444
    7f68:	5f564944 	svcpl	0x00564944
    7f6c:	5f4e5f38 	svcpl	0x004e5f38
    7f70:	28282038 	stmdacs	r8!, {r3, r4, r5, sp}
    7f74:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    7f78:	745f3631 	ldrbvc	r3, [pc], #-1585	; 7f80 <_Min_Stack_Size+0x7b80>
    7f7c:	3c392829 	ldccc	8, cr2, [r9], #-164	; 0xffffff5c
    7f80:	2929343c 	stmdbcs	r9!, {r2, r3, r4, r5, sl, ip, sp}
    7f84:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    7f88:	58455f4d 	stmdapl	r5, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    7f8c:	49525454 	ldmdbmi	r2, {r2, r4, r6, sl, ip, lr}^
    7f90:	41535f47 	cmpmi	r3, r7, asr #30
    7f94:	494c504d 	stmdbmi	ip, {r0, r2, r3, r6, ip, lr}^
    7f98:	665f474e 	ldrbvs	r4, [pc], -lr, asr #14
    7f9c:	5f535444 	svcpl	0x00535444
    7fa0:	5f564944 	svcpl	0x00564944
    7fa4:	4e5f3631 	mrcmi	6, 2, r3, cr15, cr1, {1}
    7fa8:	2820385f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, fp, ip, sp}
    7fac:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    7fb0:	5f363174 	svcpl	0x00363174
    7fb4:	31282974 			; <UNDEFINED> instruction: 0x31282974
    7fb8:	383c3c32 	ldmdacc	ip!, {r1, r4, r5, sl, fp, ip, sp}
    7fbc:	47002929 	strmi	r2, [r0, -r9, lsr #18]
    7fc0:	5f4d5450 	svcpl	0x004d5450
    7fc4:	5f434d53 	svcpl	0x00434d53
    7fc8:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    7fcc:	5349445f 	movtpl	r4, #37983	; 0x945f
    7fd0:	454c4241 	strbmi	r4, [ip, #-577]	; 0xfffffdbf
    7fd4:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    7fd8:	31746e69 	cmncc	r4, r9, ror #28
    7fdc:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    7fe0:	47002930 	smladxmi	r0, r0, r9, r2
    7fe4:	5f4d5450 	svcpl	0x004d5450
    7fe8:	5f434d53 	svcpl	0x00434d53
    7fec:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    7ff0:	5345525f 	movtpl	r5, #21087	; 0x525f
    7ff4:	28205445 	stmdacs	r0!, {r0, r2, r6, sl, ip, lr}
    7ff8:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    7ffc:	5f363174 	svcpl	0x00363174
    8000:	29342974 	ldmdbcs	r4!, {r2, r4, r5, r6, r8, fp, sp}
    8004:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    8008:	48435f4d 	stmdami	r3, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    800c:	435f325f 	cmpmi	pc, #-268435451	; 0xf0000005
    8010:	5f524d43 	svcpl	0x00524d43
    8014:	46494853 			; <UNDEFINED> instruction: 0x46494853
    8018:	28282054 	stmdacs	r8!, {r2, r4, r6, sp}
    801c:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    8020:	745f3631 	ldrbvc	r3, [pc], #-1585	; 8028 <_Min_Stack_Size+0x7c28>
    8024:	00293829 	eoreq	r3, r9, r9, lsr #16
    8028:	784d4954 	stmdavc	sp, {r2, r4, r6, r8, fp, lr}^
    802c:	41434d00 	cmpmi	r3, r0, lsl #26
    8030:	50475f4c 	subpl	r5, r7, ip, asr #30
    8034:	475f4d54 			; <UNDEFINED> instruction: 0x475f4d54
    8038:	72656e65 	rsbvc	r6, r5, #1616	; 0x650
    803c:	53657461 	cmnpl	r5, #1627389952	; 0x61000000
    8040:	5574666f 	ldrbpl	r6, [r4, #-1647]!	; 0xfffff991
    8044:	74616470 	strbtvc	r6, [r1], #-1136	; 0xfffffb90
    8048:	76006465 	strvc	r6, [r0], -r5, ror #8
    804c:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    8050:	745f3631 	ldrbvc	r3, [pc], #-1585	; 8058 <_Min_Stack_Size+0x7c58>
    8054:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    8058:	48435f4d 	stmdami	r3, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    805c:	54554f5f 	ldrbpl	r4, [r5], #-3935	; 0xfffff0a1
    8060:	5f545550 	svcpl	0x00545550
    8064:	4c455250 	sfmmi	f5, 2, [r5], {80}	; 0x50
    8068:	5f44414f 	svcpl	0x0044414f
    806c:	41534944 	cmpmi	r3, r4, asr #18
    8070:	20454c42 	subcs	r4, r5, r2, asr #24
    8074:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    8078:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    807c:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
