mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    8080:	333c3c30 	teqcc	ip, #48, 24	; 0x3000
    8084:	54002929 	strpl	r2, [r0], #-2345	; 0xfffff6d7
    8088:	43336d69 	teqmi	r3, #6720	; 0x1a40
    808c:	6e6e6168 	powvsez	f6, f6, #0.0
    8090:	00316c65 	eorseq	r6, r1, r5, ror #24
    8094:	336d6954 	cmncc	sp, #84, 18	; 0x150000
    8098:	6e616843 	cdpvs	8, 6, cr6, cr1, cr3, {2}
    809c:	326c656e 	rsbcc	r6, ip, #461373440	; 0x1b800000
    80a0:	6d695400 	cfstrdvs	mvd5, [r9, #-0]
    80a4:	61684333 	cmnvs	r8, r3, lsr r3
    80a8:	6c656e6e 	stclvs	14, cr6, [r5], #-440	; 0xfffffe48
    80ac:	69540033 	ldmdbvs	r4, {r0, r1, r4, r5}^
    80b0:	6843336d 	stmdavs	r3, {r0, r2, r3, r5, r6, r8, r9, ip, sp}^
    80b4:	656e6e61 	strbvs	r6, [lr, #-3681]!	; 0xfffff19f
    80b8:	4700346c 	strmi	r3, [r0, -ip, ror #8]
    80bc:	5f4d5450 	svcpl	0x004d5450
    80c0:	5f434d53 	svcpl	0x00434d53
    80c4:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    80c8:	5441475f 	strbpl	r4, [r1], #-1887	; 0xfffff8a1
    80cc:	28204445 	stmdacs	r0!, {r0, r2, r6, sl, lr}
    80d0:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    80d4:	5f363174 	svcpl	0x00363174
    80d8:	29352974 	ldmdbcs	r5!, {r2, r4, r5, r6, r8, fp, sp}
    80dc:	41484300 	mrsmi	r4, (UNDEF: 120)
    80e0:	4c454e4e 	mcrrmi	14, 4, r4, r5, cr14
    80e4:	495f315f 	ldmdbmi	pc, {r0, r1, r2, r3, r4, r6, r8, ip, sp}^	; <UNPREDICTABLE>
    80e8:	5845444e 	stmdapl	r5, {r1, r2, r3, r6, sl, lr}^
    80ec:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    80f0:	31746e69 	cmncc	r4, r9, ror #28
    80f4:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    80f8:	47002930 	smladxmi	r0, r0, r9, r2
    80fc:	5f4d5450 	svcpl	0x004d5450
    8100:	4f545541 	svcmi	0x00545541
    8104:	4c45525f 	sfmmi	f5, 2, [r5], {95}	; 0x5f
    8108:	5f44414f 	svcpl	0x0044414f
    810c:	41445055 	qdaddmi	r5, r5, r4
    8110:	505f4554 	subspl	r4, pc, r4, asr r5	; <UNPREDICTABLE>
    8114:	454d5245 	strbmi	r5, [sp, #-581]	; 0xfffffdbb
    8118:	544e414e 	strbpl	r4, [lr], #-334	; 0xfffffeb2
    811c:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    8120:	31746e69 	cmncc	r4, r9, ror #28
    8124:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    8128:	3c3c3028 	ldccc	0, cr3, [ip], #-160	; 0xffffff60
    812c:	00292937 	eoreq	r2, r9, r7, lsr r9
    8130:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    8134:	5f48435f 	svcpl	0x0048435f
    8138:	5054554f 	subspl	r5, r4, pc, asr #10
    813c:	4d5f5455 	cfldrdmi	mvd5, [pc, #-340]	; 7ff0 <_Min_Stack_Size+0x7bf0>
    8140:	5f45444f 	svcpl	0x0045444f
    8144:	5f544553 	svcpl	0x00544553
    8148:	43414e49 	movtmi	r4, #7753	; 0x1e49
    814c:	45564954 	ldrbmi	r4, [r6, #-2388]	; 0xfffff6ac
    8150:	56454c5f 			; <UNDEFINED> instruction: 0x56454c5f
    8154:	4f5f4c45 	svcmi	0x005f4c45
    8158:	414d5f4e 	cmpmi	sp, lr, asr #30
    815c:	20484354 	subcs	r4, r8, r4, asr r3
    8160:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    8164:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    8168:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    816c:	343c3c32 	ldrtcc	r3, [ip], #-3122	; 0xfffff3ce
    8170:	47002929 	strmi	r2, [r0, -r9, lsr #18]
    8174:	5f4d5450 	svcpl	0x004d5450
    8178:	41445055 	qdaddmi	r5, r5, r4
    817c:	455f4554 	ldrbmi	r4, [pc, #-1364]	; 7c30 <_Min_Stack_Size+0x7830>
    8180:	544e4556 	strbpl	r4, [lr], #-1366	; 0xfffffaaa
    8184:	5f4e4f5f 	svcpl	0x004e4f5f
    8188:	204c4c41 	subcs	r4, ip, r1, asr #24
    818c:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    8190:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    8194:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    8198:	323c3c30 	eorscc	r3, ip, #48, 24	; 0x3000
    819c:	47002929 	strmi	r2, [r0, -r9, lsr #18]
    81a0:	5f4d5450 	svcpl	0x004d5450
    81a4:	445f4843 	ldrbmi	r4, [pc], #-2115	; 81ac <_Min_Stack_Size+0x7dac>
    81a8:	42415349 	submi	r5, r1, #603979777	; 0x24000001
    81ac:	2044454c 	subcs	r4, r4, ip, asr #10
    81b0:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    81b4:	5f38746e 	svcpl	0x0038746e
    81b8:	29302974 	ldmdbcs	r0!, {r2, r4, r5, r6, r8, fp, sp}
    81bc:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    81c0:	58455f4d 	stmdapl	r5, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    81c4:	49525454 	ldmdbmi	r2, {r2, r4, r6, sl, ip, lr}^
    81c8:	41535f47 	cmpmi	r3, r7, asr #30
    81cc:	494c504d 	stmdbmi	ip, {r0, r2, r3, r6, ip, lr}^
    81d0:	665f474e 	ldrbvs	r4, [pc], -lr, asr #14
    81d4:	5f535444 	svcpl	0x00535444
    81d8:	5f564944 	svcpl	0x00564944
    81dc:	4e5f3233 	mrcmi	2, 2, r3, cr15, cr3, {1}
    81e0:	2820385f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, fp, ip, sp}
    81e4:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    81e8:	5f363174 	svcpl	0x00363174
    81ec:	31282974 			; <UNDEFINED> instruction: 0x31282974
    81f0:	383c3c35 	ldmdacc	ip!, {r0, r2, r4, r5, sl, fp, ip, sp}
    81f4:	47002929 	strmi	r2, [r0, -r9, lsr #18]
    81f8:	5f4d5450 	svcpl	0x004d5450
    81fc:	5f434d53 	svcpl	0x00434d53
    8200:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    8204:	4952545f 	ldmdbmi	r2, {r0, r1, r2, r3, r4, r6, sl, ip, lr}^
    8208:	52454747 	subpl	r4, r5, #18612224	; 0x11c0000
    820c:	75282820 	strvc	r2, [r8, #-2080]!	; 0xfffff7e0
    8210:	31746e69 	cmncc	r4, r9, ror #28
    8214:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    8218:	47002936 	smladxmi	r0, r6, r9, r2
    821c:	5f4d5450 	svcpl	0x004d5450
    8220:	65747845 	ldrbvs	r7, [r4, #-2117]!	; 0xfffff7bb
    8224:	6c616e72 	stclvs	14, cr6, [r1], #-456	; 0xfffffe38
    8228:	67697254 			; <UNDEFINED> instruction: 0x67697254
    822c:	00726567 	rsbseq	r6, r2, r7, ror #10
    8230:	784d4954 	stmdavc	sp, {r2, r4, r6, r8, fp, lr}^
    8234:	434d535f 	movtmi	r5, #54111	; 0xd35f
    8238:	50470052 	subpl	r0, r7, r2, asr r0
    823c:	555f4d54 	ldrbpl	r4, [pc, #-3412]	; 74f0 <_Min_Stack_Size+0x70f0>
    8240:	6c657345 	stclvs	3, cr7, [r5], #-276	; 0xfffffeec
    8244:	69746365 	ldmdbvs	r4!, {r0, r2, r5, r6, r8, r9, sp, lr}^
    8248:	72536e6f 	subsvc	r6, r3, #1776	; 0x6f0
    824c:	50470063 	subpl	r0, r7, r3, rrx
    8250:	435f4d54 	cmpmi	pc, #84, 26	; 0x1500
    8254:	746e756f 	strbtvc	r7, [lr], #-1391	; 0xfffffa91
    8258:	6f4d7265 	svcvs	0x004d7265
    825c:	47006564 	strmi	r6, [r0, -r4, ror #10]
    8260:	5f4d5450 	svcpl	0x004d5450
    8264:	4f5f4843 	svcmi	0x005f4843
    8268:	55505455 	ldrbpl	r5, [r0, #-1109]	; 0xfffffbab
    826c:	434f5f54 	movtmi	r5, #65364	; 0xff54
    8270:	464f5f78 			; <UNDEFINED> instruction: 0x464f5f78
    8274:	28282046 	stmdacs	r8!, {r1, r2, r6, sp}
    8278:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    827c:	745f3631 	ldrbvc	r3, [pc], #-1585	; 8284 <_Min_Stack_Size+0x7e84>
    8280:	3c302829 	ldccc	8, cr2, [r0], #-164	; 0xffffff5c
    8284:	2929303c 	stmdbcs	r9!, {r2, r3, r4, r5, ip, sp}
    8288:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    828c:	48435f4d 	stmdami	r3, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    8290:	504e495f 	subpl	r4, lr, pc, asr r9
    8294:	435f5455 	cmpmi	pc, #1426063360	; 0x55000000
    8298:	55545041 	ldrbpl	r5, [r4, #-65]	; 0xffffffbf
    829c:	445f4552 	ldrbmi	r4, [pc], #-1362	; 82a4 <_Min_Stack_Size+0x7ea4>
    82a0:	5f454e4f 	svcpl	0x00454e4f
    82a4:	48434145 	stmdami	r3, {r0, r2, r6, r8, lr}^
    82a8:	4d49545f 	cfstrdmi	mvd5, [r9, #-380]	; 0xfffffe84
    82ac:	28282045 	stmdacs	r8!, {r0, r2, r6, sp}
    82b0:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    82b4:	745f3631 	ldrbvc	r3, [pc], #-1585	; 82bc <_Min_Stack_Size+0x7ebc>
    82b8:	3c302829 	ldccc	8, cr2, [r0], #-164	; 0xffffff5c
    82bc:	2929323c 	stmdbcs	r9!, {r2, r3, r4, r5, r9, ip, sp}
    82c0:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    82c4:	48435f4d 	stmdami	r3, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    82c8:	435f315f 	cmpmi	pc, #-1073741801	; 0xc0000017
    82cc:	5f524d43 	svcpl	0x00524d43
    82d0:	46494853 			; <UNDEFINED> instruction: 0x46494853
    82d4:	28282054 	stmdacs	r8!, {r2, r4, r6, sp}
    82d8:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    82dc:	745f3631 	ldrbvc	r3, [pc], #-1585	; 82e4 <_Min_Stack_Size+0x7ee4>
    82e0:	00293029 	eoreq	r3, r9, r9, lsr #32
    82e4:	4e414843 	cdpmi	8, 4, cr4, cr1, cr3, {2}
    82e8:	5f4c454e 	svcpl	0x004c454e
    82ec:	4e495f33 	mcrmi	15, 2, r5, cr9, cr3, {1}
    82f0:	20584544 	subscs	r4, r8, r4, asr #10
    82f4:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    82f8:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    82fc:	3229745f 	eorcc	r7, r9, #1593835520	; 0x5f000000
    8300:	50470029 	subpl	r0, r7, r9, lsr #32
    8304:	435f4d54 	cmpmi	pc, #84, 26	; 0x1500
    8308:	4e495f48 	cdpmi	15, 4, cr5, cr9, cr8, {2}
    830c:	5f545550 	svcpl	0x00545550
    8310:	504d4153 	subpl	r4, sp, r3, asr r1
    8314:	474e494c 	strbmi	r4, [lr, -ip, asr #18]
    8318:	5444665f 	strbpl	r6, [r4], #-1631	; 0xfffff9a1
    831c:	49445f53 	stmdbmi	r4, {r0, r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    8320:	5f325f56 	svcpl	0x00325f56
    8324:	20365f4e 	eorscs	r5, r6, lr, asr #30
    8328:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    832c:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    8330:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    8334:	343c3c34 	ldrtcc	r3, [ip], #-3124	; 0xfffff3cc
    8338:	43002929 	movwmi	r2, #2345	; 0x929
    833c:	6e6e6168 	powvsez	f6, f6, #0.0
    8340:	495f6c65 	ldmdbmi	pc, {r0, r2, r5, r6, sl, fp, sp, lr}^	; <UNPREDICTABLE>
    8344:	7865646e 	stmdavc	r5!, {r1, r2, r3, r5, r6, sl, sp, lr}^
    8348:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    834c:	4d535f4d 	ldclmi	15, cr5, [r3, #-308]	; 0xfffffecc
    8350:	68435f43 	stmdavs	r3, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    8354:	656e6e61 	strbvs	r6, [lr, #-3681]!	; 0xfffff19f
    8358:	5047006c 	subpl	r0, r7, ip, rrx
    835c:	435f4d54 	cmpmi	pc, #84, 26	; 0x1500
    8360:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    8364:	72745067 	rsbsvc	r5, r4, #103	; 0x67
    8368:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    836c:	58455f4d 	stmdapl	r5, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    8370:	49525454 	ldmdbmi	r2, {r2, r4, r6, sl, ip, lr}^
    8374:	41535f47 	cmpmi	r3, r7, asr #30
    8378:	494c504d 	stmdbmi	ip, {r0, r2, r3, r6, ip, lr}^
    837c:	665f474e 	ldrbvs	r4, [pc], -lr, asr #14
    8380:	5f535444 	svcpl	0x00535444
    8384:	5f564944 	svcpl	0x00564944
    8388:	5f4e5f34 	svcpl	0x004e5f34
    838c:	28282038 	stmdacs	r8!, {r3, r4, r5, sp}
    8390:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    8394:	745f3631 	ldrbvc	r3, [pc], #-1585	; 839c <_Min_Stack_Size+0x7f9c>
    8398:	3c372829 	ldccc	8, cr2, [r7], #-164	; 0xffffff5c
    839c:	2929383c 	stmdbcs	r9!, {r2, r3, r4, r5, fp, ip, sp}
    83a0:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    83a4:	48435f4d 	stmdami	r3, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    83a8:	504e495f 	subpl	r4, lr, pc, asr r9
    83ac:	435f5455 	cmpmi	pc, #1426063360	; 0x55000000
    83b0:	55545041 	ldrbpl	r5, [r4, #-65]	; 0xffffffbf
    83b4:	4f5f4552 	svcmi	0x005f4552
    83b8:	5f45434e 	svcpl	0x0045434e
    83bc:	52455645 	subpl	r5, r5, #72351744	; 0x4500000
    83c0:	5f325f59 	svcpl	0x00325f59
    83c4:	4e455645 	cdpmi	6, 4, cr5, cr5, cr5, {2}
    83c8:	28205354 	stmdacs	r0!, {r2, r4, r6, r8, r9, ip, lr}
    83cc:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    83d0:	5f363174 	svcpl	0x00363174
    83d4:	31282974 			; <UNDEFINED> instruction: 0x31282974
    83d8:	29323c3c 	ldmdbcs	r2!, {r2, r3, r4, r5, sl, fp, ip, sp}
    83dc:	50470029 	subpl	r0, r7, r9, lsr #32
    83e0:	435f4d54 	cmpmi	pc, #84, 26	; 0x1500
    83e4:	4e495f48 	cdpmi	15, 4, cr5, cr9, cr8, {2}
    83e8:	5f545550 	svcpl	0x00545550
    83ec:	504d4153 	subpl	r4, sp, r3, asr r1
    83f0:	474e494c 	strbmi	r4, [lr, -ip, asr #18]
    83f4:	5444665f 	strbpl	r6, [r4], #-1631	; 0xfffff9a1
    83f8:	49445f53 	stmdbmi	r4, {r0, r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    83fc:	5f345f56 	svcpl	0x00345f56
    8400:	20385f4e 	eorscs	r5, r8, lr, asr #30
    8404:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    8408:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    840c:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    8410:	343c3c37 	ldrtcc	r3, [ip], #-3127	; 0xfffff3c9
    8414:	47002929 	strmi	r2, [r0, -r9, lsr #18]
    8418:	5f4d5450 	svcpl	0x004d5450
    841c:	544e4543 	strbpl	r4, [lr], #-1347	; 0xfffffabd
    8420:	415f5245 	cmpmi	pc, r5, asr #4
    8424:	4e47494c 	vmlsmi.f16	s9, s14, s24	; <UNPREDICTABLE>
    8428:	4d5f4445 	cfldrdmi	mvd4, [pc, #-276]	; 831c <_Min_Stack_Size+0x7f1c>
    842c:	5f45444f 	svcpl	0x0045444f
    8430:	28282031 	stmdacs	r8!, {r0, r4, r5, sp}
    8434:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    8438:	745f3631 	ldrbvc	r3, [pc], #-1585	; 8440 <_Min_Stack_Size+0x8040>
    843c:	3c312829 	ldccc	8, cr2, [r1], #-164	; 0xffffff5c
    8440:	2929353c 	stmdbcs	r9!, {r2, r3, r4, r5, r8, sl, ip, sp}
    8444:	54504700 	ldrbpl	r4, [r0], #-1792	; 0xfffff900
    8448:	48435f4d 	stmdami	r3, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    844c:	504e495f 	subpl	r4, lr, pc, asr r9
    8450:	535f5455 	cmppl	pc, #1426063360	; 0x55000000
    8454:	4c504d41 	mrrcmi	13, 4, r4, r0, cr1
    8458:	5f474e49 	svcpl	0x00474e49
    845c:	53544466 	cmppl	r4, #1711276032	; 0x66000000
    8460:	5649445f 			; <UNDEFINED> instruction: 0x5649445f
    8464:	4e5f385f 	mrcmi	8, 2, r3, cr15, cr15, {2}
    8468:	2820365f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r9, sl, ip, sp}
    846c:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    8470:	5f363174 	svcpl	0x00363174
    8474:	38282974 	stmdacc	r8!, {r2, r4, r5, r6, r8, fp, sp}
    8478:	29343c3c 	ldmdbcs	r4!, {r2, r3, r4, r5, sl, fp, ip, sp}
    847c:	434d0029 	movtmi	r0, #53289	; 0xd029
    8480:	475f4c41 	ldrbmi	r4, [pc, -r1, asr #24]
    8484:	5f4d5450 	svcpl	0x004d5450
    8488:	43746553 	cmnmi	r4, #348127232	; 0x14c00000
    848c:	00785243 	rsbseq	r5, r8, r3, asr #4
    8490:	4d545047 	ldclmi	0, cr5, [r4, #-284]	; 0xfffffee4
    8494:	5f48435f 	svcpl	0x0048435f
    8498:	55504e49 	ldrbpl	r4, [r0, #-3657]	; 0xfffff1b7
    849c:	41535f54 	cmpmi	r3, r4, asr pc
    84a0:	494c504d 	stmdbmi	ip, {r0, r2, r3, r6, ip, lr}^
    84a4:	665f474e 	ldrbvs	r4, [pc], -lr, asr #14
    84a8:	5f535444 	svcpl	0x00535444
    84ac:	5f564944 	svcpl	0x00564944
    84b0:	5f4e5f34 	svcpl	0x004e5f34
    84b4:	28282036 	stmdacs	r8!, {r1, r2, r4, r5, sp}
    84b8:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    84bc:	745f3631 	ldrbvc	r3, [pc], #-1585	; 84c4 <_Min_Stack_Size+0x80c4>
    84c0:	3c362829 	ldccc	8, cr2, [r6], #-164	; 0xffffff5c
    84c4:	2929343c 	stmdbcs	r9!, {r2, r3, r4, r5, sl, ip, sp}
    84c8:	41434d00 	cmpmi	r3, r0, lsl #26
    84cc:	32495f4c 	subcc	r5, r9, #76, 30	; 0x130
    84d0:	65535f43 	ldrbvs	r5, [r3, #-3907]	; 0xfffff0bd
    84d4:	6441646e 	strbvs	r6, [r1], #-1134	; 0xfffffb92
    84d8:	73657264 	cmnvc	r5, #100, 4	; 0x40000006
    84dc:	32490073 	subcc	r0, r9, #115	; 0x73
    84e0:	72455f43 	subvc	r5, r5, #268	; 0x10c
    84e4:	5f726f72 	svcpl	0x00726f72
    84e8:	5f515249 	svcpl	0x00515249
    84ec:	5f637253 	svcpl	0x00637253
    84f0:	49004641 	stmdbmi	r0, {r0, r6, r9, sl, lr}
    84f4:	4e5f5152 	mrcmi	1, 2, r5, cr15, cr2, {2}
    84f8:	3249006f 	subcc	r0, r9, #111	; 0x6f
    84fc:	52495f43 	subpl	r5, r9, #268	; 0x10c
    8500:	74535f51 	ldrbvc	r5, [r3], #-3921	; 0xfffff0af
    8504:	73757461 	cmnvc	r5, #1627389952	; 0x61000000
    8508:	4900745f 	stmdbmi	r0, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    850c:	465f4332 			; <UNDEFINED> instruction: 0x465f4332
    8510:	7367616c 	cmnvc	r7, #108, 2
    8514:	4900745f 	stmdbmi	r0, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    8518:	465f4332 			; <UNDEFINED> instruction: 0x465f4332
    851c:	5f67616c 	svcpl	0x0067616c
    8520:	00465442 	subeq	r5, r6, r2, asr #8
    8524:	67616c66 	strbvs	r6, [r1, -r6, ror #24]!
    8528:	74617453 	strbtvc	r7, [r1], #-1107	; 0xfffffbad
    852c:	49007375 	stmdbmi	r0, {r0, r2, r4, r5, r6, r8, r9, ip, sp, lr}
    8530:	455f4332 	ldrbmi	r4, [pc, #-818]	; 8206 <_Min_Stack_Size+0x7e06>
    8534:	726f7272 	rsbvc	r7, pc, #536870919	; 0x20000007
    8538:	5152495f 	cmppl	r2, pc, asr r9
    853c:	6372535f 	cmnvs	r2, #2080374785	; 0x7c000001
    8540:	4d49545f 	cfstrdmi	mvd5, [r9, #-380]	; 0xfffffe84
    8544:	54554f45 	ldrbpl	r4, [r5], #-3909	; 0xfffff0bb
    8548:	51524900 	cmppl	r2, r0, lsl #18
    854c:	6e6f435f 	mcrvs	3, 3, r4, cr15, cr15, {2}
    8550:	5f676966 	svcpl	0x00676966
    8554:	32490074 	subcc	r0, r9, #116	; 0x74
    8558:	76455f43 	strbvc	r5, [r5], -r3, asr #30
    855c:	5f746e65 	svcpl	0x00746e65
    8560:	5f515249 	svcpl	0x00515249
    8564:	5f637253 	svcpl	0x00637253
    8568:	00465442 	subeq	r5, r6, r2, asr #8
    856c:	5f433249 	svcpl	0x00433249
    8570:	65726944 	ldrbvs	r6, [r2, #-2372]!	; 0xfffff6bc
    8574:	6f697463 	svcvs	0x00697463
    8578:	72575f6e 	subsvc	r5, r7, #440	; 0x1b8
    857c:	00657469 	rsbeq	r7, r5, r9, ror #8
    8580:	5f433249 	svcpl	0x00433249
    8584:	4b4c4353 	blmi	13192d8 <_Min_Stack_Size+0x1318ed8>
    8588:	4b30315f 	blmi	c14b0c <_Min_Stack_Size+0xc1470c>
    858c:	28205a48 	stmdacs	r0!, {r3, r6, r9, fp, ip, lr}
    8590:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    8594:	745f3233 	ldrbvc	r3, [pc], #-563	; 859c <_Min_Stack_Size+0x819c>
    8598:	30312829 	eorscc	r2, r1, r9, lsr #16
    859c:	29303030 	ldmdbcs	r0!, {r4, r5, ip, sp}
    85a0:	43324900 	teqmi	r2, #0, 18
    85a4:	5152495f 	cmppl	r2, pc, asr r9
    85a8:	616e455f 	cmnvs	lr, pc, asr r5
    85ac:	00656c62 	rsbeq	r6, r5, r2, ror #24
    85b0:	53495254 	movtpl	r5, #37460	; 0x9254
    85b4:	32490045 	subcc	r0, r9, #69	; 0x45
    85b8:	76455f43 	strbvc	r5, [r5], -r3, asr #30
    85bc:	5f746e65 	svcpl	0x00746e65
    85c0:	5f515249 	svcpl	0x00515249
    85c4:	5f637253 	svcpl	0x00637253
    85c8:	49004253 	stmdbmi	r0, {r0, r1, r4, r6, r9, lr}
    85cc:	455f4332 	ldrbmi	r4, [pc, #-818]	; 82a2 <_Min_Stack_Size+0x7ea2>
    85d0:	726f7272 	rsbvc	r7, pc, #536870919	; 0x20000007
    85d4:	5152495f 	cmppl	r2, pc, asr r9
    85d8:	6372535f 	cmnvs	r2, #2080374785	; 0x7c000001
    85dc:	4900745f 	stmdbmi	r0, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    85e0:	475f4332 	smmlarmi	pc, r2, r3, r4	; <UNPREDICTABLE>
    85e4:	52454e45 	subpl	r4, r5, #1104	; 0x450
    85e8:	435f4c41 	cmpmi	pc, #16640	; 0x4100
    85ec:	5f4c4c41 	svcpl	0x004c4c41
    85f0:	52444441 	subpl	r4, r4, #1090519040	; 0x41000000
    85f4:	5f535345 	svcpl	0x00535345
    85f8:	42414e45 	submi	r4, r1, #1104	; 0x450
    85fc:	2820454c 	stmdacs	r0!, {r2, r3, r6, r8, sl, lr}
    8600:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    8604:	745f3631 	ldrbvc	r3, [pc], #-1585	; 860c <_Min_Stack_Size+0x820c>
    8608:	3c312829 	ldccc	8, cr2, [r1], #-164	; 0xffffff5c
    860c:	2930313c 	ldmdbcs	r0!, {r2, r3, r4, r5, r8, ip, sp}
    8610:	43324900 	teqmi	r2, #0, 18
    8614:	4444415f 	strbmi	r4, [r4], #-351	; 0xfffffea1
    8618:	53534552 	cmppl	r3, #343932928	; 0x14800000
    861c:	444f4d5f 	strbmi	r4, [pc], #-3423	; 8624 <_Min_Stack_Size+0x8224>
    8620:	5f375f45 	svcpl	0x00375f45
    8624:	20544942 	subscs	r4, r4, r2, asr #18
    8628:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    862c:	5f363174 	svcpl	0x00363174
    8630:	30282974 	eorcc	r2, r8, r4, ror r9
    8634:	6c660029 	stclvs	0, cr0, [r6], #-164	; 0xffffff5c
    8638:	79546761 	ldmdbvc	r4, {r0, r5, r6, r8, r9, sl, sp, lr}^
    863c:	49006570 	stmdbmi	r0, {r4, r5, r6, r8, sl, sp, lr}
    8640:	415f4332 	cmpmi	pc, r2, lsr r3	; <UNPREDICTABLE>
    8644:	4f4e4b43 	svcmi	0x004e4b43
    8648:	44454c57 	strbmi	r4, [r5], #-3159	; 0xfffff3a9
    864c:	4e454d47 	cdpmi	13, 4, cr4, cr5, cr7, {2}
    8650:	4e455f54 	mcrmi	15, 2, r5, cr5, cr4, {2}
    8654:	454c4241 	strbmi	r4, [ip, #-577]	; 0xfffffdbf
    8658:	5449425f 	strbpl	r4, [r9], #-607	; 0xfffffda1
    865c:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    8660:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    8664:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    8668:	00293031 	eoreq	r3, r9, r1, lsr r0
    866c:	5f433249 	svcpl	0x00433249
    8670:	4b4c4353 	blmi	13193c4 <_Min_Stack_Size+0x1318fc4>
    8674:	4b30325f 	blmi	c14ff8 <_Min_Stack_Size+0xc14bf8>
    8678:	28205a48 	stmdacs	r0!, {r3, r6, r9, fp, ip, lr}
    867c:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    8680:	745f3233 	ldrbvc	r3, [pc], #-563	; 8688 <_Min_Stack_Size+0x8288>
    8684:	30322829 	eorscc	r2, r2, r9, lsr #16
    8688:	29303030 	ldmdbcs	r0!, {r4, r5, ip, sp}
    868c:	43324900 	teqmi	r2, #0, 18
    8690:	616c465f 	cmnvs	ip, pc, asr r6
    8694:	4d535f67 	ldclmi	15, cr5, [r3, #-412]	; 0xfffffe64
    8698:	534f4842 	movtpl	r4, #63554	; 0xf842
    869c:	2e2e0054 	mcrcs	0, 1, r0, cr14, cr4, {2}
    86a0:	41434d2f 	cmpmi	r3, pc, lsr #26
    86a4:	32492f4c 	subcc	r2, r9, #76, 30	; 0x130
    86a8:	00632e43 	rsbeq	r2, r3, r3, asr #28
    86ac:	56455449 	strbpl	r5, [r5], -r9, asr #8
    86b0:	004e4554 	subeq	r4, lr, r4, asr r5
    86b4:	5f433249 	svcpl	0x00433249
    86b8:	52444441 	subpl	r4, r4, #1090519040	; 0x41000000
    86bc:	5f535345 	svcpl	0x00535345
    86c0:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    86c4:	5f30315f 	svcpl	0x0030315f
    86c8:	20544942 	subscs	r4, r4, r2, asr #18
    86cc:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    86d0:	5f363174 	svcpl	0x00363174
    86d4:	31282974 			; <UNDEFINED> instruction: 0x31282974
    86d8:	35313c3c 	ldrcc	r3, [r1, #-3132]!	; 0xfffff3c4
    86dc:	434d0029 	movtmi	r0, #53289	; 0xd029
    86e0:	495f4c41 	ldmdbmi	pc, {r0, r6, sl, fp, lr}^	; <UNPREDICTABLE>
    86e4:	4d5f4332 	ldclmi	3, cr4, [pc, #-200]	; 8624 <_Min_Stack_Size+0x8224>
    86e8:	65747361 	ldrbvs	r7, [r4, #-865]!	; 0xfffffc9f
    86ec:	50785272 	rsbspl	r5, r8, r2, ror r2
    86f0:	696c6c6f 	stmdbvs	ip!, {r0, r1, r2, r3, r5, r6, sl, fp, sp, lr}^
    86f4:	4900676e 	stmdbmi	r0, {r1, r2, r3, r5, r6, r8, r9, sl, sp, lr}
    86f8:	535f4332 	cmppl	pc, #-939524096	; 0xc8000000
    86fc:	74726174 	ldrbtvc	r6, [r2], #-372	; 0xfffffe8c
    8700:	43324900 	teqmi	r2, #0, 18
    8704:	616c535f 	cmnvs	ip, pc, asr r3
    8708:	415f6576 	cmpmi	pc, r6, ror r5	; <UNPREDICTABLE>
    870c:	65726464 	ldrbvs	r6, [r2, #-1124]!	; 0xfffffb9c
    8710:	745f7373 	ldrbvc	r7, [pc], #-883	; 8718 <_Min_Stack_Size+0x8318>
    8714:	43324900 	teqmi	r2, #0, 18
    8718:	616c465f 	cmnvs	ip, pc, asr r6
    871c:	45475f67 	strbmi	r5, [r7, #-3943]	; 0xfffff099
    8720:	4c41434e 	mcrrmi	3, 4, r4, r1, cr14
    8724:	3249004c 	subcc	r0, r9, #76	; 0x4c
    8728:	79545f43 	ldmdbvc	r4, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    872c:	65646570 	strbvs	r6, [r4, #-1392]!	; 0xfffffa90
    8730:	32490066 	subcc	r0, r9, #102	; 0x66
    8734:	76455f43 	strbvc	r5, [r5], -r3, asr #30
    8738:	5f746e65 	svcpl	0x00746e65
    873c:	5f515249 	svcpl	0x00515249
    8740:	5f637253 	svcpl	0x00637253
    8744:	504f5453 	subpl	r5, pc, r3, asr r4	; <UNPREDICTABLE>
    8748:	32490046 	subcc	r0, r9, #70	; 0x46
    874c:	43535f43 	cmpmi	r3, #268	; 0x10c
    8750:	335f4b4c 	cmpcc	pc, #76, 22	; 0x13000
    8754:	484b3035 	stmdami	fp, {r0, r2, r4, r5, ip, sp}^
    8758:	5f5f5f5a 	svcpl	0x005f5f5a
    875c:	4f5f4d46 	svcmi	0x005f4d46
    8760:	20594c4e 	subscs	r4, r9, lr, asr #24
    8764:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    8768:	5f323374 	svcpl	0x00323374
    876c:	33282974 			; <UNDEFINED> instruction: 0x33282974
    8770:	30303035 	eorscc	r3, r0, r5, lsr r0
    8774:	49002930 	stmdbmi	r0, {r4, r5, r8, fp, sp}
    8778:	535f4332 	cmppl	pc, #-939524096	; 0xc8000000
    877c:	6576616c 	ldrbvs	r6, [r6, #-364]!	; 0xfffffe94
    8780:	72646441 	rsbvc	r6, r4, #1090519040	; 0x41000000
    8784:	00737365 	rsbseq	r7, r3, r5, ror #6
    8788:	706f7473 	rsbvc	r7, pc, r3, ror r4	; <UNPREDICTABLE>
    878c:	646e6f43 	strbtvs	r6, [lr], #-3907	; 0xfffff0bd
    8790:	6f697469 	svcvs	0x00697469
    8794:	3249006e 	subcc	r0, r9, #110	; 0x6e
    8798:	69445f43 	stmdbvs	r4, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    879c:	74636572 	strbtvc	r6, [r3], #-1394	; 0xfffffa8e
    87a0:	5f6e6f69 	svcpl	0x006e6f69
    87a4:	64616552 	strbtvs	r6, [r1], #-1362	; 0xfffffaae
    87a8:	43324900 	teqmi	r2, #0, 18
