mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    87ac:	616c465f 	cmnvs	ip, pc, asr r6
    87b0:	45505f67 	ldrbmi	r5, [r0, #-3943]	; 0xfffff099
    87b4:	52524543 	subspl	r4, r2, #281018368	; 0x10c00000
    87b8:	43324900 	teqmi	r2, #0, 18
    87bc:	5254535f 	subspl	r5, r4, #2080374785	; 0x7c000001
    87c0:	48435445 	stmdami	r3, {r0, r2, r6, sl, ip, lr}^
    87c4:	444f4d5f 	strbmi	r4, [pc], #-3423	; 87cc <_Min_Stack_Size+0x83cc>
    87c8:	4e455f45 	cdpmi	15, 4, cr5, cr5, cr5, {2}
    87cc:	454c4241 	strbmi	r4, [ip, #-577]	; 0xfffffdbf
    87d0:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    87d4:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    87d8:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    87dc:	49002930 	stmdbmi	r0, {r4, r5, r8, fp, sp}
    87e0:	465f4332 			; <UNDEFINED> instruction: 0x465f4332
    87e4:	5f67616c 	svcpl	0x0067616c
    87e8:	454d4954 	strbmi	r4, [sp, #-2388]	; 0xfffff6ac
    87ec:	0054554f 	subseq	r5, r4, pc, asr #10
    87f0:	54785253 	ldrbtpl	r5, [r8], #-595	; 0xfffffdad
    87f4:	00706d65 	rsbseq	r6, r0, r5, ror #26
    87f8:	5f515249 	svcpl	0x00515249
    87fc:	6c6c6143 	stfvse	f6, [ip], #-268	; 0xfffffef4
    8800:	6b636142 	blvs	18e0d10 <_Min_Stack_Size+0x18e0910>
    8804:	636e7546 	cmnvs	lr, #293601280	; 0x11800000
    8808:	6e6f6974 			; <UNDEFINED> instruction: 0x6e6f6974
    880c:	7272455f 	rsbsvc	r4, r2, #398458880	; 0x17c00000
    8810:	4900726f 	stmdbmi	r0, {r0, r1, r2, r3, r5, r6, r9, ip, sp, lr}
    8814:	455f4332 	ldrbmi	r4, [pc, #-818]	; 84ea <_Min_Stack_Size+0x80ea>
    8818:	726f7272 	rsbvc	r7, pc, #536870919	; 0x20000007
    881c:	5152495f 	cmppl	r2, pc, asr r9
    8820:	6372535f 	cmnvs	r2, #2080374785	; 0x7c000001
    8824:	4c52415f 	ldfmie	f4, [r2], {95}	; 0x5f
    8828:	3249004f 	subcc	r0, r9, #79	; 0x4f
    882c:	43535f43 	cmpmi	r3, #268	; 0x10c
    8830:	355f4b4c 	ldrbcc	r4, [pc, #-2892]	; 7cec <_Min_Stack_Size+0x78ec>
    8834:	5a484b30 	bpl	121b4fc <_Min_Stack_Size+0x121b0fc>
    8838:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    883c:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    8840:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    8844:	30303035 	eorscc	r3, r0, r5, lsr r0
    8848:	49002930 	stmdbmi	r0, {r4, r5, r8, fp, sp}
    884c:	00784332 	rsbseq	r4, r8, r2, lsr r3
    8850:	5f433249 	svcpl	0x00433249
    8854:	4b4c4353 	blmi	13195a8 <_Min_Stack_Size+0x13191a8>
    8858:	3030335f 	eorscc	r3, r0, pc, asr r3
    885c:	5f5a484b 	svcpl	0x005a484b
    8860:	4d465f5f 	stclmi	15, cr5, [r6, #-380]	; 0xfffffe84
    8864:	4c4e4f5f 	mcrrmi	15, 5, r4, lr, cr15
    8868:	75282059 	strvc	r2, [r8, #-89]!	; 0xffffffa7
    886c:	33746e69 	cmncc	r4, #1680	; 0x690
    8870:	29745f32 	ldmdbcs	r4!, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    8874:	30303328 	eorscc	r3, r0, r8, lsr #6
    8878:	29303030 	ldmdbcs	r0!, {r4, r5, ip, sp}
    887c:	42544900 	subsmi	r4, r4, #0, 18
    8880:	4e454655 	mcrmi	6, 2, r4, cr5, cr5, {2}
    8884:	43324900 	teqmi	r2, #0, 18
    8888:	53414d5f 	movtpl	r4, #7519	; 0x1d5f
    888c:	5f524554 	svcpl	0x00524554
    8890:	45455053 	strbmi	r5, [r5, #-83]	; 0xffffffad
    8894:	4f4d5f44 	svcmi	0x004d5f44
    8898:	465f4544 	ldrbmi	r4, [pc], -r4, asr #10
    889c:	7528204d 	strvc	r2, [r8, #-77]!	; 0xffffffb3
    88a0:	31746e69 	cmncc	r4, r9, ror #28
    88a4:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    88a8:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    88ac:	00293531 	eoreq	r3, r9, r1, lsr r5
    88b0:	5f433249 	svcpl	0x00433249
    88b4:	6f727245 	svcvs	0x00727245
    88b8:	52495f72 	subpl	r5, r9, #456	; 0x1c8
    88bc:	72535f51 	subsvc	r5, r3, #324	; 0x144
    88c0:	4d535f63 	ldclmi	15, cr5, [r3, #-396]	; 0xfffffe74
    88c4:	454c4142 	strbmi	r4, [ip, #-322]	; 0xfffffebe
    88c8:	49005452 	stmdbmi	r0, {r1, r4, r6, sl, ip, lr}
    88cc:	535f4332 	cmppl	pc, #-939524096	; 0xc8000000
    88d0:	5f4b4c43 	svcpl	0x004b4c43
    88d4:	4b303532 	blmi	c15da4 <_Min_Stack_Size+0xc159a4>
    88d8:	5f5f5a48 	svcpl	0x005f5a48
    88dc:	5f4d465f 	svcpl	0x004d465f
    88e0:	594c4e4f 	stmdbpl	ip, {r0, r1, r2, r3, r6, r9, sl, fp, lr}^
    88e4:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    88e8:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    88ec:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    88f0:	30303532 	eorscc	r3, r0, r2, lsr r5
    88f4:	00293030 	eoreq	r3, r9, r0, lsr r0
    88f8:	5f433249 	svcpl	0x00433249
    88fc:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    8900:	745f6769 	ldrbvc	r6, [pc], #-1897	; 8908 <_Min_Stack_Size+0x8508>
    8904:	43324900 	teqmi	r2, #0, 18
    8908:	7265505f 	rsbvc	r5, r5, #95	; 0x5f
    890c:	65687069 	strbvs	r7, [r8, #-105]!	; 0xffffff97
    8910:	4d6c6172 	stfmie	f6, [ip, #-456]!	; 0xfffffe38
    8914:	0065646f 	rsbeq	r6, r5, pc, ror #8
    8918:	5f433249 	svcpl	0x00433249
    891c:	4b4c4353 	blmi	1319670 <_Min_Stack_Size+0x1319270>
    8920:	4b30345f 	blmi	c15aa4 <_Min_Stack_Size+0xc156a4>
    8924:	28205a48 	stmdacs	r0!, {r3, r6, r9, fp, ip, lr}
    8928:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    892c:	745f3233 	ldrbvc	r3, [pc], #-563	; 8934 <_Min_Stack_Size+0x8534>
    8930:	30342829 	eorscc	r2, r4, r9, lsr #16
    8934:	29303030 	ldmdbcs	r0!, {r4, r5, ip, sp}
    8938:	43324900 	teqmi	r2, #0, 18
    893c:	56455f31 			; <UNDEFINED> instruction: 0x56455f31
    8940:	5152495f 	cmppl	r2, pc, asr r9
    8944:	646e6148 	strbtvs	r6, [lr], #-328	; 0xfffffeb8
    8948:	0072656c 	rsbseq	r6, r2, ip, ror #10
    894c:	52495f67 	subpl	r5, r9, #412	; 0x19c
    8950:	32495f51 	subcc	r5, r9, #324	; 0x144
    8954:	455f3243 	ldrbmi	r3, [pc, #-579]	; 8719 <_Min_Stack_Size+0x8319>
    8958:	746e6576 	strbtvc	r6, [lr], #-1398	; 0xfffffa8a
    895c:	6c61435f 	stclvs	3, cr4, [r1], #-380	; 0xfffffe84
    8960:	6361426c 	cmnvs	r1, #108, 4	; 0xc0000006
    8964:	6e75466b 	cdpvs	6, 7, cr4, cr5, cr11, {3}
    8968:	6f697463 	svcvs	0x00697463
    896c:	5f67006e 	svcpl	0x0067006e
    8970:	5f515249 	svcpl	0x00515249
    8974:	31433249 	cmpcc	r3, r9, asr #4
    8978:	7272455f 	rsbsvc	r4, r2, #398458880	; 0x17c00000
    897c:	435f726f 	cmpmi	pc, #-268435450	; 0xf0000006
    8980:	426c6c61 	rsbmi	r6, ip, #24832	; 0x6100
    8984:	466b6361 	strbtmi	r6, [fp], -r1, ror #6
    8988:	74636e75 	strbtvc	r6, [r3], #-3701	; 0xfffff18b
    898c:	006e6f69 	rsbeq	r6, lr, r9, ror #30
    8990:	5f433249 	svcpl	0x00433249
    8994:	6f727245 	svcvs	0x00727245
    8998:	52495f72 	subpl	r5, r9, #456	; 0x1c8
    899c:	72535f51 	subsvc	r5, r3, #324	; 0x144
    89a0:	45425f63 	strbmi	r5, [r2, #-3939]	; 0xfffff09d
    89a4:	49005252 	stmdbmi	r0, {r1, r4, r6, r9, ip, lr}
    89a8:	535f4332 	cmppl	pc, #-939524096	; 0xc8000000
    89ac:	5f4b4c43 	svcpl	0x004b4c43
    89b0:	484b3038 	stmdami	fp, {r3, r4, r5, ip, sp}^
    89b4:	7528205a 	strvc	r2, [r8, #-90]!	; 0xffffffa6
    89b8:	33746e69 	cmncc	r4, #1680	; 0x690
    89bc:	29745f32 	ldmdbcs	r4!, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    89c0:	30303828 	eorscc	r3, r0, r8, lsr #16
    89c4:	00293030 	eoreq	r3, r9, r0, lsr r0
    89c8:	5f433249 	svcpl	0x00433249
    89cc:	67616c46 	strbvs	r6, [r1, -r6, asr #24]!
    89d0:	5345525f 	movtpl	r5, #21087	; 0x525f
    89d4:	45565245 	ldrbmi	r5, [r6, #-581]	; 0xfffffdbb
    89d8:	49003144 	stmdbmi	r0, {r2, r6, r8, ip, sp}
    89dc:	465f4332 			; <UNDEFINED> instruction: 0x465f4332
    89e0:	5f67616c 	svcpl	0x0067616c
    89e4:	45534552 	ldrbmi	r4, [r3, #-1362]	; 0xfffffaae
    89e8:	44455652 	strbmi	r5, [r5], #-1618	; 0xfffff9ae
    89ec:	32490032 	subcc	r0, r9, #50	; 0x32
    89f0:	43535f43 	cmpmi	r3, #268	; 0x10c
    89f4:	315f4b4c 	cmpcc	pc, ip, asr #22
    89f8:	484b3030 	stmdami	fp, {r4, r5, ip, sp}^
    89fc:	7528205a 	strvc	r2, [r8, #-90]!	; 0xffffffa6
    8a00:	33746e69 	cmncc	r4, #1680	; 0x690
    8a04:	29745f32 	ldmdbcs	r4!, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    8a08:	30303128 	eorscc	r3, r0, r8, lsr #2
    8a0c:	29303030 	ldmdbcs	r0!, {r4, r5, ip, sp}
    8a10:	43324900 	teqmi	r2, #0, 18
    8a14:	616c465f 	cmnvs	ip, pc, asr r6
    8a18:	58525f67 	ldmdapl	r2, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    8a1c:	4900454e 	stmdbmi	r0, {r1, r2, r3, r6, r8, sl, lr}
    8a20:	535f4332 	cmppl	pc, #-939524096	; 0xc8000000
    8a24:	5f4b4c43 	svcpl	0x004b4c43
    8a28:	4b303032 	blmi	c14af8 <_Min_Stack_Size+0xc146f8>
    8a2c:	5f5f5a48 	svcpl	0x005f5a48
    8a30:	5f4d465f 	svcpl	0x004d465f
    8a34:	594c4e4f 	stmdbpl	ip, {r0, r1, r2, r3, r6, r9, sl, fp, lr}^
    8a38:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    8a3c:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    8a40:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    8a44:	30303032 	eorscc	r3, r0, r2, lsr r0
    8a48:	00293030 	eoreq	r3, r9, r0, lsr r0
    8a4c:	5f434e49 	svcpl	0x00434e49
    8a50:	5f434352 	svcpl	0x00434352
    8a54:	00205f48 	eoreq	r5, r0, r8, asr #30
    8a58:	5f433249 	svcpl	0x00433249
    8a5c:	45525453 	ldrbmi	r5, [r2, #-1107]	; 0xfffffbad
    8a60:	5f484354 	svcpl	0x00484354
    8a64:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    8a68:	5349445f 	movtpl	r4, #37983	; 0x945f
    8a6c:	454c4241 	strbmi	r4, [ip, #-577]	; 0xfffffdbf
    8a70:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    8a74:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    8a78:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    8a7c:	373c3c31 			; <UNDEFINED> instruction: 0x373c3c31
    8a80:	32490029 	subcc	r0, r9, #41	; 0x29
    8a84:	614d5f43 	cmpvs	sp, r3, asr #30
    8a88:	72657473 	rsbvc	r7, r5, #1929379840	; 0x73000000
    8a8c:	65657053 	strbvs	r7, [r5, #-83]!	; 0xffffffad
    8a90:	646f4d64 	strbtvs	r4, [pc], #-3428	; 8a98 <_Min_Stack_Size+0x8698>
    8a94:	32490065 	subcc	r0, r9, #101	; 0x65
    8a98:	72455f43 	subvc	r5, r5, #268	; 0x10c
    8a9c:	5f726f72 	svcpl	0x00726f72
    8aa0:	5f515249 	svcpl	0x00515249
    8aa4:	5f637253 	svcpl	0x00637253
    8aa8:	0052564f 	subseq	r5, r2, pc, asr #12
    8aac:	5f433249 	svcpl	0x00433249
    8ab0:	72617453 	rsbvc	r7, r1, #1392508928	; 0x53000000
    8ab4:	74535f74 	ldrbvc	r5, [r3], #-3956	; 0xfffff08c
    8ab8:	73757461 	cmnvc	r5, #1627389952	; 0x61000000
    8abc:	4900745f 	stmdbmi	r0, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    8ac0:	465f4332 			; <UNDEFINED> instruction: 0x465f4332
    8ac4:	5f67616c 	svcpl	0x0067616c
    8ac8:	52444441 	subpl	r4, r4, #1090519040	; 0x41000000
    8acc:	43324900 	teqmi	r2, #0, 18
    8ad0:	52455f32 	subpl	r5, r5, #50, 30	; 0xc8
    8ad4:	5152495f 	cmppl	r2, pc, asr r9
    8ad8:	646e6148 	strbtvs	r6, [lr], #-328	; 0xfffffeb8
    8adc:	0072656c 	rsbseq	r6, r2, ip, ror #10
    8ae0:	5f433249 	svcpl	0x00433249
    8ae4:	5f6b6341 	svcpl	0x006b6341
    8ae8:	61736944 	cmnvs	r3, r4, asr #18
    8aec:	00656c62 	rsbeq	r6, r5, r2, ror #24
    8af0:	706f7473 	rsbvc	r7, pc, r3, ror r4	; <UNPREDICTABLE>
    8af4:	74617453 	strbtvc	r7, [r1], #-1107	; 0xfffffbad
    8af8:	4d007375 	stcmi	3, cr7, [r0, #-468]	; 0xfffffe2c
    8afc:	5f4c4143 	svcpl	0x004c4143
    8b00:	5f433249 	svcpl	0x00433249
    8b04:	656e6547 	strbvs	r6, [lr, #-1351]!	; 0xfffffab9
    8b08:	65746172 	ldrbvs	r6, [r4, #-370]!	; 0xfffffe8e
    8b0c:	706f7453 	rsbvc	r7, pc, r3, asr r4	; <UNPREDICTABLE>
    8b10:	43324900 	teqmi	r2, #0, 18
    8b14:	4b43415f 	blmi	10d9098 <_Min_Stack_Size+0x10d8c98>
    8b18:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    8b1c:	49006769 	stmdbmi	r0, {r0, r3, r5, r6, r8, r9, sl, sp, lr}
    8b20:	465f4332 			; <UNDEFINED> instruction: 0x465f4332
    8b24:	5f67616c 	svcpl	0x0067616c
    8b28:	504f5453 	subpl	r5, pc, r3, asr r4	; <UNPREDICTABLE>
    8b2c:	74730046 	ldrbtvc	r0, [r3], #-70	; 0xffffffba
    8b30:	43747261 	cmnmi	r4, #268435462	; 0x10000006
    8b34:	69646e6f 	stmdbvs	r4!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    8b38:	6e6f6974 			; <UNDEFINED> instruction: 0x6e6f6974
    8b3c:	43324900 	teqmi	r2, #0, 18
    8b40:	7272455f 	rsbsvc	r4, r2, #398458880	; 0x17c00000
    8b44:	495f726f 	ldmdbmi	pc, {r0, r1, r2, r3, r5, r6, r9, ip, sp, lr}^	; <UNPREDICTABLE>
    8b48:	535f5152 	cmppl	pc, #-2147483628	; 0x80000014
    8b4c:	505f6372 	subspl	r6, pc, r2, ror r3	; <UNPREDICTABLE>
    8b50:	52454345 	subpl	r4, r5, #335544321	; 0x14000001
    8b54:	32490052 	subcc	r0, r9, #82	; 0x52
    8b58:	43535f43 	cmpmi	r3, #268	; 0x10c
    8b5c:	345f4b4c 	ldrbcc	r4, [pc], #-2892	; 8b64 <_Min_Stack_Size+0x8764>
    8b60:	484b3030 	stmdami	fp, {r4, r5, ip, sp}^
    8b64:	5f5f5f5a 	svcpl	0x005f5f5a
    8b68:	4f5f4d46 	svcmi	0x005f4d46
    8b6c:	20594c4e 	subscs	r4, r9, lr, asr #24
    8b70:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    8b74:	5f323374 	svcpl	0x00323374
    8b78:	34282974 	strtcc	r2, [r8], #-2420	; 0xfffff68c
    8b7c:	30303030 	eorscc	r3, r0, r0, lsr r0
    8b80:	49002930 	stmdbmi	r0, {r4, r5, r8, fp, sp}
    8b84:	535f4332 	cmppl	pc, #-939524096	; 0xc8000000
    8b88:	74726174 	ldrbtvc	r6, [r2], #-372	; 0xfffffe8c
    8b8c:	6e6f435f 	mcrvs	3, 3, r4, cr15, cr15, {2}
    8b90:	69746964 	ldmdbvs	r4!, {r2, r5, r6, r8, fp, sp, lr}^
    8b94:	745f6e6f 	ldrbvc	r6, [pc], #-3695	; 8b9c <_Min_Stack_Size+0x879c>
    8b98:	43324900 	teqmi	r2, #0, 18
    8b9c:	6f74535f 	svcvs	0x0074535f
    8ba0:	69445f70 	stmdbvs	r4, {r4, r5, r6, r8, r9, sl, fp, ip, lr}^
    8ba4:	6c626173 	stfvse	f6, [r2], #-460	; 0xfffffe34
    8ba8:	32490065 	subcc	r0, r9, #101	; 0x65
    8bac:	50475f43 	subpl	r5, r7, r3, asr #30
    8bb0:	535f4f49 	cmppl	pc, #292	; 0x124
    8bb4:	69507465 	ldmdbvs	r0, {r0, r2, r5, r6, sl, ip, sp, lr}^
    8bb8:	4900736e 	stmdbmi	r0, {r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    8bbc:	535f4332 	cmppl	pc, #-939524096	; 0xc8000000
    8bc0:	00706f74 	rsbseq	r6, r0, r4, ror pc
    8bc4:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
    8bc8:	4332495f 	teqmi	r2, #1556480	; 0x17c000
    8bcc:	73614d5f 	cmnvc	r1, #6080	; 0x17c0
    8bd0:	52726574 	rsbspl	r6, r2, #116, 10	; 0x1d000000
    8bd4:	61446365 	cmpvs	r4, r5, ror #6
    8bd8:	6f506174 	svcvs	0x00506174
    8bdc:	6e696c6c 	cdpvs	12, 6, cr6, cr9, cr12, {3}
    8be0:	32490067 	subcc	r0, r9, #103	; 0x67
    8be4:	6c465f43 	mcrrvs	15, 4, r5, r6, cr3
    8be8:	415f6761 	cmpmi	pc, r1, ror #14
    8bec:	004f4c52 	subeq	r4, pc, r2, asr ip	; <UNPREDICTABLE>
    8bf0:	5f433249 	svcpl	0x00433249
    8bf4:	76616c53 			; <UNDEFINED> instruction: 0x76616c53
    8bf8:	76654465 	strbtvc	r4, [r5], -r5, ror #8
    8bfc:	5f656369 	svcpl	0x00656369
    8c00:	6f636553 	svcvs	0x00636553
    8c04:	7261646e 	rsbvc	r6, r1, #1845493760	; 0x6e000000
    8c08:	64644179 	strbtvs	r4, [r4], #-377	; 0xfffffe87
    8c0c:	73736572 	cmnvc	r3, #478150656	; 0x1c800000
    8c10:	78527000 	ldmdavc	r2, {ip, sp, lr}^
    8c14:	66667542 	strbtvs	r7, [r6], -r2, asr #10
    8c18:	49007265 	stmdbmi	r0, {r0, r2, r5, r6, r9, ip, sp, lr}
    8c1c:	4e5f4332 	mrcmi	3, 2, r4, cr15, cr2, {1}
    8c20:	74535f6f 	ldrbvc	r5, [r3], #-3951	; 0xfffff091
    8c24:	4900706f 	stmdbmi	r0, {r0, r1, r2, r3, r5, r6, ip, sp, lr}
    8c28:	495f4332 	ldmdbmi	pc, {r1, r4, r5, r8, r9, lr}^	; <UNPREDICTABLE>
    8c2c:	495f5152 	ldmdbmi	pc, {r1, r4, r6, r8, ip, lr}^	; <UNPREDICTABLE>
    8c30:	52524554 	subspl	r4, r2, #84, 10	; 0x15000000
    8c34:	28204e45 	stmdacs	r0!, {r0, r2, r6, r9, sl, fp, lr}
    8c38:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    8c3c:	745f3631 	ldrbvc	r3, [pc], #-1585	; 8c44 <_Min_Stack_Size+0x8844>
    8c40:	3c312829 	ldccc	8, cr2, [r1], #-164	; 0xffffff5c
    8c44:	0029383c 	eoreq	r3, r9, ip, lsr r8
    8c48:	5f433249 	svcpl	0x00433249
    8c4c:	4b4c4353 	blmi	13199a0 <_Min_Stack_Size+0x13195a0>
    8c50:	3035315f 	eorscc	r3, r5, pc, asr r1
    8c54:	5f5a484b 	svcpl	0x005a484b
    8c58:	4d465f5f 	stclmi	15, cr5, [r6, #-380]	; 0xfffffe84
    8c5c:	4c4e4f5f 	mcrrmi	15, 5, r4, lr, cr15
    8c60:	75282059 	strvc	r2, [r8, #-89]!	; 0xffffffa7
    8c64:	33746e69 	cmncc	r4, #1680	; 0x690
    8c68:	29745f32 	ldmdbcs	r4!, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    8c6c:	30353128 	eorscc	r3, r5, r8, lsr #2
    8c70:	29303030 	ldmdbcs	r0!, {r4, r5, ip, sp}
    8c74:	43324900 	teqmi	r2, #0, 18
    8c78:	5152495f 	cmppl	r2, pc, asr r9
    8c7c:	5449495f 	strbpl	r4, [r9], #-2399	; 0xfffff6a1
    8c80:	45465542 	strbmi	r5, [r6, #-1346]	; 0xfffffabe
    8c84:	7528204e 	strvc	r2, [r8, #-78]!	; 0xffffffb2
    8c88:	31746e69 	cmncc	r4, r9, ror #28
    8c8c:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    8c90:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    8c94:	00293031 	eoreq	r3, r9, r1, lsr r0
    8c98:	5f433249 	svcpl	0x00433249
    8c9c:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    8ca0:	4332495f 	teqmi	r2, #1556480	; 0x17c000
    8ca4:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    8ca8:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    8cac:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    8cb0:	49002930 	stmdbmi	r0, {r4, r5, r8, fp, sp}
    8cb4:	535f4332 	cmppl	pc, #-939524096	; 0xc8000000
    8cb8:	74657274 	strbtvc	r7, [r5], #-628	; 0xfffffd8c
    8cbc:	6f4d6863 	svcvs	0x004d6863
    8cc0:	49006564 	stmdbmi	r0, {r2, r5, r6, r8, sl, sp, lr}
    8cc4:	465f4332 			; <UNDEFINED> instruction: 0x465f4332
    8cc8:	5f67616c 	svcpl	0x0067616c
    8ccc:	49004253 	stmdbmi	r0, {r0, r1, r4, r6, r9, lr}
    8cd0:	535f4332 	cmppl	pc, #-939524096	; 0xc8000000
    8cd4:	5f4b4c43 	svcpl	0x004b4c43
    8cd8:	484b3037 	stmdami	fp, {r0, r1, r2, r4, r5, ip, sp}^
    8cdc:	7528205a 	strvc	r2, [r8, #-90]!	; 0xffffffa6
    8ce0:	33746e69 	cmncc	r4, #1680	; 0x690
    8ce4:	29745f32 	ldmdbcs	r4!, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    8ce8:	30303728 	eorscc	r3, r0, r8, lsr #14
    8cec:	00293030 	eoreq	r3, r9, r0, lsr r0
    8cf0:	5f433249 	svcpl	0x00433249
    8cf4:	67616c46 	strbvs	r6, [r1, -r6, asr #24]!
    8cf8:	5245425f 	subpl	r4, r5, #-268435451	; 0xf0000005
    8cfc:	32490052 	subcc	r0, r9, #82	; 0x52
    8d00:	76455f43 	strbvc	r5, [r5], -r3, asr #30
    8d04:	5f746e65 	svcpl	0x00746e65
    8d08:	5f515249 	svcpl	0x00515249
    8d0c:	5f637253 	svcpl	0x00637253
    8d10:	52444441 	subpl	r4, r4, #1090519040	; 0x41000000
    8d14:	43324900 	teqmi	r2, #0, 18
    8d18:	616c465f 	cmnvs	ip, pc, asr r6
    8d1c:	52545f67 	subspl	r5, r4, #412	; 0x19c
    8d20:	434d0041 	movtmi	r0, #53313	; 0xd041
    8d24:	495f4c41 	ldmdbmi	pc, {r0, r6, sl, fp, lr}^	; <UNPREDICTABLE>
    8d28:	4d5f4332 	ldclmi	3, cr4, [pc, #-200]	; 8c68 <_Min_Stack_Size+0x8868>
    8d2c:	65747361 	ldrbvs	r7, [r4, #-865]!	; 0xfffffc9f
    8d30:	50785472 	rsbspl	r5, r8, r2, ror r4
    8d34:	696c6c6f 	stmdbvs	ip!, {r0, r1, r2, r3, r5, r6, sl, fp, sp, lr}^
    8d38:	7400676e 	strvc	r6, [r0], #-1902	; 0xfffff892
    8d3c:	31706d65 	cmncc	r0, r5, ror #26
    8d40:	6d657400 	cfstrdvs	mvd7, [r5, #-0]
    8d44:	49003270 	stmdbmi	r0, {r4, r5, r6, r9, ip, sp}
    8d48:	455f4332 	ldrbmi	r4, [pc, #-818]	; 8a1e <_Min_Stack_Size+0x861e>
    8d4c:	746e6576 	strbtvc	r6, [lr], #-1398	; 0xfffffa8a
    8d50:	5152495f 	cmppl	r2, pc, asr r9
    8d54:	6372535f 	cmnvs	r2, #2080374785	; 0x7c000001
    8d58:	4444415f 	strbmi	r4, [r4], #-351	; 0xfffffea1
    8d5c:	49003031 	stmdbmi	r0, {r0, r4, r5, ip, sp}
    8d60:	465f4332 			; <UNDEFINED> instruction: 0x465f4332
    8d64:	5f67616c 	svcpl	0x0067616c
    8d68:	00455854 	subeq	r5, r5, r4, asr r8
    8d6c:	5f524343 	svcpl	0x00524343
    8d70:	756c6156 	strbvc	r6, [ip, #-342]!	; 0xfffffeaa
    8d74:	32490065 	subcc	r0, r9, #101	; 0x65
    8d78:	4c535f43 	mrrcmi	15, 4, r5, r3, cr3
    8d7c:	5f455641 	svcpl	0x00455641
    8d80:	4c415544 	cfstr64mi	mvdx5, [r1], {68}	; 0x44
    8d84:	5f595449 	svcpl	0x00595449
    8d88:	42414e45 	submi	r4, r1, #1104	; 0x450
    8d8c:	2820454c 	stmdacs	r0!, {r2, r3, r6, r8, sl, lr}
    8d90:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    8d94:	745f3631 	ldrbvc	r3, [pc], #-1585	; 8d9c <_Min_Stack_Size+0x899c>
    8d98:	3c312829 	ldccc	8, cr2, [r1], #-164	; 0xffffff5c
    8d9c:	0029303c 	eoreq	r3, r9, ip, lsr r0
    8da0:	5f433249 	svcpl	0x00433249
    8da4:	4b4c4353 	blmi	1319af8 <_Min_Stack_Size+0x13196f8>
    8da8:	43324900 	teqmi	r2, #0, 18
    8dac:	6464415f 	strbtvs	r4, [r4], #-351	; 0xfffffea1
    8db0:	73736572 	cmnvc	r3, #478150656	; 0x1c800000
    8db4:	65646f4d 	strbvs	r6, [r4, #-3917]!	; 0xfffff0b3
    8db8:	43324900 	teqmi	r2, #0, 18
    8dbc:	6576455f 	ldrbvs	r4, [r6, #-1375]!	; 0xfffffaa1
    8dc0:	495f746e 	ldmdbmi	pc, {r1, r2, r3, r5, r6, sl, ip, sp, lr}^	; <UNPREDICTABLE>
    8dc4:	535f5152 	cmppl	pc, #-2147483628	; 0x80000014
    8dc8:	745f6372 	ldrbvc	r6, [pc], #-882	; 8dd0 <_Min_Stack_Size+0x89d0>
    8dcc:	41434d00 	cmpmi	r3, r0, lsl #26
    8dd0:	32495f4c 	subcc	r5, r9, #76, 30	; 0x130
    8dd4:	614d5f43 	cmpvs	sp, r3, asr #30
    8dd8:	72657473 	rsbvc	r7, r5, #1929379840	; 0x73000000
    8ddc:	646e6553 	strbtvs	r6, [lr], #-1363	; 0xfffffaad
    8de0:	61746144 	cmnvs	r4, r4, asr #2
    8de4:	6c6c6f50 	stclvs	15, cr6, [ip], #-320	; 0xfffffec0
    8de8:	00676e69 	rsbeq	r6, r7, r9, ror #28
    8dec:	5f433249 	svcpl	0x00433249
    8df0:	49524550 	ldmdbmi	r2, {r4, r6, r8, sl, lr}^
    8df4:	52454850 	subpl	r4, r5, #80, 16	; 0x500000
    8df8:	455f4c41 	ldrbmi	r4, [pc, #-3137]	; 81bf <_Min_Stack_Size+0x7dbf>
    8dfc:	4c42414e 	stfmie	f4, [r2], {78}	; 0x4e
    8e00:	49425f45 	stmdbmi	r2, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
    8e04:	75282054 	strvc	r2, [r8, #-84]!	; 0xffffffac
    8e08:	31746e69 	cmncc	r4, r9, ror #28
    8e0c:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    8e10:	00293028 	eoreq	r3, r9, r8, lsr #32
    8e14:	5f433249 	svcpl	0x00433249
    8e18:	67616c46 	strbvs	r6, [r1, -r6, asr #24]!
    8e1c:	4444415f 	strbmi	r4, [r4], #-351	; 0xfffffea1
    8e20:	49003031 	stmdbmi	r0, {r0, r4, r5, ip, sp}
    8e24:	535f4332 	cmppl	pc, #-939524096	; 0xc8000000
    8e28:	74726174 	ldrbtvc	r6, [r2], #-372	; 0xfffffe8c
    8e2c:	7369445f 	cmnvc	r9, #1593835520	; 0x5f000000
    8e30:	656c6261 	strbvs	r6, [ip, #-609]!	; 0xfffffd9f
    8e34:	43324900 	teqmi	r2, #0, 18
    8e38:	616c465f 	cmnvs	ip, pc, asr r6
    8e3c:	4d535f67 	ldclmi	15, cr5, [r3, #-412]	; 0xfffffe64
    8e40:	46454442 	strbmi	r4, [r5], -r2, asr #8
    8e44:	544c5541 	strbpl	r5, [ip], #-1345	; 0xfffffabf
    8e48:	61747300 	cmnvs	r4, r0, lsl #6
    8e4c:	74537472 	ldrbvc	r7, [r3], #-1138	; 0xfffffb8e
    8e50:	73757461 	cmnvc	r5, #1627389952	; 0x61000000
    8e54:	43324900 	teqmi	r2, #0, 18
    8e58:	616c535f 	cmnvs	ip, pc, asr r3
    8e5c:	65446576 	strbvs	r6, [r4, #-1398]	; 0xfffffa8a
    8e60:	65636976 	strbvs	r6, [r3, #-2422]!	; 0xfffff68a
    8e64:	6c617544 	cfstr64vs	mvdx7, [r1], #-272	; 0xfffffef0
    8e68:	00797469 	rsbseq	r7, r9, r9, ror #8
    8e6c:	5f433249 	svcpl	0x00433249
    8e70:	5f515249 	svcpl	0x00515249
    8e74:	56455449 	strbpl	r5, [r5], -r9, asr #8
    8e78:	204e4546 	subcs	r4, lr, r6, asr #10
    8e7c:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    8e80:	5f363174 	svcpl	0x00363174
    8e84:	31282974 			; <UNDEFINED> instruction: 0x31282974
    8e88:	29393c3c 	ldmdbcs	r9!, {r2, r3, r4, r5, sl, fp, ip, sp}
    8e8c:	43324900 	teqmi	r2, #0, 18
    8e90:	616c465f 	cmnvs	ip, pc, asr r6
    8e94:	65535f67 	ldrbvs	r5, [r3, #-3943]	; 0xfffff099
    8e98:	65640074 	strbvs	r0, [r4, #-116]!	; 0xffffff8c
    8e9c:	64644176 	strbtvs	r4, [r4], #-374	; 0xfffffe8a
    8ea0:	73736572 	cmnvc	r3, #478150656	; 0x1c800000
    8ea4:	43324900 	teqmi	r2, #0, 18
    8ea8:	6f74535f 	svcvs	0x0074535f
    8eac:	6e455f70 	mcrvs	15, 2, r5, cr5, cr0, {3}
    8eb0:	656c6261 	strbvs	r6, [ip, #-609]!	; 0xfffffd9f
    8eb4:	43324900 	teqmi	r2, #0, 18
    8eb8:	6f74535f 	svcvs	0x0074535f
    8ebc:	6f435f70 	svcvs	0x00435f70
    8ec0:	7469646e 	strbtvc	r6, [r9], #-1134	; 0xfffffb92
    8ec4:	5f6e6f69 	svcpl	0x006e6f69
    8ec8:	54490074 	strbpl	r0, [r9], #-116	; 0xffffff8c
    8ecc:	45525245 	ldrbmi	r5, [r2, #-581]	; 0xfffffdbb
    8ed0:	3249004e 	subcc	r0, r9, #78	; 0x4e
    8ed4:	43535f43 	cmpmi	r3, #268	; 0x10c
    8ed8:	335f4b4c 	cmpcc	pc, #76, 22	; 0x13000
    8edc:	5a484b30 	bpl	121bba4 <_Min_Stack_Size+0x121b7a4>
    8ee0:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    8ee4:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    8ee8:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
