mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    8eec:	30303033 	eorscc	r3, r0, r3, lsr r0
    8ef0:	49002930 	stmdbmi	r0, {r4, r5, r8, fp, sp}
    8ef4:	465f4332 			; <UNDEFINED> instruction: 0x465f4332
    8ef8:	5f67616c 	svcpl	0x0067616c
    8efc:	0052564f 	subseq	r5, r2, pc, asr #12
    8f00:	706d6554 	rsbvc	r6, sp, r4, asr r5
    8f04:	5400325f 	strpl	r3, [r0], #-607	; 0xfffffda1
    8f08:	5f706d65 	svcpl	0x00706d65
    8f0c:	32490033 	subcc	r0, r9, #51	; 0x33
    8f10:	74535f43 	ldrbvc	r5, [r3], #-3907	; 0xfffff0bd
    8f14:	535f706f 	cmppl	pc, #111	; 0x6f
    8f18:	75746174 	ldrbvc	r6, [r4, #-372]!	; 0xfffffe8c
    8f1c:	00745f73 	rsbseq	r5, r4, r3, ror pc
    8f20:	5f433249 	svcpl	0x00433249
    8f24:	4b4c4353 	blmi	1319c78 <_Min_Stack_Size+0x1319878>
    8f28:	4b30365f 	blmi	c168ac <_Min_Stack_Size+0xc164ac>
    8f2c:	28205a48 	stmdacs	r0!, {r3, r6, r9, fp, ip, lr}
    8f30:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    8f34:	745f3233 	ldrbvc	r3, [pc], #-563	; 8f3c <_Min_Stack_Size+0x8b3c>
    8f38:	30362829 	eorscc	r2, r6, r9, lsr #16
    8f3c:	29303030 	ldmdbcs	r0!, {r4, r5, ip, sp}
    8f40:	43324900 	teqmi	r2, #0, 18
    8f44:	4c43535f 	mcrrmi	3, 5, r5, r3, cr15
    8f48:	30395f4b 	eorscc	r5, r9, fp, asr #30
    8f4c:	205a484b 	subscs	r4, sl, fp, asr #16
    8f50:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    8f54:	5f323374 	svcpl	0x00323374
    8f58:	39282974 	stmdbcc	r8!, {r2, r4, r5, r6, r8, fp, sp}
    8f5c:	30303030 	eorscc	r3, r0, r0, lsr r0
    8f60:	32490029 	subcc	r0, r9, #41	; 0x29
    8f64:	6c465f43 	mcrrvs	15, 4, r5, r6, cr3
    8f68:	525f6761 	subspl	r6, pc, #25427968	; 0x1840000
    8f6c:	74657365 	strbtvc	r7, [r5], #-869	; 0xfffffc9b
    8f70:	495f6700 	ldmdbmi	pc, {r8, r9, sl, sp, lr}^	; <UNPREDICTABLE>
    8f74:	495f5152 	ldmdbmi	pc, {r1, r4, r6, r8, ip, lr}^	; <UNPREDICTABLE>
    8f78:	5f314332 	svcpl	0x00314332
    8f7c:	6e657645 	cdpvs	6, 6, cr7, cr5, cr5, {2}
    8f80:	61435f74 	hvcvs	13812	; 0x35f4
    8f84:	61426c6c 	cmpvs	r2, ip, ror #24
    8f88:	75466b63 	strbvc	r6, [r6, #-2915]	; 0xfffff49d
    8f8c:	6974636e 	ldmdbvs	r4!, {r1, r2, r3, r5, r6, r8, r9, sp, lr}^
    8f90:	49006e6f 	stmdbmi	r0, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}
    8f94:	475f4332 	smmlarmi	pc, r2, r3, r4	; <UNPREDICTABLE>
    8f98:	72656e65 	rsbvc	r6, r5, #1616	; 0x650
    8f9c:	61436c61 	cmpvs	r3, r1, ror #24
    8fa0:	64416c6c 	strbvs	r6, [r1], #-3180	; 0xfffff394
    8fa4:	73657264 	cmnvc	r5, #100, 4	; 0x40000006
    8fa8:	32490073 	subcc	r0, r9, #115	; 0x73
    8fac:	6c535f43 	mrrcvs	15, 4, r5, r3, cr3
    8fb0:	44657661 	strbtmi	r7, [r5], #-1633	; 0xfffff99f
    8fb4:	63697665 	cmnvs	r9, #105906176	; 0x6500000
    8fb8:	72505f65 	subsvc	r5, r0, #404	; 0x194
    8fbc:	72616d69 	rsbvc	r6, r1, #6720	; 0x1a40
    8fc0:	64644179 	strbtvs	r4, [r4], #-377	; 0xfffffe87
    8fc4:	73736572 	cmnvc	r3, #478150656	; 0x1c800000
    8fc8:	43324900 	teqmi	r2, #0, 18
    8fcc:	414c535f 	cmpmi	ip, pc, asr r3
    8fd0:	445f4556 	ldrbmi	r4, [pc], #-1366	; 8fd8 <_Min_Stack_Size+0x8bd8>
    8fd4:	494c4155 	stmdbmi	ip, {r0, r2, r4, r6, r8, lr}^
    8fd8:	445f5954 	ldrbmi	r5, [pc], #-2388	; 8fe0 <_Min_Stack_Size+0x8be0>
    8fdc:	42415349 	submi	r5, r1, #603979777	; 0x24000001
    8fe0:	2820454c 	stmdacs	r0!, {r2, r3, r6, r8, sl, lr}
    8fe4:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    8fe8:	745f3631 	ldrbvc	r3, [pc], #-1585	; 8ff0 <_Min_Stack_Size+0x8bf0>
    8fec:	29302829 	ldmdbcs	r0!, {r0, r3, r5, fp, sp}
    8ff0:	43324900 	teqmi	r2, #0, 18
    8ff4:	6b63415f 	blvs	18d9578 <_Min_Stack_Size+0x18d9178>
    8ff8:	616e455f 	cmnvs	lr, pc, asr r5
    8ffc:	00656c62 	rsbeq	r6, r5, r2, ror #24
    9000:	3152414f 	cmpcc	r2, pc, asr #2
    9004:	52414f00 	subpl	r4, r1, #0, 30
    9008:	75640032 	strbvc	r0, [r4, #-50]!	; 0xffffffce
    900c:	00796d6d 	rsbseq	r6, r9, sp, ror #26
    9010:	5f434e49 	svcpl	0x00434e49
    9014:	5f433249 	svcpl	0x00433249
    9018:	00205f48 	eoreq	r5, r0, r8, asr #30
    901c:	5f495348 	svcpl	0x00495348
    9020:	204b4c43 	subcs	r4, fp, r3, asr #24
    9024:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    9028:	5f323374 	svcpl	0x00323374
    902c:	30382974 	eorscc	r2, r8, r4, ror r9
    9030:	30303030 	eorscc	r3, r0, r0, lsr r0
    9034:	004c5530 	subeq	r5, ip, r0, lsr r5
    9038:	42785470 	rsbsmi	r5, r8, #112, 8	; 0x70000000
    903c:	65666675 	strbvs	r6, [r6, #-1653]!	; 0xfffff98b
    9040:	32490072 	subcc	r0, r9, #114	; 0x72
    9044:	455f3243 	ldrbmi	r3, [pc, #-579]	; 8e09 <_Min_Stack_Size+0x8a09>
    9048:	52495f56 	subpl	r5, r9, #344	; 0x158
    904c:	6e614851 	mcrvs	8, 3, r4, cr1, cr1, {2}
    9050:	72656c64 	rsbvc	r6, r5, #100, 24	; 0x6400
    9054:	43324900 	teqmi	r2, #0, 18
    9058:	49564e5f 	ldmdbmi	r6, {r0, r1, r2, r3, r4, r6, r9, sl, fp, lr}^
    905c:	52495f43 	subpl	r5, r9, #268	; 0x10c
    9060:	6e455f51 	mcrvs	15, 2, r5, cr5, cr1, {2}
    9064:	656c6261 	strbvs	r6, [ip, #-609]!	; 0xfffffd9f
    9068:	32490064 	subcc	r0, r9, #100	; 0x64
    906c:	74535f43 	ldrbvc	r5, [r3], #-3907	; 0xfffff0bd
    9070:	5f747261 	svcpl	0x00747261
    9074:	62616e45 	rsbvs	r6, r1, #1104	; 0x450
    9078:	4800656c 	stmdami	r0, {r2, r3, r5, r6, r8, sl, sp, lr}
    907c:	435f4553 	cmpmi	pc, #348127232	; 0x14c00000
    9080:	28204b4c 	stmdacs	r0!, {r2, r3, r6, r8, r9, fp, lr}
    9084:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    9088:	745f3233 	ldrbvc	r3, [pc], #-563	; 9090 <_Min_Stack_Size+0x8c90>
    908c:	30363129 	eorscc	r3, r6, r9, lsr #2
    9090:	30303030 	eorscc	r3, r0, r0, lsr r0
    9094:	004c5530 	subeq	r5, ip, r0, lsr r5
    9098:	5f433249 	svcpl	0x00433249
    909c:	5f6b6341 	svcpl	0x006b6341
    90a0:	74617453 	strbtvc	r7, [r1], #-1107	; 0xfffffbad
    90a4:	00745f65 	rsbseq	r5, r4, r5, ror #30
    90a8:	5f433249 	svcpl	0x00433249
    90ac:	6e657645 	cdpvs	6, 6, cr7, cr5, cr5, {2}
    90b0:	52495f74 	subpl	r5, r9, #116, 30	; 0x1d0
    90b4:	72535f51 	subsvc	r5, r3, #324	; 0x144
    90b8:	78545f63 	ldmdavc	r4, {r0, r1, r5, r6, r8, r9, sl, fp, ip, lr}^
    90bc:	32490045 	subcc	r0, r9, #69	; 0x45
    90c0:	6c465f43 	mcrrvs	15, 4, r5, r6, cr3
    90c4:	425f6761 	subsmi	r6, pc, #25427968	; 0x1840000
    90c8:	00595355 	subseq	r5, r9, r5, asr r3
    90cc:	5f433249 	svcpl	0x00433249
    90d0:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    90d4:	424d535f 	submi	r5, sp, #2080374785	; 0x7c000001
    90d8:	28205355 	stmdacs	r0!, {r0, r2, r4, r6, r8, r9, ip, lr}
    90dc:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    90e0:	745f3631 	ldrbvc	r3, [pc], #-1585	; 90e8 <_Min_Stack_Size+0x8ce8>
    90e4:	3c312829 	ldccc	8, cr2, [r1], #-164	; 0xffffff5c
    90e8:	0029313c 	eoreq	r3, r9, ip, lsr r1
    90ec:	5f433249 	svcpl	0x00433249
    90f0:	454e4547 	strbmi	r4, [lr, #-1351]	; 0xfffffab9
    90f4:	5f4c4152 	svcpl	0x004c4152
    90f8:	4c4c4143 	stfmie	f4, [ip], {67}	; 0x43
    90fc:	4444415f 	strbmi	r4, [r4], #-351	; 0xfffffea1
    9100:	53534552 	cmppl	r3, #343932928	; 0x14800000
    9104:	5349445f 	movtpl	r4, #37983	; 0x945f
    9108:	454c4241 	strbmi	r4, [ip, #-577]	; 0xfffffdbf
    910c:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    9110:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    9114:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    9118:	49002930 	stmdbmi	r0, {r4, r5, r8, fp, sp}
    911c:	465f4332 			; <UNDEFINED> instruction: 0x465f4332
    9120:	5f67616c 	svcpl	0x0067616c
    9124:	004c534d 	subeq	r5, ip, sp, asr #6
    9128:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
    912c:	4332495f 	teqmi	r2, #1556480	; 0x17c000
    9130:	4965445f 	stmdbmi	r5!, {r0, r1, r2, r3, r4, r6, sl, lr}^
    9134:	0074696e 	rsbseq	r6, r4, lr, ror #18
    9138:	5f433249 	svcpl	0x00433249
    913c:	65726944 	ldrbvs	r6, [r2, #-2372]!	; 0xfffff6bc
    9140:	6f697463 	svcvs	0x00697463
    9144:	00745f6e 	rsbseq	r5, r4, lr, ror #30
    9148:	74617473 	strbtvc	r7, [r1], #-1139	; 0xfffffb8d
    914c:	67007375 	smlsdxvs	r0, r5, r3, r7
    9150:	5152495f 	cmppl	r2, pc, asr r9
    9154:	4332495f 	teqmi	r2, #1556480	; 0x17c000
    9158:	72455f32 	subvc	r5, r5, #50, 30	; 0xc8
    915c:	5f726f72 	svcpl	0x00726f72
    9160:	6c6c6143 	stfvse	f6, [ip], #-268	; 0xfffffef4
    9164:	6b636142 	blvs	18e1674 <_Min_Stack_Size+0x18e1274>
    9168:	636e7546 	cmnvs	lr, #293601280	; 0x11800000
    916c:	6e6f6974 			; <UNDEFINED> instruction: 0x6e6f6974
    9170:	43324900 	teqmi	r2, #0, 18
    9174:	5152495f 	cmppl	r2, pc, asr r9
    9178:	7369445f 	cmnvc	r9, #1593835520	; 0x5f000000
    917c:	656c6261 	strbvs	r6, [ip, #-609]!	; 0xfffffd9f
    9180:	43324900 	teqmi	r2, #0, 18
    9184:	616c465f 	cmnvs	ip, pc, asr r6
    9188:	55445f67 	strbpl	r5, [r4, #-3943]	; 0xfffff099
    918c:	00464c41 	subeq	r4, r6, r1, asr #24
    9190:	5f515249 	svcpl	0x00515249
    9194:	6c6c6143 	stfvse	f6, [ip], #-268	; 0xfffffef4
    9198:	6b636142 	blvs	18e16a8 <_Min_Stack_Size+0x18e12a8>
    919c:	636e7546 	cmnvs	lr, #293601280	; 0x11800000
    91a0:	6e6f6974 			; <UNDEFINED> instruction: 0x6e6f6974
    91a4:	6576455f 	ldrbvs	r4, [r6, #-1375]!	; 0xfffffaa1
    91a8:	4900746e 	stmdbmi	r0, {r1, r2, r3, r5, r6, sl, ip, sp, lr}
    91ac:	4d5f4332 	ldclmi	3, cr4, [pc, #-200]	; 90ec <_Min_Stack_Size+0x8cec>
    91b0:	45545341 	ldrbmi	r5, [r4, #-833]	; 0xfffffcbf
    91b4:	50535f52 	subspl	r5, r3, r2, asr pc
    91b8:	5f444545 	svcpl	0x00444545
    91bc:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    91c0:	204d535f 	subcs	r5, sp, pc, asr r3
    91c4:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    91c8:	5f363174 	svcpl	0x00363174
    91cc:	30282974 	eorcc	r2, r8, r4, ror r9
    91d0:	32490029 	subcc	r0, r9, #41	; 0x29
    91d4:	455f3143 	ldrbmi	r3, [pc, #-323]	; 9099 <_Min_Stack_Size+0x8c99>
    91d8:	52495f52 	subpl	r5, r9, #328	; 0x148
    91dc:	6e614851 	mcrvs	8, 3, r4, cr1, cr1, {2}
    91e0:	72656c64 	rsbvc	r6, r5, #100, 24	; 0x6400
    91e4:	41434d00 	cmpmi	r3, r0, lsl #26
    91e8:	32495f4c 	subcc	r5, r9, #76, 30	; 0x130
    91ec:	6c535f43 	mrrcvs	15, 4, r5, r3, cr3
    91f0:	5f657661 	svcpl	0x00657661
    91f4:	4d005852 	stcmi	8, cr5, [r0, #-328]	; 0xfffffeb8
    91f8:	5f4c4143 	svcpl	0x004c4143
    91fc:	5f433249 	svcpl	0x00433249
    9200:	74696e49 	strbtvc	r6, [r9], #-3657	; 0xfffff1b7
    9204:	6d655400 	cfstrdvs	mvd5, [r5, #-0]
    9208:	00315f70 	eorseq	r5, r1, r0, ror pc
    920c:	78433249 	stmdavc	r3, {r0, r3, r6, r9, ip, sp}^
    9210:	6d65745f 	cfstrdvs	mvd7, [r5, #-380]!	; 0xfffffe84
    9214:	32490070 	subcc	r0, r9, #112	; 0x70
    9218:	6c465f43 	mcrrvs	15, 4, r5, r6, cr3
    921c:	535f6761 	cmppl	pc, #25427968	; 0x1840000
    9220:	4c41424d 	sfmmi	f4, 2, [r1], {77}	; 0x4d
    9224:	00545245 	subseq	r5, r4, r5, asr #4
    9228:	5f433249 	svcpl	0x00433249
    922c:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    9230:	74506769 	ldrbvc	r6, [r0], #-1897	; 0xfffff897
    9234:	434d0072 	movtmi	r0, #53362	; 0xd072
    9238:	495f4c41 	ldmdbmi	pc, {r0, r6, sl, fp, lr}^	; <UNPREDICTABLE>
    923c:	495f4332 	ldmdbmi	pc, {r1, r4, r5, r8, r9, lr}^	; <UNPREDICTABLE>
    9240:	435f5152 	cmpmi	pc, #-2147483628	; 0x80000014
    9244:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    9248:	32490067 	subcc	r0, r9, #103	; 0x67
    924c:	6c465f43 	mcrrvs	15, 4, r5, r6, cr3
    9250:	535f6761 	cmppl	pc, #25427968	; 0x1840000
    9254:	75746174 	ldrbvc	r6, [r4, #-372]!	; 0xfffffe8c
    9258:	00745f73 	rsbseq	r5, r4, r3, ror pc
    925c:	61746164 	cmnvs	r4, r4, ror #2
    9260:	676e654c 	strbvs	r6, [lr, -ip, asr #10]!
    9264:	73006874 	movwvc	r6, #2164	; 0x874
    9268:	65746174 	ldrbvs	r6, [r4, #-372]!	; 0xfffffe8c
    926c:	43324900 	teqmi	r2, #0, 18
    9270:	43505f78 	cmpmi	r0, #120, 30	; 0x1e0
    9274:	5f314b4c 	svcpl	0x00314b4c
    9278:	706d6574 	rsbvc	r6, sp, r4, ror r5
    927c:	484d5f5f 	stmdami	sp, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    9280:	434d005a 	movtmi	r0, #53338	; 0xd05a
    9284:	495f4c41 	ldmdbmi	pc, {r0, r6, sl, fp, lr}^	; <UNPREDICTABLE>
    9288:	475f4332 	smmlarmi	pc, r2, r3, r4	; <UNPREDICTABLE>
    928c:	6c467465 	cfstrdvs	mvd7, [r6], {101}	; 0x65
    9290:	74536761 	ldrbvc	r6, [r3], #-1889	; 0xfffff89f
    9294:	73757461 	cmnvc	r5, #1627389952	; 0x61000000
    9298:	44785400 	ldrbtmi	r5, [r8], #-1024	; 0xfffffc00
    929c:	00617461 	rsbeq	r7, r1, r1, ror #8
    92a0:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
    92a4:	4332495f 	teqmi	r2, #1556480	; 0x17c000
    92a8:	6e65475f 	mcrvs	7, 3, r4, cr5, cr15, {2}
    92ac:	74617265 	strbtvc	r7, [r1], #-613	; 0xfffffd9b
    92b0:	61745365 	cmnvs	r4, r5, ror #6
    92b4:	49007472 	stmdbmi	r0, {r1, r4, r5, r6, sl, ip, sp, lr}
    92b8:	455f4332 	ldrbmi	r4, [pc, #-818]	; 8f8e <_Min_Stack_Size+0x8b8e>
    92bc:	746e6576 	strbtvc	r6, [lr], #-1398	; 0xfffffa8a
    92c0:	5152495f 	cmppl	r2, pc, asr r9
    92c4:	6372535f 	cmnvs	r2, #2080374785	; 0x7c000001
    92c8:	4e78525f 	mrcmi	2, 3, r5, cr8, cr15, {2}
    92cc:	32490045 	subcc	r0, r9, #69	; 0x45
    92d0:	65525f43 	ldrbvs	r5, [r2, #-3907]	; 0xfffff0bd
    92d4:	74616570 	strbtvc	r6, [r1], #-1392	; 0xfffffa90
    92d8:	535f6465 	cmppl	pc, #1694498816	; 0x65000000
    92dc:	74726174 	ldrbtvc	r6, [r2], #-372	; 0xfffffe8c
    92e0:	41434d00 	cmpmi	r3, r0, lsl #26
    92e4:	32495f4c 	subcc	r5, r9, #76, 30	; 0x130
    92e8:	6c535f43 	mrrcvs	15, 4, r5, r3, cr3
    92ec:	5f657661 	svcpl	0x00657661
    92f0:	49005854 	stmdbmi	r0, {r2, r4, r6, fp, ip, lr}
    92f4:	465f4332 			; <UNDEFINED> instruction: 0x465f4332
    92f8:	5f67616c 	svcpl	0x0067616c
    92fc:	53004641 	movwpl	r4, #1601	; 0x641
    9300:	535f4950 	cmppl	pc, #80, 18	; 0x140000
    9304:	4c504d49 	mrrcmi	13, 4, r4, r0, cr9
    9308:	525f5845 	subspl	r5, pc, #4521984	; 0x450000
    930c:	4e4f5f58 	mcrmi	15, 2, r5, cr15, cr8, {2}
    9310:	2820594c 	stmdacs	r0!, {r2, r3, r6, r8, fp, ip, lr}
    9314:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    9318:	745f3631 	ldrbvc	r3, [pc], #-1585	; 9320 <_Min_Stack_Size+0x8f20>
    931c:	30282829 	eorcc	r2, r8, r9, lsr #16
    9320:	35313c3c 	ldrcc	r3, [r1, #-3132]!	; 0xfffff3c4
    9324:	207c2029 	rsbscs	r2, ip, r9, lsr #32
    9328:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    932c:	29293031 	stmdbcs	r9!, {r0, r4, r5, ip, sp}
    9330:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    9334:	4552505f 	ldrbmi	r5, [r2, #-95]	; 0xffffffa1
    9338:	4c414353 	mcrrmi	3, 5, r4, r1, cr3
    933c:	445f5245 	ldrbmi	r5, [pc], #-581	; 9344 <_Min_Stack_Size+0x8f44>
    9340:	53495649 	movtpl	r5, #38473	; 0x9649
    9344:	365f524f 	ldrbcc	r5, [pc], -pc, asr #4
    9348:	75282034 	strvc	r2, [r8, #-52]!	; 0xffffffcc
    934c:	31746e69 	cmncc	r4, r9, ror #28
    9350:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    9354:	3c3c3528 	cfldr32cc	mvfx3, [ip], #-160	; 0xffffff60
    9358:	4d002933 	vstrmi.16	s4, [r0, #-102]	; 0xffffff9a	; <UNPREDICTABLE>
    935c:	5f4c4143 	svcpl	0x004c4143
    9360:	5f495053 	svcpl	0x00495053
    9364:	525f5854 	subspl	r5, pc, #84, 16	; 0x540000
    9368:	50530058 	subspl	r0, r3, r8, asr r0
    936c:	6f505f49 	svcvs	0x00505f49
    9370:	6e696c6c 	cdpvs	12, 6, cr6, cr9, cr12, {3}
    9374:	6e455f67 	cdpvs	15, 4, cr5, cr5, cr7, {3}
    9378:	656c6261 	strbvs	r6, [ip, #-609]!	; 0xfffffd9f
    937c:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    9380:	52435f78 	subpl	r5, r3, #120, 30	; 0x1e0
    9384:	65745f32 	ldrbvs	r5, [r4, #-3890]!	; 0xfffff0ce
    9388:	5300706d 	movwpl	r7, #109	; 0x6d
    938c:	465f4950 			; <UNDEFINED> instruction: 0x465f4950
    9390:	454d4152 	strbmi	r4, [sp, #-338]	; 0xfffffeae
    9394:	524f465f 	subpl	r4, pc, #99614720	; 0x5f00000
    9398:	5f54414d 	svcpl	0x0054414d
    939c:	2042534c 	subcs	r5, r2, ip, asr #6
    93a0:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    93a4:	5f363174 	svcpl	0x00363174
    93a8:	31282974 			; <UNDEFINED> instruction: 0x31282974
    93ac:	29373c3c 	ldmdbcs	r7!, {r2, r3, r4, r5, sl, fp, ip, sp}
    93b0:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    93b4:	50530078 	subspl	r0, r3, r8, ror r0
    93b8:	52495f49 	subpl	r5, r9, #292	; 0x124
    93bc:	4e455f51 	mcrmi	15, 2, r5, cr5, cr1, {2}
    93c0:	43585200 	cmpmi	r8, #0, 4
    93c4:	00524352 	subseq	r4, r2, r2, asr r3
    93c8:	5f495053 	svcpl	0x00495053
    93cc:	464c4148 	strbmi	r4, [ip], -r8, asr #2
    93d0:	5055445f 	subspl	r4, r5, pc, asr r4
    93d4:	5f58454c 	svcpl	0x0058454c
    93d8:	28205852 	stmdacs	r0!, {r1, r4, r6, fp, ip, lr}
    93dc:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    93e0:	745f3631 	ldrbvc	r3, [pc], #-1585	; 93e8 <_Min_Stack_Size+0x8fe8>
    93e4:	31282829 			; <UNDEFINED> instruction: 0x31282829
    93e8:	35313c3c 	ldrcc	r3, [r1, #-3132]!	; 0xfffff3c4
    93ec:	207c2029 	rsbscs	r2, ip, r9, lsr #32
    93f0:	3c3c3028 	ldccc	0, cr3, [ip], #-160	; 0xffffff60
    93f4:	29293431 	stmdbcs	r9!, {r0, r4, r5, sl, ip, sp}
    93f8:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    93fc:	5f53535f 	svcpl	0x0053535f
    9400:	44524148 	ldrbmi	r4, [r2], #-328	; 0xfffffeb8
    9404:	45524157 	ldrbmi	r4, [r2, #-343]	; 0xfffffea9
    9408:	53414d5f 	movtpl	r4, #7519	; 0x1d5f
    940c:	5f524554 	svcpl	0x00524554
    9410:	2820454f 	stmdacs	r0!, {r0, r1, r2, r3, r6, r8, sl, lr}
    9414:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    9418:	745f3631 	ldrbvc	r3, [pc], #-1585	; 9420 <_Min_Stack_Size+0x9020>
    941c:	3c312829 	ldccc	8, cr2, [r1], #-164	; 0xffffff5c
    9420:	0029323c 	eoreq	r3, r9, ip, lsr r2
    9424:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
    9428:	4950535f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
    942c:	6365525f 	cmnvs	r5, #-268435451	; 0xf0000005
    9430:	65766965 	ldrbvs	r6, [r6, #-2405]!	; 0xfffff69b
    9434:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    9438:	4552505f 	ldrbmi	r5, [r2, #-95]	; 0xffffffa1
    943c:	4c414353 	mcrrmi	3, 5, r4, r1, cr3
    9440:	445f5245 	ldrbmi	r5, [pc], #-581	; 9448 <_Min_Stack_Size+0x9048>
    9444:	53495649 	movtpl	r5, #38473	; 0x9649
    9448:	385f524f 	ldmdacc	pc, {r0, r1, r2, r3, r6, r9, ip, lr}^	; <UNPREDICTABLE>
    944c:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    9450:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    9454:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    9458:	333c3c32 	teqcc	ip, #12800	; 0x3200
    945c:	50530029 	subspl	r0, r3, r9, lsr #32
    9460:	45495f49 	strbmi	r5, [r9, #-3913]	; 0xfffff0b7
    9464:	5252455f 	subspl	r4, r2, #398458880	; 0x17c00000
    9468:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    946c:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    9470:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    9474:	353c3c31 	ldrcc	r3, [ip, #-3121]!	; 0xfffff3cf
    9478:	434d0029 	movtmi	r0, #53289	; 0xd029
    947c:	535f4c41 	cmppl	pc, #16640	; 0x4100
    9480:	725f4950 	subsvc	r4, pc, #80, 18	; 0x140000
    9484:	69656365 	stmdbvs	r5!, {r0, r2, r5, r6, r8, r9, sp, lr}^
    9488:	74536576 	ldrbvc	r6, [r3], #-1398	; 0xfffffa8a
    948c:	676e6972 			; <UNDEFINED> instruction: 0x676e6972
    9490:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    9494:	6c6f505f 	stclvs	0, cr5, [pc], #-380	; 9320 <_Min_Stack_Size+0x8f20>
    9498:	676e696c 	strbvs	r6, [lr, -ip, ror #18]!
    949c:	7369445f 	cmnvc	r9, #1593835520	; 0x5f000000
    94a0:	656c6261 	strbvs	r6, [ip, #-609]!	; 0xfffffd9f
    94a4:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    94a8:	6e6f435f 	mcrvs	3, 3, r4, cr15, cr15, {2}
    94ac:	5f676966 	svcpl	0x00676966
    94b0:	50530074 	subspl	r0, r3, r4, ror r0
    94b4:	41445f49 	cmpmi	r4, r9, asr #30
    94b8:	535f4154 	cmppl	pc, #84, 2
    94bc:	5f455a49 	svcpl	0x00455a49
    94c0:	75282038 	strvc	r2, [r8, #-56]!	; 0xffffffc8
    94c4:	31746e69 	cmncc	r4, r9, ror #28
    94c8:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    94cc:	3c3c3028 	ldccc	0, cr3, [ip], #-160	; 0xffffff60
    94d0:	00293131 	eoreq	r3, r9, r1, lsr r1
    94d4:	5f495053 	svcpl	0x00495053
    94d8:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    94dc:	53414d5f 	movtpl	r4, #7519	; 0x1d5f
    94e0:	20524554 	subscs	r4, r2, r4, asr r5
    94e4:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    94e8:	5f363174 	svcpl	0x00363174
    94ec:	31282974 			; <UNDEFINED> instruction: 0x31282974
    94f0:	29323c3c 	ldmdbcs	r2!, {r2, r3, r4, r5, sl, fp, ip, sp}
    94f4:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    94f8:	4d49535f 	stclmi	3, cr5, [r9, #-380]	; 0xfffffe84
    94fc:	58454c50 	stmdapl	r5, {r4, r6, sl, fp, lr}^
    9500:	5f58545f 	svcpl	0x0058545f
    9504:	594c4e4f 	stmdbpl	ip, {r0, r1, r2, r3, r6, r9, sl, fp, lr}^
    9508:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    950c:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    9510:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    9514:	3c3c3028 	ldccc	0, cr3, [ip], #-160	; 0xffffff60
    9518:	20293531 	eorcs	r3, r9, r1, lsr r5
    951c:	3028207c 	eorcc	r2, r8, ip, ror r0
    9520:	30313c3c 	eorscc	r3, r1, ip, lsr ip
    9524:	207c2029 	rsbscs	r2, ip, r9, lsr #32
    9528:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    952c:	00292932 	eoreq	r2, r9, r2, lsr r9
    9530:	5f495053 	svcpl	0x00495053
    9534:	434f4c43 	movtmi	r4, #64579	; 0xfc43
    9538:	44495f4b 	strbmi	r5, [r9], #-3915	; 0xfffff0b5
    953c:	485f454c 	ldmdami	pc, {r2, r3, r6, r8, sl, lr}^	; <UNPREDICTABLE>
    9540:	20484749 	subcs	r4, r8, r9, asr #14
    9544:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    9548:	5f363174 	svcpl	0x00363174
    954c:	31282974 			; <UNDEFINED> instruction: 0x31282974
    9550:	29313c3c 	ldmdbcs	r1!, {r2, r3, r4, r5, sl, fp, ip, sp}
    9554:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    9558:	4c55465f 	mrrcmi	6, 5, r4, r5, cr15
    955c:	55445f4c 	strbpl	r5, [r4, #-3916]	; 0xfffff0b4
    9560:	58454c50 	stmdapl	r5, {r4, r6, sl, fp, lr}^
    9564:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    9568:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    956c:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    9570:	3c3c3028 	ldccc	0, cr3, [ip], #-160	; 0xffffff60
    9574:	20293531 	eorcs	r3, r9, r1, lsr r5
    9578:	3028207c 	eorcc	r2, r8, ip, ror r0
    957c:	30313c3c 	eorscc	r3, r1, ip, lsr ip
    9580:	207c2029 	rsbscs	r2, ip, r9, lsr #32
    9584:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    9588:	00292931 	eoreq	r2, r9, r1, lsr r9
    958c:	5f495053 	svcpl	0x00495053
    9590:	434f4c43 	movtmi	r4, #64579	; 0xfc43
    9594:	44495f4b 	strbmi	r5, [r9], #-3915	; 0xfffff0b5
    9598:	4c5f454c 	cfldr64mi	mvdx4, [pc], {76}	; 0x4c
    959c:	2820574f 	stmdacs	r0!, {r0, r1, r2, r3, r6, r8, r9, sl, ip, lr}
    95a0:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    95a4:	745f3631 	ldrbvc	r3, [pc], #-1585	; 95ac <_Min_Stack_Size+0x91ac>
    95a8:	3c302829 	ldccc	8, cr2, [r0], #-164	; 0xffffff5c
    95ac:	0029313c 	eoreq	r3, r9, ip, lsr r1
    95b0:	5f495053 	svcpl	0x00495053
    95b4:	506b6c43 	rsbpl	r6, fp, r3, asr #24
    95b8:	72616c6f 	rsbvc	r6, r1, #28416	; 0x6f00
    95bc:	00797469 	rsbseq	r7, r9, r9, ror #8
    95c0:	5f495053 	svcpl	0x00495053
    95c4:	53455250 	movtpl	r5, #21072	; 0x5250
    95c8:	454c4143 	strbmi	r4, [ip, #-323]	; 0xfffffebd
    95cc:	49445f52 	stmdbmi	r4, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    95d0:	4f534956 	svcmi	0x00534956
    95d4:	32335f52 	eorscc	r5, r3, #328	; 0x148
    95d8:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    95dc:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    95e0:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    95e4:	333c3c34 	teqcc	ip, #52, 24	; 0x3400
    95e8:	50530029 	subspl	r0, r3, r9, lsr #32
    95ec:	41445f49 	cmpmi	r4, r9, asr #30
    95f0:	535f4154 	cmppl	pc, #84, 2
    95f4:	5f455a49 	svcpl	0x00455a49
    95f8:	28203631 	stmdacs	r0!, {r0, r4, r5, r9, sl, ip, sp}
    95fc:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    9600:	745f3631 	ldrbvc	r3, [pc], #-1585	; 9608 <_Min_Stack_Size+0x9208>
    9604:	3c312829 	ldccc	8, cr2, [r1], #-164	; 0xffffff5c
    9608:	2931313c 	ldmdbcs	r1!, {r2, r3, r4, r5, r8, ip, sp}
    960c:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    9610:	4552505f 	ldrbmi	r5, [r2, #-95]	; 0xffffffa1
    9614:	4c414353 	mcrrmi	3, 5, r4, r1, cr3
    9618:	445f5245 	ldrbmi	r5, [pc], #-581	; 9620 <_Min_Stack_Size+0x9220>
    961c:	53495649 	movtpl	r5, #38473	; 0x9649
