mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    9620:	325f524f 	subscc	r5, pc, #-268435452	; 0xf0000004
    9624:	28203635 	stmdacs	r0!, {r0, r2, r4, r5, r9, sl, ip, sp}
    9628:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    962c:	745f3631 	ldrbvc	r3, [pc], #-1585	; 9634 <_Min_Stack_Size+0x9234>
    9630:	3c372829 	ldccc	8, cr2, [r7], #-164	; 0xffffff5c
    9634:	0029333c 	eoreq	r3, r9, ip, lsr r3
    9638:	5f495053 	svcpl	0x00495053
    963c:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    9640:	74506769 	ldrbvc	r6, [r0], #-1897	; 0xfffff897
    9644:	50530072 	subspl	r0, r3, r2, ror r0
    9648:	6c535f49 	mrrcvs	15, 4, r5, r3, cr9
    964c:	53657661 	cmnpl	r5, #101711872	; 0x6100000
    9650:	63656c65 	cmnvs	r5, #25856	; 0x6500
    9654:	434d0074 	movtmi	r0, #53364	; 0xd074
    9658:	535f4c41 	cmppl	pc, #16640	; 0x4100
    965c:	475f4950 			; <UNDEFINED> instruction: 0x475f4950
    9660:	5f4f4950 	svcpl	0x004f4950
    9664:	50746553 	rsbspl	r6, r4, r3, asr r5
    9668:	00736e69 	rsbseq	r6, r3, r9, ror #28
    966c:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
    9670:	4950535f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
    9674:	6e65735f 	mcrvs	3, 3, r7, cr5, cr15, {2}
    9678:	72745364 	rsbsvc	r5, r4, #100, 6	; 0x90000001
    967c:	00676e69 	rsbeq	r6, r7, r9, ror #28
    9680:	5f495053 	svcpl	0x00495053
    9684:	53455250 	movtpl	r5, #21072	; 0x5250
    9688:	454c4143 	strbmi	r4, [ip, #-323]	; 0xfffffebd
    968c:	49445f52 	stmdbmi	r4, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    9690:	4f534956 	svcmi	0x00534956
    9694:	20325f52 	eorscs	r5, r2, r2, asr pc
    9698:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    969c:	5f363174 	svcpl	0x00363174
    96a0:	30282974 	eorcc	r2, r8, r4, ror r9
    96a4:	29333c3c 	ldmdbcs	r3!, {r2, r3, r4, r5, sl, fp, ip, sp}
    96a8:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    96ac:	414e455f 	cmpmi	lr, pc, asr r5
    96b0:	20454c42 	subcs	r4, r5, r2, asr #24
    96b4:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    96b8:	5f363174 	svcpl	0x00363174
    96bc:	31282974 			; <UNDEFINED> instruction: 0x31282974
    96c0:	29363c3c 	ldmdbcs	r6!, {r2, r3, r4, r5, sl, fp, ip, sp}
    96c4:	43585400 	cmpmi	r8, #0, 8
    96c8:	00524352 	subseq	r4, r2, r2, asr r3
    96cc:	5f495053 	svcpl	0x00495053
    96d0:	485f5353 	ldmdami	pc, {r0, r1, r4, r6, r8, r9, ip, lr}^	; <UNPREDICTABLE>
    96d4:	57445241 	strbpl	r5, [r4, -r1, asr #4]
    96d8:	5f455241 	svcpl	0x00455241
    96dc:	56414c53 			; <UNDEFINED> instruction: 0x56414c53
    96e0:	75282045 	strvc	r2, [r8, #-69]!	; 0xffffffbb
    96e4:	31746e69 	cmncc	r4, r9, ror #28
    96e8:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    96ec:	3c3c3028 	ldccc	0, cr3, [ip], #-160	; 0xffffff60
    96f0:	4d002939 	vstrmi.16	s4, [r0, #-114]	; 0xffffff8e	; <UNPREDICTABLE>
    96f4:	5f4c4143 	svcpl	0x004c4143
    96f8:	5f495053 	svcpl	0x00495053
    96fc:	6e617254 	mcrvs	2, 3, r7, cr1, cr4, {2}
    9700:	74696d73 	strbtvc	r6, [r9], #-3443	; 0xfffff28d
    9704:	6c6f5000 	stclvs	0, cr5, [pc], #-0	; 970c <_Min_Stack_Size+0x930c>
    9708:	676e696c 	strbvs	r6, [lr, -ip, ror #18]!
    970c:	6174535f 	cmnvs	r4, pc, asr r3
    9710:	00737574 	rsbseq	r7, r3, r4, ror r5
    9714:	5f495053 	svcpl	0x00495053
    9718:	6d6d6f43 	stclvs	15, cr6, [sp, #-268]!	; 0xfffffef4
    971c:	65646f4d 	strbvs	r6, [r4, #-3917]!	; 0xfffff0b3
    9720:	41434d00 	cmpmi	r3, r0, lsl #26
    9724:	50535f4c 	subspl	r5, r3, ip, asr #30
    9728:	65445f49 	strbvs	r5, [r4, #-3913]	; 0xfffff0b7
    972c:	74696e49 	strbtvc	r6, [r9], #-3657	; 0xfffff1b7
    9730:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    9734:	52435f78 	subpl	r5, r3, #120, 30	; 0x1e0
    9738:	65745f31 	ldrbvs	r5, [r4, #-3889]!	; 0xfffff0cf
    973c:	5300706d 	movwpl	r7, #109	; 0x6d
    9740:	4d5f4950 	vldrmi.16	s9, [pc, #-160]	; 96a8 <_Min_Stack_Size+0x92a8>	; <UNPREDICTABLE>
    9744:	0065646f 	rsbeq	r6, r5, pc, ror #8
    9748:	5f495053 	svcpl	0x00495053
    974c:	485f5353 	ldmdami	pc, {r0, r1, r4, r6, r8, r9, ip, lr}^	; <UNPREDICTABLE>
    9750:	57445241 	strbpl	r5, [r4, -r1, asr #4]
    9754:	5f455241 	svcpl	0x00455241
    9758:	5453414d 	ldrbpl	r4, [r3], #-333	; 0xfffffeb3
    975c:	4f5f5245 	svcmi	0x005f5245
    9760:	75282044 	strvc	r2, [r8, #-68]!	; 0xffffffbc
    9764:	31746e69 	cmncc	r4, r9, ror #28
    9768:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    976c:	3c3c3028 	ldccc	0, cr3, [ip], #-160	; 0xffffff60
    9770:	53002932 	movwpl	r2, #2354	; 0x932
    9774:	505f4950 	subspl	r4, pc, r0, asr r9	; <UNPREDICTABLE>
    9778:	696c6c6f 	stmdbvs	ip!, {r0, r1, r2, r3, r5, r6, sl, fp, sp, lr}^
    977c:	4d5f676e 	ldclmi	7, cr6, [pc, #-440]	; 95cc <_Min_Stack_Size+0x91cc>
    9780:	61686365 	cmnvs	r8, r5, ror #6
    9784:	6d73696e 			; <UNDEFINED> instruction: 0x6d73696e
    9788:	4d00745f 	cfstrsmi	mvf7, [r0, #-380]	; 0xfffffe84
    978c:	004f5349 	subeq	r5, pc, r9, asr #6
    9790:	4d2f2e2e 	stcmi	14, cr2, [pc, #-184]!	; 96e0 <_Min_Stack_Size+0x92e0>
    9794:	2f4c4143 	svccs	0x004c4143
    9798:	2e495053 	mcrcs	0, 2, r5, cr9, cr3, {2}
    979c:	50530063 	subspl	r0, r3, r3, rrx
    97a0:	52465f49 	subpl	r5, r6, #292	; 0x124
    97a4:	5f454d41 	svcpl	0x00454d41
    97a8:	4d524f46 	ldclmi	15, cr4, [r2, #-280]	; 0xfffffee8
    97ac:	4d5f5441 	cfldrdmi	mvd5, [pc, #-260]	; 96b0 <_Min_Stack_Size+0x92b0>
    97b0:	28204253 	stmdacs	r0!, {r0, r1, r4, r6, r9, lr}
    97b4:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    97b8:	745f3631 	ldrbvc	r3, [pc], #-1585	; 97c0 <_Min_Stack_Size+0x93c0>
    97bc:	3c302829 	ldccc	8, cr2, [r0], #-164	; 0xffffff5c
    97c0:	0029373c 	eoreq	r3, r9, ip, lsr r7
    97c4:	31495053 	qdaddcc	r5, r3, r9
    97c8:	5152495f 	cmppl	r2, pc, asr r9
    97cc:	646e6148 	strbtvs	r6, [lr], #-328	; 0xfffffeb8
    97d0:	0072656c 	rsbseq	r6, r2, ip, ror #10
    97d4:	5f495053 	svcpl	0x00495053
    97d8:	535f5353 	cmppl	pc, #1275068417	; 0x4c000001
    97dc:	5754464f 	ldrbpl	r4, [r4, -pc, asr #12]
    97e0:	5f455241 	svcpl	0x00455241
    97e4:	20544553 	subscs	r4, r4, r3, asr r5
    97e8:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    97ec:	5f363174 	svcpl	0x00363174
    97f0:	28282974 	stmdacs	r8!, {r2, r4, r5, r6, r8, fp, sp}
    97f4:	393c3c31 	ldmdbcc	ip!, {r0, r4, r5, sl, fp, ip, sp}
    97f8:	207c2029 	rsbscs	r2, ip, r9, lsr #32
    97fc:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    9800:	00292938 	eoreq	r2, r9, r8, lsr r9
    9804:	5f495053 	svcpl	0x00495053
    9808:	65707954 	ldrbvs	r7, [r0, #-2388]!	; 0xfffff6ac
    980c:	00666564 	rsbeq	r6, r6, r4, ror #10
    9810:	5f495053 	svcpl	0x00495053
    9814:	5f444e32 	svcpl	0x00444e32
    9818:	45474445 	strbmi	r4, [r7, #-1093]	; 0xfffffbbb
    981c:	5041435f 	subpl	r4, r1, pc, asr r3
    9820:	45525554 	ldrbmi	r5, [r2, #-1364]	; 0xfffffaac
    9824:	5254535f 	subspl	r5, r4, #2080374785	; 0x7c000001
    9828:	2045424f 	subcs	r4, r5, pc, asr #4
    982c:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    9830:	5f363174 	svcpl	0x00363174
    9834:	31282974 			; <UNDEFINED> instruction: 0x31282974
    9838:	29303c3c 	ldmdbcs	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    983c:	53324900 	teqpl	r2, #0, 18
    9840:	53005250 	movwpl	r5, #592	; 0x250
    9844:	505f4950 	subspl	r4, pc, r0, asr r9	; <UNPREDICTABLE>
    9848:	63536572 	cmpvs	r3, #478150656	; 0x1c800000
    984c:	72656c61 	rsbvc	r6, r5, #24832	; 0x6100
    9850:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    9854:	4552505f 	ldrbmi	r5, [r2, #-95]	; 0xffffffa1
    9858:	4c414353 	mcrrmi	3, 5, r4, r1, cr3
    985c:	445f5245 	ldrbmi	r5, [pc], #-581	; 9864 <_Min_Stack_Size+0x9464>
    9860:	53495649 	movtpl	r5, #38473	; 0x9649
    9864:	315f524f 	cmpcc	pc, pc, asr #4
    9868:	75282036 	strvc	r2, [r8, #-54]!	; 0xffffffca
    986c:	31746e69 	cmncc	r4, r9, ror #28
    9870:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    9874:	3c3c3328 	ldccc	3, cr3, [ip], #-160	; 0xffffff60
    9878:	44002933 	strmi	r2, [r0], #-2355	; 0xfffff6cd
    987c:	54617461 	strbtpl	r7, [r1], #-1121	; 0xfffffb9f
    9880:	00706d65 	rsbseq	r6, r0, r5, ror #26
    9884:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
    9888:	4950535f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
    988c:	696e495f 	stmdbvs	lr!, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    9890:	50530074 	subspl	r0, r3, r4, ror r0
    9894:	6c435f49 	mcrrvs	15, 4, r5, r3, cr9
    9898:	6168506b 	cmnvs	r8, fp, rrx
    989c:	49006573 	stmdbmi	r0, {r0, r1, r4, r5, r6, r8, sl, sp, lr}
    98a0:	535f434e 	cmppl	pc, #939524097	; 0x38000001
    98a4:	485f4950 	ldmdami	pc, {r4, r6, r8, fp, lr}^	; <UNPREDICTABLE>
    98a8:	4900205f 	stmdbmi	r0, {r0, r1, r2, r3, r4, r6, sp}
    98ac:	46435332 			; <UNDEFINED> instruction: 0x46435332
    98b0:	53005247 	movwpl	r5, #583	; 0x247
    98b4:	485f4950 	ldmdami	pc, {r4, r6, r8, fp, lr}^	; <UNPREDICTABLE>
    98b8:	5f464c41 	svcpl	0x00464c41
    98bc:	4c505544 	cfldr64mi	mvdx5, [r0], {68}	; 0x44
    98c0:	545f5845 	ldrbpl	r5, [pc], #-2117	; 98c8 <_Min_Stack_Size+0x94c8>
    98c4:	75282058 	strvc	r2, [r8, #-88]!	; 0xffffffa8
    98c8:	31746e69 	cmncc	r4, r9, ror #28
    98cc:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    98d0:	3c312828 	ldccc	8, cr2, [r1], #-160	; 0xffffff60
    98d4:	2935313c 	ldmdbcs	r5!, {r2, r3, r4, r5, r8, ip, sp}
    98d8:	28207c20 	stmdacs	r0!, {r5, sl, fp, ip, sp, lr}
    98dc:	313c3c31 	teqcc	ip, r1, lsr ip
    98e0:	00292934 	eoreq	r2, r9, r4, lsr r9
    98e4:	5f495053 	svcpl	0x00495053
    98e8:	545f4549 	ldrbpl	r4, [pc], #-1353	; 98f0 <_Min_Stack_Size+0x94f0>
    98ec:	28204558 	stmdacs	r0!, {r3, r4, r6, r8, sl, lr}
    98f0:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    98f4:	745f3631 	ldrbvc	r3, [pc], #-1585	; 98fc <_Min_Stack_Size+0x94fc>
    98f8:	3c312829 	ldccc	8, cr2, [r1], #-164	; 0xffffff5c
    98fc:	0029373c 	eoreq	r3, r9, ip, lsr r7
    9900:	5f495053 	svcpl	0x00495053
    9904:	5f545331 	svcpl	0x00545331
    9908:	45474445 	strbmi	r4, [r7, #-1093]	; 0xfffffbbb
    990c:	5041435f 	subpl	r4, r1, pc, asr r3
    9910:	45525554 	ldrbmi	r5, [r2, #-1364]	; 0xfffffaac
    9914:	5254535f 	subspl	r5, r4, #2080374785	; 0x7c000001
    9918:	2045424f 	subcs	r4, r5, pc, asr #4
    991c:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    9920:	5f363174 	svcpl	0x00363174
    9924:	30282974 	eorcc	r2, r8, r4, ror r9
    9928:	29303c3c 	ldmdbcs	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    992c:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    9930:	444f4d5f 	strbmi	r4, [pc], #-3423	; 9938 <_Min_Stack_Size+0x9538>
    9934:	4c535f45 	mrrcmi	15, 4, r5, r3, cr5
    9938:	20455641 	subcs	r5, r5, r1, asr #12
    993c:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    9940:	5f363174 	svcpl	0x00363174
    9944:	30282974 	eorcc	r2, r8, r4, ror r9
    9948:	29323c3c 	ldmdbcs	r2!, {r2, r3, r4, r5, sl, fp, ip, sp}
    994c:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    9950:	5f53535f 	svcpl	0x0053535f
    9954:	54464f53 	strbpl	r4, [r6], #-3923	; 0xfffff0ad
    9958:	45524157 	ldrbmi	r4, [r2, #-343]	; 0xfffffea9
    995c:	5345525f 	movtpl	r5, #21087	; 0x525f
    9960:	28205445 	stmdacs	r0!, {r0, r2, r6, sl, ip, lr}
    9964:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    9968:	745f3631 	ldrbvc	r3, [pc], #-1585	; 9970 <_Min_Stack_Size+0x9570>
    996c:	3c312829 	ldccc	8, cr2, [r1], #-164	; 0xffffff5c
    9970:	0029393c 	eoreq	r3, r9, ip, lsr r9
    9974:	50435243 	subpl	r5, r3, r3, asr #4
    9978:	4f4d0052 	svcmi	0x004d0052
    997c:	53004953 	movwpl	r4, #2387	; 0x953
    9980:	465f4950 			; <UNDEFINED> instruction: 0x465f4950
    9984:	656d6172 	strbvs	r6, [sp, #-370]!	; 0xfffffe8e
    9988:	6d726f46 	ldclvs	15, cr6, [r2, #-280]!	; 0xfffffee8
    998c:	53007461 	movwpl	r7, #1121	; 0x461
    9990:	495f4950 	ldmdbmi	pc, {r4, r6, r8, fp, lr}^	; <UNPREDICTABLE>
    9994:	49445f45 	stmdbmi	r4, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
    9998:	4c424153 	stfmie	f4, [r2], {83}	; 0x53
    999c:	75282045 	strvc	r2, [r8, #-69]!	; 0xffffffbb
    99a0:	31746e69 	cmncc	r4, r9, ror #28
    99a4:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    99a8:	00293028 	eoreq	r3, r9, r8, lsr #32
    99ac:	5f495053 	svcpl	0x00495053
    99b0:	53455250 	movtpl	r5, #21072	; 0x5250
    99b4:	454c4143 	strbmi	r4, [ip, #-323]	; 0xfffffebd
    99b8:	49445f52 	stmdbmi	r4, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    99bc:	4f534956 	svcmi	0x00534956
    99c0:	20345f52 	eorscs	r5, r4, r2, asr pc
    99c4:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    99c8:	5f363174 	svcpl	0x00363174
    99cc:	31282974 			; <UNDEFINED> instruction: 0x31282974
    99d0:	29333c3c 	ldmdbcs	r3!, {r2, r3, r4, r5, sl, fp, ip, sp}
    99d4:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    99d8:	5f45495f 	svcpl	0x0045495f
    99dc:	454e5852 	strbmi	r5, [lr, #-2130]	; 0xfffff7ae
    99e0:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    99e4:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    99e8:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    99ec:	363c3c31 			; <UNDEFINED> instruction: 0x363c3c31
    99f0:	50530029 	subspl	r0, r3, r9, lsr #32
    99f4:	495f3249 	ldmdbmi	pc, {r0, r3, r6, r9, ip, sp}^	; <UNPREDICTABLE>
    99f8:	61485152 	cmpvs	r8, r2, asr r1
    99fc:	656c646e 	strbvs	r6, [ip, #-1134]!	; 0xfffffb92
    9a00:	434d0072 	movtmi	r0, #53362	; 0xd072
    9a04:	535f4c41 	cmppl	pc, #16640	; 0x4100
    9a08:	465f4950 			; <UNDEFINED> instruction: 0x465f4950
    9a0c:	444c4c55 	strbmi	r4, [ip], #-3157	; 0xfffff3ab
    9a10:	454c5055 	strbmi	r5, [ip, #-85]	; 0xffffffab
    9a14:	58545f58 	ldmdapl	r4, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    9a18:	0058525f 	subseq	r5, r8, pc, asr r2
    9a1c:	5f495053 	svcpl	0x00495053
    9a20:	61746144 	cmnvs	r4, r4, asr #2
    9a24:	657a6953 	ldrbvs	r6, [sl, #-2387]!	; 0xfffff6ad
    9a28:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    9a2c:	4552505f 	ldrbmi	r5, [r2, #-95]	; 0xffffffa1
    9a30:	4c414353 	mcrrmi	3, 5, r4, r1, cr3
    9a34:	445f5245 	ldrbmi	r5, [pc], #-581	; 9a3c <_Min_Stack_Size+0x963c>
    9a38:	53495649 	movtpl	r5, #38473	; 0x9649
    9a3c:	315f524f 	cmpcc	pc, pc, asr #4
    9a40:	28203832 	stmdacs	r0!, {r1, r4, r5, fp, ip, sp}
    9a44:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    9a48:	745f3631 	ldrbvc	r3, [pc], #-1585	; 9a50 <_Min_Stack_Size+0x9650>
    9a4c:	3c362829 	ldccc	8, cr2, [r6], #-164	; 0xffffff5c
    9a50:	0029333c 	eoreq	r3, r9, ip, lsr r3
    9a54:	52415355 	subpl	r5, r1, #1409286145	; 0x54000001
    9a58:	41425f54 	cmpmi	r2, r4, asr pc
    9a5c:	41524455 	cmpmi	r2, r5, asr r4
    9a60:	315f4554 	cmpcc	pc, r4, asr r5	; <UNPREDICTABLE>
    9a64:	30303239 	eorscc	r3, r0, r9, lsr r2
    9a68:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    9a6c:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    9a70:	3129745f 			; <UNDEFINED> instruction: 0x3129745f
    9a74:	30303239 	eorscc	r3, r0, r9, lsr r2
    9a78:	41535500 	cmpmi	r3, r0, lsl #10
    9a7c:	575f5452 			; <UNDEFINED> instruction: 0x575f5452
    9a80:	5f44524f 	svcpl	0x0044524f
    9a84:	474e454c 	strbmi	r4, [lr, -ip, asr #10]
    9a88:	385f4854 	ldmdacc	pc, {r2, r4, r6, fp, lr}^	; <UNPREDICTABLE>
    9a8c:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    9a90:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    9a94:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    9a98:	313c3c30 	teqcc	ip, r0, lsr ip
    9a9c:	2e002932 			; <UNDEFINED> instruction: 0x2e002932
    9aa0:	434d2f2e 	movtmi	r2, #57134	; 0xdf2e
    9aa4:	552f4c41 	strpl	r4, [pc, #-3137]!	; 8e6b <_Min_Stack_Size+0x8a6b>
    9aa8:	54524153 	ldrbpl	r4, [r2], #-339	; 0xfffffead
    9aac:	5500632e 	strpl	r6, [r0, #-814]	; 0xfffffcd2
    9ab0:	54524153 	ldrbpl	r4, [r2], #-339	; 0xfffffead
    9ab4:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    9ab8:	66656465 	strbtvs	r6, [r5], -r5, ror #8
    9abc:	41535500 	cmpmi	r3, r0, lsl #10
    9ac0:	425f5452 	subsmi	r5, pc, #1375731712	; 0x52000000
    9ac4:	52445541 	subpl	r5, r4, #272629760	; 0x10400000
    9ac8:	5f455441 	svcpl	0x00455441
    9acc:	30303432 	eorscc	r3, r0, r2, lsr r4
    9ad0:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    9ad4:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    9ad8:	3229745f 	eorcc	r7, r9, #1593835520	; 0x5f000000
    9adc:	00303034 	eorseq	r3, r0, r4, lsr r0
    9ae0:	52415355 	subpl	r5, r1, #1409286145	; 0x54000001
    9ae4:	4c465f54 	mcrrmi	15, 5, r5, r6, cr4
    9ae8:	435f574f 	cmpmi	pc, #20709376	; 0x13c0000
    9aec:	52544e4f 	subspl	r4, r4, #1264	; 0x4f0
    9af0:	525f4c4f 	subspl	r4, pc, #20224	; 0x4f00
    9af4:	28205354 	stmdacs	r0!, {r2, r4, r6, r8, r9, ip, lr}
    9af8:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    9afc:	745f3233 	ldrbvc	r3, [pc], #-563	; 9b04 <_Min_Stack_Size+0x9704>
    9b00:	3c312829 	ldccc	8, cr2, [r1], #-164	; 0xffffff5c
    9b04:	0029383c 	eoreq	r3, r9, ip, lsr r8
    9b08:	52415355 	subpl	r5, r1, #1409286145	; 0x54000001
    9b0c:	6f575f54 	svcvs	0x00575f54
    9b10:	654c6472 	strbvs	r6, [ip, #-1138]	; 0xfffffb8e
    9b14:	6874676e 	ldmdavs	r4!, {r1, r2, r3, r5, r6, r8, r9, sl, sp, lr}^
    9b18:	41535500 	cmpmi	r3, r0, lsl #10
    9b1c:	535f5452 	cmppl	pc, #1375731712	; 0x52000000
    9b20:	42706f74 	rsbsmi	r6, r0, #116, 30	; 0x1d0
    9b24:	00737469 	rsbseq	r7, r3, r9, ror #8
    9b28:	52415355 	subpl	r5, r1, #1409286145	; 0x54000001
    9b2c:	4f4d5f54 	svcmi	0x004d5f54
    9b30:	545f4544 	ldrbpl	r4, [pc], #-1348	; 9b38 <_Min_Stack_Size+0x9738>
    9b34:	75282058 	strvc	r2, [r8, #-88]!	; 0xffffffa8
    9b38:	33746e69 	cmncc	r4, #1680	; 0x690
    9b3c:	29745f32 	ldmdbcs	r4!, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    9b40:	3c3c3128 	ldfccs	f3, [ip], #-160	; 0xffffff60
    9b44:	55002933 	strpl	r2, [r0, #-2355]	; 0xfffff6cd
    9b48:	54524153 	ldrbpl	r4, [r2], #-339	; 0xfffffead
    9b4c:	5241505f 	subpl	r5, r1, #95	; 0x5f
    9b50:	5f595449 	svcpl	0x00595449
    9b54:	4e455645 	cdpmi	6, 4, cr5, cr5, cr5, {2}
    9b58:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    9b5c:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    9b60:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    9b64:	313c3c31 	teqcc	ip, r1, lsr ip
    9b68:	47002930 	smladxmi	r0, r0, r9, r2
    9b6c:	00525054 	subseq	r5, r2, r4, asr r0
    9b70:	5f564944 	svcpl	0x00564944
    9b74:	746e614d 	strbtvc	r6, [lr], #-333	; 0xfffffeb3
    9b78:	61737369 	cmnvs	r3, r9, ror #6
    9b7c:	41535500 	cmpmi	r3, r0, lsl #10
    9b80:	425f5452 	subsmi	r5, pc, #1375731712	; 0x52000000
    9b84:	52647561 	rsbpl	r7, r4, #406847488	; 0x18400000
    9b88:	00657461 	rsbeq	r7, r5, r1, ror #8
    9b8c:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
    9b90:	5241555f 	subpl	r5, r1, #398458880	; 0x17c00000
    9b94:	65525f54 	ldrbvs	r5, [r2, #-3924]	; 0xfffff0ac
    9b98:	76696563 	strbtvc	r6, [r9], -r3, ror #10
    9b9c:	434d0065 	movtmi	r0, #53349	; 0xd065
    9ba0:	555f4c41 	ldrbpl	r4, [pc, #-3137]	; 8f67 <_Min_Stack_Size+0x8b67>
    9ba4:	5f545241 	svcpl	0x00545241
    9ba8:	54494157 	strbpl	r4, [r9], #-343	; 0xfffffea9
    9bac:	0043545f 	subeq	r5, r3, pc, asr r4
    9bb0:	54524155 	ldrbpl	r4, [r2], #-341	; 0xfffffeab
    9bb4:	6e6f435f 	mcrvs	3, 3, r4, cr15, cr15, {2}
    9bb8:	5f676966 	svcpl	0x00676966
    9bbc:	53550074 	cmppl	r5, #116	; 0x74
    9bc0:	5f545241 	svcpl	0x00545241
    9bc4:	445f4549 	ldrbmi	r4, [pc], #-1353	; 9bcc <_Min_Stack_Size+0x97cc>
    9bc8:	42415349 	submi	r5, r1, #603979777	; 0x24000001
    9bcc:	2820454c 	stmdacs	r0!, {r2, r3, r6, r8, sl, lr}
    9bd0:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    9bd4:	745f3233 	ldrbvc	r3, [pc], #-563	; 9bdc <_Min_Stack_Size+0x97dc>
    9bd8:	29302829 	ldmdbcs	r0!, {r0, r3, r5, fp, sp}
    9bdc:	73746300 	cmnvc	r4, #0, 6
    9be0:	74630031 	strbtvc	r0, [r3], #-49	; 0xffffffcf
    9be4:	63003273 	movwvs	r3, #627	; 0x273
    9be8:	00337374 	eorseq	r7, r3, r4, ror r3
    9bec:	52415355 	subpl	r5, r1, #1409286145	; 0x54000001
    9bf0:	54535f54 	ldrbpl	r5, [r3], #-3924	; 0xfffff0ac
    9bf4:	425f504f 	subsmi	r5, pc, #79	; 0x4f
    9bf8:	315f5449 	cmpcc	pc, r9, asr #8
    9bfc:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    9c00:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    9c04:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    9c08:	313c3c30 	teqcc	ip, r0, lsr ip
    9c0c:	55002932 	strpl	r2, [r0, #-2354]	; 0xfffff6ce
    9c10:	54524153 	ldrbpl	r4, [r2], #-339	; 0xfffffead
    9c14:	52495f33 	subpl	r5, r9, #51, 30	; 0xcc
    9c18:	6e614851 	mcrvs	8, 3, r4, cr1, cr1, {2}
    9c1c:	72656c64 	rsbvc	r6, r5, #100, 24	; 0x6400
    9c20:	41535500 	cmpmi	r3, r0, lsl #10
    9c24:	425f5452 	subsmi	r5, pc, #1375731712	; 0x52000000
    9c28:	52445541 	subpl	r5, r4, #272629760	; 0x10400000
    9c2c:	5f455441 	svcpl	0x00455441
    9c30:	30303534 	eorscc	r3, r0, r4, lsr r5
    9c34:	20303030 	eorscs	r3, r0, r0, lsr r0
    9c38:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    9c3c:	5f323374 	svcpl	0x00323374
    9c40:	35342974 	ldrcc	r2, [r4, #-2420]!	; 0xfffff68c
    9c44:	30303030 	eorscc	r3, r0, r0, lsr r0
    9c48:	41550030 	cmpmi	r5, r0, lsr r0
    9c4c:	505f5452 	subspl	r5, pc, r2, asr r4	; <UNPREDICTABLE>
    9c50:	696c6c6f 	stmdbvs	ip!, {r0, r1, r2, r3, r5, r6, sl, fp, sp, lr}^
    9c54:	445f676e 	ldrbmi	r6, [pc], #-1902	; 9c5c <_Min_Stack_Size+0x985c>
    9c58:	62617369 	rsbvs	r7, r1, #-1543503871	; 0xa4000001
    9c5c:	4400656c 	strmi	r6, [r0], #-1388	; 0xfffffa94
    9c60:	465f5649 	ldrbmi	r5, [pc], -r9, asr #12
    9c64:	74636172 	strbtvc	r6, [r3], #-370	; 0xfffffe8e
    9c68:	006e6f69 	rsbeq	r6, lr, r9, ror #30
    9c6c:	52415355 	subpl	r5, r1, #1409286145	; 0x54000001
    9c70:	45495f54 	strbmi	r5, [r9, #-3924]	; 0xfffff0ac
    9c74:	4358545f 	cmpmi	r8, #1593835520	; 0x5f000000
    9c78:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    9c7c:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    9c80:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    9c84:	363c3c31 			; <UNDEFINED> instruction: 0x363c3c31
    9c88:	53550029 	cmppl	r5, #41	; 0x29
    9c8c:	5f545241 	svcpl	0x00545241
    9c90:	44554142 	ldrbmi	r4, [r5], #-322	; 0xfffffebe
    9c94:	45544152 	ldrbmi	r4, [r4, #-338]	; 0xfffffeae
    9c98:	3637355f 			; <UNDEFINED> instruction: 0x3637355f
    9c9c:	28203030 	stmdacs	r0!, {r4, r5, ip, sp}
    9ca0:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    9ca4:	745f3233 	ldrbvc	r3, [pc], #-563	; 9cac <_Min_Stack_Size+0x98ac>
    9ca8:	36373529 	ldrtcc	r3, [r7], -r9, lsr #10
    9cac:	55003030 	strpl	r3, [r0, #-48]	; 0xffffffd0
    9cb0:	54524153 	ldrbpl	r4, [r2], #-339	; 0xfffffead
    9cb4:	5541425f 	strbpl	r4, [r1, #-607]	; 0xfffffda1
    9cb8:	54415244 	strbpl	r5, [r1], #-580	; 0xfffffdbc
    9cbc:	36345f45 	ldrtcc	r5, [r4], -r5, asr #30
    9cc0:	30303830 	eorscc	r3, r0, r0, lsr r8
    9cc4:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    9cc8:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    9ccc:	3429745f 	strtcc	r7, [r9], #-1119	; 0xfffffba1
    9cd0:	30383036 	eorscc	r3, r8, r6, lsr r0
    9cd4:	53550030 	cmppl	r5, #48	; 0x30
    9cd8:	5f545241 	svcpl	0x00545241
    9cdc:	504f5453 	subpl	r5, pc, r3, asr r4	; <UNPREDICTABLE>
    9ce0:	5449425f 	strbpl	r4, [r9], #-607	; 0xfffffda1
    9ce4:	2820325f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r9, ip, sp}
    9ce8:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    9cec:	745f3233 	ldrbvc	r3, [pc], #-563	; 9cf4 <_Min_Stack_Size+0x98f4>
    9cf0:	3c322829 	ldccc	8, cr2, [r2], #-164	; 0xffffff5c
    9cf4:	2932313c 	ldmdbcs	r2!, {r2, r3, r4, r5, r8, ip, sp}
    9cf8:	41535500 	cmpmi	r3, r0, lsl #10
    9cfc:	425f5452 	subsmi	r5, pc, #1375731712	; 0x52000000
    9d00:	52445541 	subpl	r5, r4, #272629760	; 0x10400000
    9d04:	5f455441 	svcpl	0x00455441
    9d08:	36313239 			; <UNDEFINED> instruction: 0x36313239
    9d0c:	28203030 	stmdacs	r0!, {r4, r5, ip, sp}
    9d10:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    9d14:	745f3233 	ldrbvc	r3, [pc], #-563	; 9d1c <_Min_Stack_Size+0x991c>
    9d18:	31323929 	teqcc	r2, r9, lsr #18
    9d1c:	00303036 	eorseq	r3, r0, r6, lsr r0
    9d20:	52415355 	subpl	r5, r1, #1409286145	; 0x54000001
    9d24:	45495f54 	strbmi	r5, [r9, #-3924]	; 0xfffff0ac
    9d28:	2045505f 	subcs	r5, r5, pc, asr r0
