mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    9d2c:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    9d30:	5f323374 	svcpl	0x00323374
    9d34:	31282974 			; <UNDEFINED> instruction: 0x31282974
    9d38:	29383c3c 	ldmdbcs	r8!, {r2, r3, r4, r5, sl, fp, ip, sp}
    9d3c:	41434d00 	cmpmi	r3, r0, lsl #26
    9d40:	41555f4c 	cmpmi	r5, ip, asr #30
    9d44:	445f5452 	ldrbmi	r5, [pc], #-1106	; 9d4c <_Min_Stack_Size+0x994c>
    9d48:	696e4965 	stmdbvs	lr!, {r0, r2, r5, r6, r8, fp, lr}^
    9d4c:	53550074 	cmppl	r5, #116	; 0x74
    9d50:	5f545241 	svcpl	0x00545241
    9d54:	776f6c46 	strbvc	r6, [pc, -r6, asr #24]!
    9d58:	746e6f43 	strbtvc	r6, [lr], #-3907	; 0xfffff0bd
    9d5c:	006c6f72 	rsbeq	r6, ip, r2, ror pc
    9d60:	52415355 	subpl	r5, r1, #1409286145	; 0x54000001
    9d64:	41425f54 	cmpmi	r2, r4, asr pc
    9d68:	41524455 	cmpmi	r2, r5, asr r4
    9d6c:	395f4554 	ldmdbcc	pc, {r2, r4, r6, r8, sl, lr}^	; <UNPREDICTABLE>
    9d70:	20303036 	eorscs	r3, r0, r6, lsr r0
    9d74:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    9d78:	5f323374 	svcpl	0x00323374
    9d7c:	36392974 			; <UNDEFINED> instruction: 0x36392974
    9d80:	55003030 	strpl	r3, [r0, #-48]	; 0xffffffd0
    9d84:	54524153 	ldrbpl	r4, [r2], #-339	; 0xfffffead
    9d88:	444f4d5f 	strbmi	r4, [pc], #-3423	; 9d90 <_Min_Stack_Size+0x9990>
    9d8c:	58525f45 	ldmdapl	r2, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
    9d90:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    9d94:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    9d98:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    9d9c:	323c3c31 	eorscc	r3, ip, #12544	; 0x3100
    9da0:	53550029 	cmppl	r5, #41	; 0x29
    9da4:	5f545241 	svcpl	0x00545241
    9da8:	44554142 	ldrbmi	r4, [r5], #-322	; 0xfffffebe
    9dac:	45544152 	ldrbmi	r4, [r4, #-338]	; 0xfffffeae
    9db0:	3033325f 	eorscc	r3, r3, pc, asr r2
    9db4:	20303034 	eorscs	r3, r0, r4, lsr r0
    9db8:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    9dbc:	5f323374 	svcpl	0x00323374
    9dc0:	33322974 	teqcc	r2, #116, 18	; 0x1d0000
    9dc4:	30303430 	eorscc	r3, r0, r0, lsr r4
    9dc8:	41535500 	cmpmi	r3, r0, lsl #10
    9dcc:	535f5452 	cmppl	pc, #1375731712	; 0x52000000
    9dd0:	5f504f54 	svcpl	0x00504f54
    9dd4:	5f544942 	svcpl	0x00544942
    9dd8:	20355f30 	eorscs	r5, r5, r0, lsr pc
    9ddc:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    9de0:	5f323374 	svcpl	0x00323374
    9de4:	31282974 			; <UNDEFINED> instruction: 0x31282974
    9de8:	32313c3c 	eorscc	r3, r1, #60, 24	; 0x3c00
    9dec:	53550029 	cmppl	r5, #41	; 0x29
    9df0:	5f545241 	svcpl	0x00545241
    9df4:	6c6c6f50 	stclvs	15, cr6, [ip], #-320	; 0xfffffec0
    9df8:	5f676e69 	svcpl	0x00676e69
    9dfc:	6863654d 	stmdavs	r3!, {r0, r2, r3, r6, r8, sl, sp, lr}^
    9e00:	73696e61 	cmnvc	r9, #1552	; 0x610
    9e04:	00745f6d 	rsbseq	r5, r4, sp, ror #30
    9e08:	52415355 	subpl	r5, r1, #1409286145	; 0x54000001
    9e0c:	6f4d5f54 	svcvs	0x004d5f54
    9e10:	55006564 	strpl	r6, [r0, #-1380]	; 0xfffffa9c
    9e14:	54524153 	ldrbpl	r4, [r2], #-339	; 0xfffffead
    9e18:	4f54535f 	svcmi	0x0054535f
    9e1c:	49425f50 	stmdbmi	r2, {r4, r6, r8, r9, sl, fp, ip, lr}^
    9e20:	5f315f54 	svcpl	0x00315f54
    9e24:	75282035 	strvc	r2, [r8, #-53]!	; 0xffffffcb
    9e28:	33746e69 	cmncc	r4, #1680	; 0x690
    9e2c:	29745f32 	ldmdbcs	r4!, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    9e30:	3c3c3328 	ldccc	3, cr3, [ip], #-160	; 0xffffff60
    9e34:	00293231 	eoreq	r3, r9, r1, lsr r2
    9e38:	52415355 	subpl	r5, r1, #1409286145	; 0x54000001
    9e3c:	41425f54 	cmpmi	r2, r4, asr pc
    9e40:	41524455 	cmpmi	r2, r5, asr r4
    9e44:	325f4554 	subscc	r4, pc, #84, 10	; 0x15000000
    9e48:	30303532 	eorscc	r3, r0, r2, lsr r5
    9e4c:	28203030 	stmdacs	r0!, {r4, r5, ip, sp}
    9e50:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    9e54:	745f3233 	ldrbvc	r3, [pc], #-563	; 9e5c <_Min_Stack_Size+0x9a5c>
    9e58:	35323229 	ldrcc	r3, [r2, #-553]!	; 0xfffffdd7
    9e5c:	30303030 	eorscc	r3, r0, r0, lsr r0
    9e60:	41535500 	cmpmi	r3, r0, lsl #10
    9e64:	495f5452 	ldmdbmi	pc, {r1, r4, r6, sl, ip, lr}^	; <UNPREDICTABLE>
    9e68:	58525f45 	ldmdapl	r2, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
    9e6c:	2820454e 	stmdacs	r0!, {r1, r2, r3, r6, r8, sl, lr}
    9e70:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    9e74:	745f3233 	ldrbvc	r3, [pc], #-563	; 9e7c <_Min_Stack_Size+0x9a7c>
    9e78:	3c312829 	ldccc	8, cr2, [r1], #-164	; 0xffffff5c
    9e7c:	0029353c 	eoreq	r3, r9, ip, lsr r5
    9e80:	52415355 	subpl	r5, r1, #1409286145	; 0x54000001
    9e84:	45495f54 	strbmi	r5, [r9, #-3924]	; 0xfffff0ac
    9e88:	4558545f 	ldrbmi	r5, [r8, #-1119]	; 0xfffffba1
    9e8c:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    9e90:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    9e94:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    9e98:	373c3c31 			; <UNDEFINED> instruction: 0x373c3c31
    9e9c:	434d0029 	movtmi	r0, #53289	; 0xd029
    9ea0:	555f4c41 	ldrbpl	r4, [pc, #-3137]	; 9267 <_Min_Stack_Size+0x8e67>
    9ea4:	5f545241 	svcpl	0x00545241
    9ea8:	6e617254 	mcrvs	2, 3, r7, cr1, cr4, {2}
    9eac:	74696d73 	strbtvc	r6, [r9], #-3443	; 0xfffff28d
    9eb0:	41535500 	cmpmi	r3, r0, lsl #10
    9eb4:	575f5452 			; <UNDEFINED> instruction: 0x575f5452
    9eb8:	5f44524f 	svcpl	0x0044524f
    9ebc:	474e454c 	strbmi	r4, [lr, -ip, asr #10]
    9ec0:	395f4854 	ldmdbcc	pc, {r2, r4, r6, fp, lr}^	; <UNPREDICTABLE>
    9ec4:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    9ec8:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    9ecc:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    9ed0:	313c3c31 	teqcc	ip, r1, lsr ip
    9ed4:	44002932 	strmi	r2, [r0], #-2354	; 0xfffff6ce
    9ed8:	4d5f5649 	ldclmi	6, cr5, [pc, #-292]	; 9dbc <_Min_Stack_Size+0x99bc>
    9edc:	69746e61 	ldmdbvs	r4!, {r0, r5, r6, r9, sl, fp, sp, lr}^
    9ee0:	5f617373 	svcpl	0x00617373
    9ee4:	314c554d 	cmpcc	ip, sp, asr #10
    9ee8:	55003030 	strpl	r3, [r0, #-48]	; 0xffffffd0
    9eec:	54524153 	ldrbpl	r4, [r2], #-339	; 0xfffffead
    9ef0:	5541425f 	strbpl	r4, [r1, #-607]	; 0xfffffda1
    9ef4:	54415244 	strbpl	r5, [r1], #-580	; 0xfffffdbc
    9ef8:	31315f45 	teqcc	r1, r5, asr #30
    9efc:	30303235 	eorscc	r3, r0, r5, lsr r2
    9f00:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    9f04:	3233746e 	eorscc	r7, r3, #1845493760	; 0x6e000000
    9f08:	3129745f 			; <UNDEFINED> instruction: 0x3129745f
    9f0c:	30323531 	eorscc	r3, r2, r1, lsr r5
    9f10:	434d0030 	movtmi	r0, #53296	; 0xd030
    9f14:	555f4c41 	ldrbpl	r4, [pc, #-3137]	; 92db <_Min_Stack_Size+0x8edb>
    9f18:	5f545241 	svcpl	0x00545241
    9f1c:	74696e49 	strbtvc	r6, [r9], #-3657	; 0xfffff1b7
    9f20:	41535500 	cmpmi	r3, r0, lsl #10
    9f24:	465f5452 			; <UNDEFINED> instruction: 0x465f5452
    9f28:	5f574f4c 	svcpl	0x00574f4c
    9f2c:	544e4f43 	strbpl	r4, [lr], #-3907	; 0xfffff0bd
    9f30:	5f4c4f52 	svcpl	0x004c4f52
    9f34:	41534944 	cmpmi	r3, r4, asr #18
    9f38:	20454c42 	subcs	r4, r5, r2, asr #24
    9f3c:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    9f40:	5f323374 	svcpl	0x00323374
    9f44:	30282974 	eorcc	r2, r8, r4, ror r9
    9f48:	4e490029 	cdpmi	0, 4, cr0, cr9, cr9, {1}
    9f4c:	53555f43 	cmppl	r5, #268	; 0x10c
    9f50:	5f545241 	svcpl	0x00545241
    9f54:	00205f48 	eoreq	r5, r0, r8, asr #30
    9f58:	52415355 	subpl	r5, r1, #1409286145	; 0x54000001
    9f5c:	55007854 	strpl	r7, [r0, #-2132]	; 0xfffff7ac
    9f60:	54524153 	ldrbpl	r4, [r2], #-339	; 0xfffffead
    9f64:	52495f31 	subpl	r5, r9, #49, 30	; 0xc4
    9f68:	6e614851 	mcrvs	8, 3, r4, cr1, cr1, {2}
    9f6c:	72656c64 	rsbvc	r6, r5, #100, 24	; 0x6400
    9f70:	52415500 	subpl	r5, r1, #0, 10
    9f74:	6f435f54 	svcvs	0x00435f54
    9f78:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    9f7c:	00727450 	rsbseq	r7, r2, r0, asr r4
    9f80:	5f564944 	svcpl	0x00564944
    9f84:	63617246 	cmnvs	r1, #1610612740	; 0x60000004
    9f88:	6e6f6974 			; <UNDEFINED> instruction: 0x6e6f6974
    9f8c:	4c554d5f 	mrrcmi	13, 5, r4, r5, cr15
    9f90:	00303031 	eorseq	r3, r0, r1, lsr r0
    9f94:	52415355 	subpl	r5, r1, #1409286145	; 0x54000001
    9f98:	52495f54 	subpl	r5, r9, #84, 30	; 0x150
    9f9c:	4e455f51 	mcrmi	15, 2, r5, cr5, cr1, {2}
    9fa0:	41535500 	cmpmi	r3, r0, lsl #10
    9fa4:	465f5452 			; <UNDEFINED> instruction: 0x465f5452
    9fa8:	5f574f4c 	svcpl	0x00574f4c
    9fac:	544e4f43 	strbpl	r4, [lr], #-3907	; 0xfffff0bd
    9fb0:	5f4c4f52 	svcpl	0x004c4f52
    9fb4:	20535443 	subscs	r5, r3, r3, asr #8
    9fb8:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    9fbc:	5f323374 	svcpl	0x00323374
    9fc0:	31282974 			; <UNDEFINED> instruction: 0x31282974
    9fc4:	29393c3c 	ldmdbcs	r9!, {r2, r3, r4, r5, sl, fp, ip, sp}
    9fc8:	52415500 	subpl	r5, r1, #0, 10
    9fcc:	6f505f54 	svcvs	0x00505f54
    9fd0:	6e696c6c 	cdpvs	12, 6, cr6, cr9, cr12, {3}
    9fd4:	6e455f67 	cdpvs	15, 4, cr5, cr5, cr7, {3}
    9fd8:	656c6261 	strbvs	r6, [ip, #-609]!	; 0xfffffd9f
    9fdc:	41535500 	cmpmi	r3, r0, lsl #10
    9fe0:	465f5452 			; <UNDEFINED> instruction: 0x465f5452
    9fe4:	5f574f4c 	svcpl	0x00574f4c
    9fe8:	544e4f43 	strbpl	r4, [lr], #-3907	; 0xfffff0bd
    9fec:	5f4c4f52 	svcpl	0x004c4f52
    9ff0:	5f535452 	svcpl	0x00535452
    9ff4:	20535443 	subscs	r5, r3, r3, asr #8
    9ff8:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    9ffc:	5f323374 	svcpl	0x00323374
    a000:	28282974 	stmdacs	r8!, {r2, r4, r5, r6, r8, fp, sp}
    a004:	383c3c31 	ldmdacc	ip!, {r0, r4, r5, sl, fp, ip, sp}
    a008:	31287c29 			; <UNDEFINED> instruction: 0x31287c29
    a00c:	29393c3c 	ldmdbcs	r9!, {r2, r3, r4, r5, sl, fp, ip, sp}
    a010:	53550029 	cmppl	r5, #41	; 0x29
    a014:	5f545241 	svcpl	0x00545241
    a018:	49524150 	ldmdbmi	r2, {r4, r6, r8, lr}^
    a01c:	4f5f5954 	svcmi	0x005f5954
    a020:	28204444 	stmdacs	r0!, {r2, r6, sl, lr}
    a024:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    a028:	745f3233 	ldrbvc	r3, [pc], #-563	; a030 <_Min_Stack_Size+0x9c30>
    a02c:	31282829 			; <UNDEFINED> instruction: 0x31282829
    a030:	29393c3c 	ldmdbcs	r9!, {r2, r3, r4, r5, sl, fp, ip, sp}
    a034:	3c31287c 	ldccc	8, cr2, [r1], #-496	; 0xfffffe10
    a038:	2930313c 	ldmdbcs	r0!, {r2, r3, r4, r5, r8, ip, sp}
    a03c:	74720029 	ldrbtvc	r0, [r2], #-41	; 0xffffffd7
    a040:	72003173 	andvc	r3, r0, #-1073741796	; 0xc000001c
    a044:	00327374 	eorseq	r7, r2, r4, ror r3
    a048:	33737472 	cmncc	r3, #1912602624	; 0x72000000
    a04c:	41535500 	cmpmi	r3, r0, lsl #10
    a050:	505f5452 	subspl	r5, pc, r2, asr r4	; <UNPREDICTABLE>
    a054:	74697261 	strbtvc	r7, [r9], #-609	; 0xfffffd9f
    a058:	53550079 	cmppl	r5, #121	; 0x79
    a05c:	5f545241 	svcpl	0x00545241
    a060:	49524150 	ldmdbmi	r2, {r4, r6, r8, lr}^
    a064:	445f5954 	ldrbmi	r5, [pc], #-2388	; a06c <_Min_Stack_Size+0x9c6c>
    a068:	42415349 	submi	r5, r1, #603979777	; 0x24000001
    a06c:	2820454c 	stmdacs	r0!, {r2, r3, r6, r8, sl, lr}
    a070:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    a074:	745f3233 	ldrbvc	r3, [pc], #-563	; a07c <_Min_Stack_Size+0x9c7c>
    a078:	3c302829 	ldccc	8, cr2, [r0], #-164	; 0xffffff5c
    a07c:	2930313c 	ldmdbcs	r0!, {r2, r3, r4, r5, r8, ip, sp}
    a080:	41434d00 	cmpmi	r3, r0, lsl #26
    a084:	41555f4c 	cmpmi	r5, ip, asr #30
    a088:	475f5452 			; <UNDEFINED> instruction: 0x475f5452
    a08c:	5f4f4950 	svcpl	0x004f4950
    a090:	50746553 	rsbspl	r6, r4, r3, asr r5
    a094:	00736e69 	rsbseq	r6, r3, r9, ror #28
    a098:	4b4c4350 	blmi	131ade0 <_Min_Stack_Size+0x131a9e0>
    a09c:	53550078 	cmppl	r5, #120	; 0x78
    a0a0:	5f545241 	svcpl	0x00545241
    a0a4:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    a0a8:	5f58545f 	svcpl	0x0058545f
    a0ac:	28205852 	stmdacs	r0!, {r1, r4, r6, fp, ip, lr}
    a0b0:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    a0b4:	745f3233 	ldrbvc	r3, [pc], #-563	; a0bc <_Min_Stack_Size+0x9cbc>
    a0b8:	31282829 			; <UNDEFINED> instruction: 0x31282829
    a0bc:	29323c3c 	ldmdbcs	r2!, {r2, r3, r4, r5, sl, fp, ip, sp}
    a0c0:	3c31287c 	ldccc	8, cr2, [r1], #-496	; 0xfffffe10
    a0c4:	2929333c 	stmdbcs	r9!, {r2, r3, r4, r5, r8, r9, ip, sp}
    a0c8:	41535500 	cmpmi	r3, r0, lsl #10
    a0cc:	5f325452 	svcpl	0x00325452
    a0d0:	48515249 	ldmdami	r1, {r0, r3, r6, r9, ip, lr}^
    a0d4:	6c646e61 	stclvs	14, cr6, [r4], #-388	; 0xfffffe7c
    a0d8:	4c007265 	sfmmi	f7, 4, [r0], {101}	; 0x65
    a0dc:	435f4443 	cmpmi	pc, #1124073472	; 0x43000000
    a0e0:	475f444d 	ldrbmi	r4, [pc, -sp, asr #8]
    a0e4:	4f545f4f 	svcmi	0x00545f4f
    a0e8:	4d4f485f 	stclmi	8, cr4, [pc, #-380]	; 9f74 <_Min_Stack_Size+0x9b74>
    a0ec:	30282045 	eorcc	r2, r8, r5, asr #32
    a0f0:	29323078 	ldmdbcs	r2!, {r3, r4, r5, r6, ip, sp}
    a0f4:	44434c00 	strbmi	r4, [r3], #-3072	; 0xfffff400
    a0f8:	5f36445f 	svcpl	0x0036445f
    a0fc:	204e4950 	subcs	r4, lr, r0, asr r9
    a100:	4f495047 	svcmi	0x00495047
    a104:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a108:	4b00375f 	blmi	17e8c <_Min_Stack_Size+0x17a8c>
    a10c:	41505945 	cmpmi	r0, r5, asr #18
    a110:	30435f44 	subcc	r5, r3, r4, asr #30
    a114:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a118:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
    a11c:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    a120:	00345f4e 	eorseq	r5, r4, lr, asr #30
    a124:	535f375f 	cmppl	pc, #24903680	; 0x17c0000
    a128:	454d4745 	strbmi	r4, [sp, #-1861]	; 0xfffff8bb
    a12c:	445f544e 	ldrbmi	r5, [pc], #-1102	; a134 <_Min_Stack_Size+0x9d34>
    a130:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a134:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
    a138:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    a13c:	32315f4e 	eorscc	r5, r1, #312	; 0x138
    a140:	59454b00 	stmdbpl	r5, {r8, r9, fp, lr}^
    a144:	5f444150 	svcpl	0x00444150
    a148:	505f3143 	subspl	r3, pc, r3, asr #2
    a14c:	47204e49 	strmi	r4, [r0, -r9, asr #28]!
    a150:	5f4f4950 	svcpl	0x004f4950
    a154:	5f4e4950 	svcpl	0x004e4950
    a158:	375f0035 	smmlarcc	pc, r5, r0, r0	; <UNPREDICTABLE>
    a15c:	4745535f 	smlsldmi	r5, r5, pc, r3	; <UNPREDICTABLE>
    a160:	544e454d 	strbpl	r4, [lr], #-1357	; 0xfffffab3
    a164:	505f455f 	subspl	r4, pc, pc, asr r5	; <UNPREDICTABLE>
    a168:	2054524f 	subscs	r5, r4, pc, asr #4
    a16c:	4f495047 	svcmi	0x00495047
    a170:	454b0042 	strbmi	r0, [fp, #-66]	; 0xffffffbe
    a174:	44415059 	strbmi	r5, [r1], #-89	; 0xffffffa7
    a178:	5f32435f 	svcpl	0x0032435f
    a17c:	54524f50 	ldrbpl	r4, [r2], #-3920	; 0xfffff0b0
    a180:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
    a184:	4b00414f 	blmi	1a6c8 <_Min_Stack_Size+0x1a2c8>
    a188:	41505945 	cmpmi	r0, r5, asr #18
    a18c:	33525f44 	cmpcc	r2, #68, 30	; 0x110
    a190:	524f505f 	subpl	r5, pc, #95	; 0x5f
    a194:	50472054 	subpl	r2, r7, r4, asr r0
    a198:	00414f49 	subeq	r4, r1, r9, asr #30
    a19c:	5f44434c 	svcpl	0x0044434c
    a1a0:	5f444d43 	svcpl	0x00444d43
    a1a4:	45564f4d 	ldrbmi	r4, [r6, #-3917]	; 0xfffff0b3
    a1a8:	5255435f 	subspl	r4, r5, #2080374785	; 0x7c000001
    a1ac:	5f524f53 	svcpl	0x00524f53
    a1b0:	5446454c 	strbpl	r4, [r6], #-1356	; 0xfffffab4
    a1b4:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    a1b8:	00293031 	eoreq	r3, r9, r1, lsr r0
    a1bc:	535f375f 	cmppl	pc, #24903680	; 0x17c0000
    a1c0:	454d4745 	strbmi	r4, [sp, #-1861]	; 0xfffff8bb
    a1c4:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    a1c8:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a1cc:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
    a1d0:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    a1d4:	34315f4e 	ldrtcc	r5, [r1], #-3918	; 0xfffff0b2
    a1d8:	44434c00 	strbmi	r4, [r3], #-3072	; 0xfffff400
    a1dc:	444d435f 	strbmi	r4, [sp], #-863	; 0xfffffca1
    a1e0:	5349445f 	movtpl	r4, #37983	; 0x945f
    a1e4:	4e4f5f50 	mcrmi	15, 2, r5, cr15, cr0, {2}
    a1e8:	494c425f 	stmdbmi	ip, {r0, r1, r2, r3, r4, r6, r9, lr}^
    a1ec:	28204b4e 	stmdacs	r0!, {r1, r2, r3, r6, r8, r9, fp, lr}
    a1f0:	44307830 	ldrtmi	r7, [r0], #-2096	; 0xfffff7d0
    a1f4:	375f0029 	ldrbcc	r0, [pc, -r9, lsr #32]
    a1f8:	4745535f 	smlsldmi	r5, r5, pc, r3	; <UNPREDICTABLE>
    a1fc:	544e454d 	strbpl	r4, [lr], #-1357	; 0xfffffab3
    a200:	5248545f 	subpl	r5, r8, #1593835520	; 0x5f000000
    a204:	28204545 	stmdacs	r0!, {r0, r2, r6, r8, sl, lr}
    a208:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    a20c:	29745f38 	ldmdbcs	r4!, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    a210:	30337830 	eorscc	r7, r3, r0, lsr r8
    a214:	5f375f00 	svcpl	0x00375f00
    a218:	4d474553 	cfstr64mi	mvdx4, [r7, #-332]	; 0xfffffeb4
    a21c:	5f544e45 	svcpl	0x00544e45
    a220:	4f505f43 	svcmi	0x00505f43
    a224:	47205452 			; <UNDEFINED> instruction: 0x47205452
    a228:	424f4950 	submi	r4, pc, #80, 18	; 0x140000
    a22c:	44434c00 	strbmi	r4, [r3], #-3072	; 0xfffff400
    a230:	5f4e455f 	svcpl	0x004e455f
    a234:	54524f50 	ldrbpl	r4, [r2], #-3920	; 0xfffff0b0
    a238:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
    a23c:	4b00414f 	blmi	1a780 <_Min_Stack_Size+0x1a380>
    a240:	41505945 	cmpmi	r0, r5, asr #18
    a244:	31525f44 	cmpcc	r2, r4, asr #30
    a248:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a24c:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
    a250:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    a254:	00315f4e 	eorseq	r5, r1, lr, asr #30
    a258:	56524553 			; <UNDEFINED> instruction: 0x56524553
    a25c:	33315f4f 	teqcc	r1, #316	; 0x13c
    a260:	75282035 	strvc	r2, [r8, #-53]!	; 0xffffffcb
    a264:	38746e69 	ldmdacc	r4!, {r0, r3, r5, r6, r9, sl, fp, sp, lr}^
    a268:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    a26c:	29353331 	ldmdbcs	r5!, {r0, r4, r5, r8, r9, ip, sp}
    a270:	44434c00 	strbmi	r4, [r3], #-3072	; 0xfffff400
    a274:	5f35445f 	svcpl	0x0035445f
    a278:	204e4950 	subcs	r4, lr, r0, asr r9
    a27c:	4f495047 	svcmi	0x00495047
    a280:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a284:	4c00365f 	stcmi	6, cr3, [r0], {95}	; 0x5f
    a288:	435f4443 	cmpmi	pc, #1124073472	; 0x43000000
    a28c:	435f444d 	cmpmi	pc, #1291845632	; 0x4d000000
    a290:	5241454c 	subpl	r4, r1, #76, 10	; 0x13000000
    a294:	5243535f 	subpl	r5, r3, #2080374785	; 0x7c000001
    a298:	204e4545 	subcs	r4, lr, r5, asr #10
    a29c:	30783028 	rsbscc	r3, r8, r8, lsr #32
    a2a0:	4c002931 			; <UNDEFINED> instruction: 0x4c002931
    a2a4:	435f4443 	cmpmi	pc, #1124073472	; 0x43000000
    a2a8:	4d5f444d 	cfldrdmi	mvd4, [pc, #-308]	; a17c <_Min_Stack_Size+0x9d7c>
    a2ac:	5f45564f 	svcpl	0x0045564f
    a2b0:	50534944 	subspl	r4, r3, r4, asr #18
    a2b4:	4749525f 	smlsldmi	r5, r9, pc, r2	; <UNPREDICTABLE>
    a2b8:	28205448 	stmdacs	r0!, {r3, r6, sl, ip, lr}
    a2bc:	43317830 	teqmi	r1, #48, 16	; 0x300000
    a2c0:	434c0029 	movtmi	r0, #49193	; 0xc029
    a2c4:	4d435f44 	stclmi	15, cr5, [r3, #-272]	; 0xfffffef0
    a2c8:	4e455f44 	cdpmi	15, 4, cr5, cr5, cr4, {2}
    a2cc:	5f595254 	svcpl	0x00595254
    a2d0:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    a2d4:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    a2d8:	00293630 	eoreq	r3, r9, r0, lsr r6
    a2dc:	5f44434c 	svcpl	0x0044434c
    a2e0:	414d5f58 	cmpmi	sp, r8, asr pc
    a2e4:	35312058 	ldrcc	r2, [r1, #-88]!	; 0xffffffa8
    a2e8:	51524900 	cmppl	r2, r0, lsl #18
    a2ec:	616c465f 	cmnvs	ip, pc, asr r6
    a2f0:	2e2e0067 	cdpcs	0, 2, cr0, cr14, cr7, {3}
    a2f4:	6372532f 	cmnvs	r2, #-1140850688	; 0xbc000000
    a2f8:	69616d2f 	stmdbvs	r1!, {r0, r1, r2, r3, r5, r8, sl, fp, sp, lr}^
    a2fc:	00632e6e 	rsbeq	r2, r3, lr, ror #28
    a300:	5f44434c 	svcpl	0x0044434c
    a304:	5f444d43 	svcpl	0x00444d43
    a308:	50534944 	subspl	r4, r3, r4, asr #18
    a30c:	5f4e4f5f 	svcpl	0x004e4f5f
    a310:	53525543 	cmppl	r2, #281018368	; 0x10c00000
    a314:	2820524f 	stmdacs	r0!, {r0, r1, r2, r3, r6, r9, ip, lr}
    a318:	45307830 	ldrmi	r7, [r0, #-2096]!	; 0xfffff7d0
    a31c:	434c0029 	movtmi	r0, #49193	; 0xc029
    a320:	4d435f44 	stclmi	15, cr5, [r3, #-272]	; 0xfffffef0
    a324:	49445f44 	stmdbmi	r4, {r2, r6, r8, r9, sl, fp, ip, lr}^
    a328:	4f5f5053 	svcmi	0x005f5053
    a32c:	28204646 	stmdacs	r0!, {r1, r2, r6, r9, sl, lr}
    a330:	38307830 	ldmdacc	r0!, {r4, r5, fp, ip, sp, lr}
    a334:	41480029 	cmpmi	r8, r9, lsr #32
    a338:	4e495f4c 	cdpmi	15, 4, cr5, cr9, cr12, {2}
    a33c:	434c5f43 	movtmi	r5, #53059	; 0xcf43
    a340:	5f485f44 	svcpl	0x00485f44
    a344:	454b0020 	strbmi	r0, [fp, #-32]	; 0xffffffe0
    a348:	44415059 	strbmi	r5, [r1], #-89	; 0xffffffa7
    a34c:	5455425f 	ldrbpl	r4, [r5], #-607	; 0xfffffda1
    a350:	5f4e4f54 	svcpl	0x004e4f54
    a354:	5f544f4e 	svcpl	0x00544f4e
    a358:	53455250 	movtpl	r5, #21072	; 0x5250
    a35c:	20444553 	subcs	r4, r4, r3, asr r5
    a360:	375f0030 	smmlarcc	pc, r0, r0, r0	; <UNPREDICTABLE>
    a364:	4745535f 	smlsldmi	r5, r5, pc, r3	; <UNPREDICTABLE>
    a368:	544e454d 	strbpl	r4, [lr], #-1357	; 0xfffffab3
    a36c:	505f435f 	subspl	r4, pc, pc, asr r3	; <UNPREDICTABLE>
    a370:	47204e49 	strmi	r4, [r0, -r9, asr #28]!
    a374:	5f4f4950 	svcpl	0x004f4950
    a378:	5f4e4950 	svcpl	0x004e4950
    a37c:	53003131 	movwpl	r3, #305	; 0x131
    a380:	4f565245 	svcmi	0x00565245
    a384:	2030395f 	eorscs	r3, r0, pc, asr r9
    a388:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    a38c:	745f3874 	ldrbvc	r3, [pc], #-2164	; a394 <_Min_Stack_Size+0x9f94>
    a390:	30392829 	eorscc	r2, r9, r9, lsr #16
    a394:	434c0029 	movtmi	r0, #49193	; 0xc029
    a398:	53525f44 	cmppl	r2, #68, 30	; 0x110
    a39c:	524f505f 	subpl	r5, pc, #95	; 0x5f
    a3a0:	50472054 	subpl	r2, r7, r4, asr r0
    a3a4:	00414f49 	subeq	r4, r1, r9, asr #30
    a3a8:	535f375f 	cmppl	pc, #24903680	; 0x17c0000
    a3ac:	454d4745 	strbmi	r4, [sp, #-1861]	; 0xfffff8bb
    a3b0:	475f544e 	ldrbmi	r5, [pc, -lr, asr #8]
    a3b4:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a3b8:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
    a3bc:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    a3c0:	35315f4e 	ldrcc	r5, [r1, #-3918]!	; 0xfffff0b2
    a3c4:	44434c00 	strbmi	r4, [r3], #-3072	; 0xfffff400
    a3c8:	5f37445f 	svcpl	0x0037445f
    a3cc:	204e4950 	subcs	r4, lr, r0, asr r9
    a3d0:	4f495047 	svcmi	0x00495047
    a3d4:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a3d8:	4c00305f 	stcmi	0, cr3, [r0], {95}	; 0x5f
    a3dc:	435f4443 	cmpmi	pc, #1124073472	; 0x43000000
    a3e0:	455f444d 	ldrbmi	r4, [pc, #-1101]	; 9f9b <_Min_Stack_Size+0x9b9b>
    a3e4:	5952544e 	ldmdbpl	r2, {r1, r2, r3, r6, sl, ip, lr}^
    a3e8:	4345445f 	movtmi	r4, #21599	; 0x545f
    a3ec:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    a3f0:	00293430 	eoreq	r3, r9, r0, lsr r4
    a3f4:	5059454b 	subspl	r4, r9, fp, asr #10
    a3f8:	525f4441 	subspl	r4, pc, #1090519040	; 0x41000000
    a3fc:	4f505f30 	svcmi	0x00505f30
    a400:	47205452 			; <UNDEFINED> instruction: 0x47205452
    a404:	414f4950 	cmpmi	pc, r0, asr r9	; <UNPREDICTABLE>
    a408:	54584500 	ldrbpl	r4, [r8], #-1280	; 0xfffffb00
    a40c:	6e6f4349 	cdpvs	3, 6, cr4, cr15, cr9, {2}
    a410:	00676966 	rsbeq	r6, r7, r6, ror #18
    a414:	535f375f 	cmppl	pc, #24903680	; 0x17c0000
    a418:	454d4745 	strbmi	r4, [sp, #-1861]	; 0xfffff8bb
    a41c:	415f544e 	cmpmi	pc, lr, asr #8
    a420:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a424:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
    a428:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    a42c:	00395f4e 	eorseq	r5, r9, lr, asr #30
    a430:	5f44434c 	svcpl	0x0044434c
    a434:	5f444d43 	svcpl	0x00444d43
    a438:	52544e45 	subspl	r4, r4, #1104	; 0x450
    a43c:	45445f59 	strbmi	r5, [r4, #-3929]	; 0xfffff0a7
    a440:	48535f43 	ldmdami	r3, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    a444:	20544649 	subscs	r4, r4, r9, asr #12
    a448:	30783028 	rsbscc	r3, r8, r8, lsr #32
    a44c:	4c002935 			; <UNDEFINED> instruction: 0x4c002935
    a450:	595f4443 	ldmdbpl	pc, {r0, r1, r6, sl, lr}^	; <UNPREDICTABLE>
    a454:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    a458:	4c003220 	sfmmi	f3, 4, [r0], {32}
    a45c:	435f4443 	cmpmi	pc, #1124073472	; 0x43000000
