mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
    a460:	4d5f444d 	cfldrdmi	mvd4, [pc, #-308]	; a334 <_Min_Stack_Size+0x9f34>
    a464:	5f45564f 	svcpl	0x0045564f
    a468:	50534944 	subspl	r4, r3, r4, asr #18
    a46c:	46454c5f 			; <UNDEFINED> instruction: 0x46454c5f
    a470:	30282054 	eorcc	r2, r8, r4, asr r0
    a474:	29383178 	ldmdbcs	r8!, {r3, r4, r5, r6, r8, ip, sp}
    a478:	59454b00 	stmdbpl	r5, {r8, r9, fp, lr}^
    a47c:	5f444150 	svcpl	0x00444150
    a480:	505f3343 	subspl	r3, pc, r3, asr #6
    a484:	2054524f 	subscs	r5, r4, pc, asr #4
    a488:	4f495047 	svcmi	0x00495047
    a48c:	434c0041 	movtmi	r0, #49217	; 0xc041
    a490:	4d435f44 	stclmi	15, cr5, [r3, #-272]	; 0xfffffef0
    a494:	55465f44 	strbpl	r5, [r6, #-3908]	; 0xfffff0bc
    a498:	4954434e 	ldmdbmi	r4, {r1, r2, r3, r6, r8, r9, lr}^
    a49c:	345f4e4f 	ldrbcc	r4, [pc], #-3663	; a4a4 <_Min_Stack_Size+0xa0a4>
    a4a0:	5f544942 	svcpl	0x00544942
    a4a4:	4e494c32 	mcrmi	12, 2, r4, cr9, cr2, {1}
    a4a8:	28205345 	stmdacs	r0!, {r0, r2, r6, r8, r9, ip, lr}
    a4ac:	38327830 	ldmdacc	r2!, {r4, r5, fp, ip, sp, lr}
    a4b0:	434c0029 	movtmi	r0, #49193	; 0xc029
    a4b4:	4d435f44 	stclmi	15, cr5, [r3, #-272]	; 0xfffffef0
    a4b8:	45425f44 	strbmi	r5, [r2, #-3908]	; 0xfffff0bc
    a4bc:	5f4e4947 	svcpl	0x004e4947
    a4c0:	535f5441 	cmppl	pc, #1090519040	; 0x41000000
    a4c4:	4e4f4345 	cdpmi	3, 4, cr4, cr15, cr5, {2}
    a4c8:	4f525f44 	svcmi	0x00525f44
    a4cc:	30282057 	eorcc	r2, r8, r7, asr r0
    a4d0:	29304378 	ldmdbcs	r0!, {r3, r4, r5, r6, r8, r9, lr}
    a4d4:	5f375f00 	svcpl	0x00375f00
    a4d8:	4d474553 	cfstr64mi	mvdx4, [r7, #-332]	; 0xfffffeb4
    a4dc:	5f544e45 	svcpl	0x00544e45
    a4e0:	4f505f46 	svcmi	0x00505f46
    a4e4:	47205452 			; <UNDEFINED> instruction: 0x47205452
    a4e8:	424f4950 	submi	r4, pc, #80, 18	; 0x140000
    a4ec:	52455300 	subpl	r5, r5, #0, 6
    a4f0:	315f4f56 	cmpcc	pc, r6, asr pc	; <UNPREDICTABLE>
    a4f4:	28203038 	stmdacs	r0!, {r3, r4, r5, ip, sp}
    a4f8:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    a4fc:	29745f38 	ldmdbcs	r4!, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    a500:	30383128 	eorscc	r3, r8, r8, lsr #2
    a504:	454b0029 	strbmi	r0, [fp, #-41]	; 0xffffffd7
    a508:	44415059 	strbmi	r5, [r1], #-89	; 0xffffffa7
    a50c:	5f32435f 	svcpl	0x0032435f
    a510:	204e4950 	subcs	r4, lr, r0, asr r9
    a514:	4f495047 	svcmi	0x00495047
    a518:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a51c:	4900365f 	stmdbmi	r0, {r0, r1, r2, r3, r4, r6, r9, sl, ip, sp}
    a520:	535f434e 	cmppl	pc, #939524097	; 0x38000001
    a524:	4e455645 	cdpmi	6, 4, cr5, cr5, cr5, {2}
    a528:	4d474553 	cfstr64mi	mvdx4, [r7, #-332]	; 0xfffffeb4
    a52c:	5f544e45 	svcpl	0x00544e45
    a530:	00205f48 	eoreq	r5, r0, r8, asr #30
    a534:	5f44434c 	svcpl	0x0044434c
    a538:	505f3644 	subspl	r3, pc, r4, asr #12
    a53c:	2054524f 	subscs	r5, r4, pc, asr #4
    a540:	4f495047 	svcmi	0x00495047
    a544:	45450041 	strbmi	r0, [r5, #-65]	; 0xffffffbf
    a548:	4d4f5250 	sfmmi	f5, 2, [pc, #-320]	; a410 <_Min_Stack_Size+0xa010>
    a54c:	414c535f 	cmpmi	ip, pc, asr r3
    a550:	415f4556 	cmpmi	pc, r6, asr r5	; <UNPREDICTABLE>
    a554:	45524444 	ldrbmi	r4, [r2, #-1092]	; 0xfffffbbc
    a558:	28205353 	stmdacs	r0!, {r0, r1, r4, r6, r8, r9, ip, lr}
    a55c:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    a560:	745f3631 	ldrbvc	r3, [pc], #-1585	; a568 <_Min_Stack_Size+0xa168>
    a564:	78302829 	ldmdavc	r0!, {r0, r3, r5, fp, sp}
    a568:	00293035 	eoreq	r3, r9, r5, lsr r0
    a56c:	5f434e49 	svcpl	0x00434e49
    a570:	56524553 			; <UNDEFINED> instruction: 0x56524553
    a574:	5f485f4f 	svcpl	0x00485f4f
    a578:	4e490020 	cdpmi	0, 4, cr0, cr9, cr0, {1}
    a57c:	454b5f43 	strbmi	r5, [fp, #-3907]	; 0xfffff0bd
    a580:	44415059 	strbmi	r5, [r1], #-89	; 0xffffffa7
    a584:	205f485f 	subscs	r4, pc, pc, asr r8	; <UNPREDICTABLE>
    a588:	5f375f00 	svcpl	0x00375f00
    a58c:	4d474553 	cfstr64mi	mvdx4, [r7, #-332]	; 0xfffffeb4
    a590:	5f544e45 	svcpl	0x00544e45
    a594:	48474945 	stmdami	r7, {r0, r2, r6, r8, fp, lr}^
    a598:	75282054 	strvc	r2, [r8, #-84]!	; 0xffffffac
    a59c:	38746e69 	ldmdacc	r4!, {r0, r3, r5, r6, r9, sl, fp, sp, lr}^
    a5a0:	3029745f 	eorcc	r7, r9, pc, asr r4
    a5a4:	00303078 	eorseq	r3, r0, r8, ror r0
    a5a8:	535f375f 	cmppl	pc, #24903680	; 0x17c0000
    a5ac:	454d4745 	strbmi	r4, [sp, #-1861]	; 0xfffff8bb
    a5b0:	455f544e 	ldrbmi	r5, [pc, #-1102]	; a16a <_Min_Stack_Size+0x9d6a>
    a5b4:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a5b8:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
    a5bc:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    a5c0:	33315f4e 	teqcc	r1, #312	; 0x138
    a5c4:	5f375f00 	svcpl	0x00375f00
    a5c8:	4d474553 	cfstr64mi	mvdx4, [r7, #-332]	; 0xfffffeb4
    a5cc:	5f544e45 	svcpl	0x00544e45
    a5d0:	4f505f44 	svcmi	0x00505f44
    a5d4:	47205452 			; <UNDEFINED> instruction: 0x47205452
    a5d8:	424f4950 	submi	r4, pc, #80, 18	; 0x140000
    a5dc:	44434c00 	strbmi	r4, [r3], #-3072	; 0xfffff400
    a5e0:	5f4e455f 	svcpl	0x004e455f
    a5e4:	204e4950 	subcs	r4, lr, r0, asr r9
    a5e8:	4f495047 	svcmi	0x00495047
    a5ec:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a5f0:	4b00345f 	blmi	17774 <_Min_Stack_Size+0x17374>
    a5f4:	41505945 	cmpmi	r0, r5, asr #18
    a5f8:	31435f44 	cmpcc	r3, r4, asr #30
    a5fc:	524f505f 	subpl	r5, pc, #95	; 0x5f
    a600:	50472054 	subpl	r2, r7, r4, asr r0
    a604:	00414f49 	subeq	r4, r1, r9, asr #30
    a608:	535f375f 	cmppl	pc, #24903680	; 0x17c0000
    a60c:	454d4745 	strbmi	r4, [sp, #-1861]	; 0xfffff8bb
    a610:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    a614:	20455649 	subcs	r5, r5, r9, asr #12
    a618:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    a61c:	745f3874 	ldrbvc	r3, [pc], #-2164	; a624 <_Min_Stack_Size+0xa224>
    a620:	31783029 	cmncc	r8, r9, lsr #32
    a624:	434c0032 	movtmi	r0, #49202	; 0xc032
    a628:	5f585f44 	svcpl	0x00585f44
    a62c:	45534552 	ldrbmi	r4, [r3, #-1362]	; 0xfffffaae
    a630:	41565f54 	cmpmi	r6, r4, asr pc
    a634:	2045554c 	subcs	r5, r5, ip, asr #10
    a638:	45530030 	ldrbmi	r0, [r3, #-48]	; 0xffffffd0
    a63c:	5f4f5652 	svcpl	0x004f5652
    a640:	75282030 	strvc	r2, [r8, #-48]!	; 0xffffffd0
    a644:	38746e69 	ldmdacc	r4!, {r0, r3, r5, r6, r9, sl, fp, sp, lr}^
    a648:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    a64c:	46002930 			; <UNDEFINED> instruction: 0x46002930
    a650:	5f52554f 	svcpl	0x0052554f
    a654:	5f544942 	svcpl	0x00544942
    a658:	45444f4d 	strbmi	r4, [r4, #-3917]	; 0xfffff0b3
    a65c:	434c0020 	movtmi	r0, #49184	; 0xc020
    a660:	4d435f44 	stclmi	15, cr5, [r3, #-272]	; 0xfffffef0
    a664:	4e455f44 	cdpmi	15, 4, cr5, cr5, cr4, {2}
    a668:	5f595254 	svcpl	0x00595254
    a66c:	5f434e49 	svcpl	0x00434e49
    a670:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    a674:	00293630 	eoreq	r3, r9, r0, lsr r6
    a678:	535f375f 	cmppl	pc, #24903680	; 0x17c0000
    a67c:	454d4745 	strbmi	r4, [sp, #-1861]	; 0xfffff8bb
    a680:	545f544e 	ldrbpl	r5, [pc], #-1102	; a688 <_Min_Stack_Size+0xa288>
    a684:	28204f57 	stmdacs	r0!, {r0, r1, r2, r4, r6, r8, r9, sl, fp, lr}
    a688:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    a68c:	29745f38 	ldmdbcs	r4!, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    a690:	34327830 	ldrtcc	r7, [r2], #-2096	; 0xfffff7d0
    a694:	5f375f00 	svcpl	0x00375f00
    a698:	4d474553 	cfstr64mi	mvdx4, [r7, #-332]	; 0xfffffeb4
    a69c:	5f544e45 	svcpl	0x00544e45
    a6a0:	45564553 	ldrbmi	r4, [r6, #-1363]	; 0xfffffaad
    a6a4:	7528204e 	strvc	r2, [r8, #-78]!	; 0xffffffb2
    a6a8:	38746e69 	ldmdacc	r4!, {r0, r3, r5, r6, r9, sl, fp, sp, lr}^
    a6ac:	3029745f 	eorcc	r7, r9, pc, asr r4
    a6b0:	00383778 	eorseq	r3, r8, r8, ror r7
    a6b4:	56524553 			; <UNDEFINED> instruction: 0x56524553
    a6b8:	35345f4f 	ldrcc	r5, [r4, #-3919]!	; 0xfffff0b1
    a6bc:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    a6c0:	5f38746e 	svcpl	0x0038746e
    a6c4:	34282974 	strtcc	r2, [r8], #-2420	; 0xfffff68c
    a6c8:	56002935 			; <UNDEFINED> instruction: 0x56002935
    a6cc:	495f4c41 	ldmdbmi	pc, {r0, r6, sl, fp, lr}^	; <UNPREDICTABLE>
    a6d0:	00525350 	subseq	r5, r2, r0, asr r3
    a6d4:	5f44434c 	svcpl	0x0044434c
    a6d8:	5f444d43 	svcpl	0x00444d43
    a6dc:	52544e45 	subspl	r4, r4, #1104	; 0x450
    a6e0:	4e495f59 	mcrmi	15, 2, r5, cr9, cr9, {2}
    a6e4:	48535f43 	ldmdami	r3, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    a6e8:	20544649 	subscs	r4, r4, r9, asr #12
    a6ec:	30783028 	rsbscc	r3, r8, r8, lsr #32
    a6f0:	49002937 	stmdbmi	r0, {r0, r1, r2, r4, r5, r8, fp, sp}
    a6f4:	455f434e 	ldrbmi	r4, [pc, #-846]	; a3ae <_Min_Stack_Size+0x9fae>
    a6f8:	4f525045 	svcmi	0x00525045
    a6fc:	5f485f4d 	svcpl	0x00485f4d
    a700:	434c0020 	movtmi	r0, #49184	; 0xc020
    a704:	37445f44 	strbcc	r5, [r4, -r4, asr #30]
    a708:	524f505f 	subpl	r5, pc, #95	; 0x5f
    a70c:	50472054 	subpl	r2, r7, r4, asr r0
    a710:	00424f49 	subeq	r4, r2, r9, asr #30
    a714:	5059454b 	subspl	r4, r9, fp, asr #10
    a718:	435f4441 	cmpmi	pc, #1090519040	; 0x41000000
    a71c:	4f505f30 	svcmi	0x00505f30
    a720:	47205452 			; <UNDEFINED> instruction: 0x47205452
    a724:	414f4950 	cmpmi	pc, r0, asr r9	; <UNPREDICTABLE>
    a728:	44434c00 	strbmi	r4, [r3], #-3072	; 0xfffff400
    a72c:	444d435f 	strbmi	r4, [sp], #-863	; 0xfffffca1
    a730:	4e55465f 	mrcmi	6, 2, r4, cr5, cr15, {2}
    a734:	4f495443 	svcmi	0x00495443
    a738:	42385f4e 	eorsmi	r5, r8, #312	; 0x138
    a73c:	325f5449 	subscc	r5, pc, #1224736768	; 0x49000000
    a740:	454e494c 	strbmi	r4, [lr, #-2380]	; 0xfffff6b4
    a744:	30282053 	eorcc	r2, r8, r3, asr r0
    a748:	29383378 	ldmdbcs	r8!, {r3, r4, r5, r6, r8, r9, ip, sp}
    a74c:	44434c00 	strbmi	r4, [r3], #-3072	; 0xfffff400
    a750:	5f53525f 	svcpl	0x0053525f
    a754:	204e4950 	subcs	r4, lr, r0, asr r9
    a758:	4f495047 	svcmi	0x00495047
    a75c:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a760:	5f00335f 	svcpl	0x0000335f
    a764:	45535f37 	ldrbmi	r5, [r3, #-3895]	; 0xfffff0c9
    a768:	4e454d47 	cdpmi	13, 4, cr4, cr5, cr7, {2}
    a76c:	4e4f5f54 	mcrmi	15, 2, r5, cr15, cr4, {2}
    a770:	75282045 	strvc	r2, [r8, #-69]!	; 0xffffffbb
    a774:	38746e69 	ldmdacc	r4!, {r0, r3, r5, r6, r9, sl, fp, sp, lr}^
    a778:	3029745f 	eorcc	r7, r9, pc, asr r4
    a77c:	00393778 	eorseq	r3, r9, r8, ror r7
    a780:	5f44434c 	svcpl	0x0044434c
    a784:	5f444d43 	svcpl	0x00444d43
    a788:	45564f4d 	ldrbmi	r4, [r6, #-3917]	; 0xfffff0b3
    a78c:	5255435f 	subspl	r4, r5, #2080374785	; 0x7c000001
    a790:	5f524f53 	svcpl	0x00524f53
    a794:	48474952 	stmdami	r7, {r1, r4, r6, r8, fp, lr}^
    a798:	30282054 	eorcc	r2, r8, r4, asr r0
    a79c:	29343178 	ldmdbcs	r4!, {r3, r4, r5, r6, r8, ip, sp}
    a7a0:	59454b00 	stmdbpl	r5, {r8, r9, fp, lr}^
    a7a4:	5f444150 	svcpl	0x00444150
    a7a8:	505f3352 	subspl	r3, pc, r2, asr r3	; <UNPREDICTABLE>
    a7ac:	47204e49 	strmi	r4, [r0, -r9, asr #28]!
    a7b0:	5f4f4950 	svcpl	0x004f4950
    a7b4:	5f4e4950 	svcpl	0x004e4950
    a7b8:	375f0033 	smmlarcc	pc, r3, r0, r0	; <UNPREDICTABLE>
    a7bc:	4745535f 	smlsldmi	r5, r5, pc, r3	; <UNPREDICTABLE>
    a7c0:	544e454d 	strbpl	r4, [lr], #-1357	; 0xfffffab3
    a7c4:	505f425f 	subspl	r4, pc, pc, asr r2	; <UNPREDICTABLE>
    a7c8:	2054524f 	subscs	r5, r4, pc, asr #4
    a7cc:	4f495047 	svcmi	0x00495047
    a7d0:	434c0042 	movtmi	r0, #49218	; 0xc042
    a7d4:	34445f44 	strbcc	r5, [r4], #-3908	; 0xfffff0bc
    a7d8:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a7dc:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
    a7e0:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    a7e4:	00355f4e 	eorseq	r5, r5, lr, asr #30
    a7e8:	535f375f 	cmppl	pc, #24903680	; 0x17c0000
    a7ec:	454d4745 	strbmi	r4, [sp, #-1861]	; 0xfffff8bb
    a7f0:	425f544e 	subsmi	r5, pc, #1308622848	; 0x4e000000
    a7f4:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a7f8:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
    a7fc:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    a800:	30315f4e 	eorscc	r5, r1, lr, asr #30
    a804:	69616d00 	stmdbvs	r1!, {r8, sl, fp, sp, lr}^
    a808:	434c006e 	movtmi	r0, #49262	; 0xc06e
    a80c:	5f595f44 	svcpl	0x00595f44
    a810:	45534552 	ldrbmi	r4, [r3, #-1362]	; 0xfffffaae
    a814:	41565f54 	cmpmi	r6, r4, asr pc
    a818:	2045554c 	subcs	r5, r5, ip, asr #10
    a81c:	454b0031 	strbmi	r0, [fp, #-49]	; 0xffffffcf
    a820:	44415059 	strbmi	r5, [r1], #-89	; 0xffffffa7
    a824:	5f30525f 	svcpl	0x0030525f
    a828:	204e4950 	subcs	r4, lr, r0, asr r9
    a82c:	4f495047 	svcmi	0x00495047
    a830:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a834:	5f00305f 	svcpl	0x0000305f
    a838:	45535f37 	ldrbmi	r5, [r3, #-3895]	; 0xfffff0c9
    a83c:	4e454d47 	cdpmi	13, 4, cr4, cr5, cr7, {2}
    a840:	5f415f54 	svcpl	0x00415f54
    a844:	54524f50 	ldrbpl	r4, [r2], #-3920	; 0xfffff0b0
    a848:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
    a84c:	5f00424f 	svcpl	0x0000424f
    a850:	45535f37 	ldrbmi	r5, [r3, #-3895]	; 0xfffff0c9
    a854:	4e454d47 	cdpmi	13, 4, cr4, cr5, cr7, {2}
    a858:	4f465f54 	svcmi	0x00465f54
    a85c:	28205255 	stmdacs	r0!, {r0, r2, r4, r6, r9, ip, lr}
    a860:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    a864:	29745f38 	ldmdbcs	r4!, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    a868:	39317830 	ldmdbcc	r1!, {r4, r5, fp, ip, sp, lr}
    a86c:	44434c00 	strbmi	r4, [r3], #-3072	; 0xfffff400
    a870:	5f35445f 	svcpl	0x0035445f
    a874:	54524f50 	ldrbpl	r4, [r2], #-3920	; 0xfffff0b0
    a878:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
    a87c:	5600414f 	strpl	r4, [r0], -pc, asr #2
    a880:	435f4c41 	cmpmi	pc, #16640	; 0x4100
    a884:	52544e4f 	subspl	r4, r4, #1264	; 0x4f0
    a888:	5f004c4f 	svcpl	0x00004c4f
    a88c:	45535f37 	ldrbmi	r5, [r3, #-3895]	; 0xfffff0c9
    a890:	4e454d47 	cdpmi	13, 4, cr4, cr5, cr7, {2}
    a894:	5f475f54 	svcpl	0x00475f54
    a898:	54524f50 	ldrbpl	r4, [r2], #-3920	; 0xfffff0b0
    a89c:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
    a8a0:	4b00424f 	blmi	1b1e4 <_Min_Stack_Size+0x1ade4>
    a8a4:	41505945 	cmpmi	r0, r5, asr #18
    a8a8:	33435f44 	movtcc	r5, #16196	; 0x3f44
    a8ac:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    a8b0:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
    a8b4:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    a8b8:	00375f4e 	eorseq	r5, r7, lr, asr #30
    a8bc:	5f44434c 	svcpl	0x0044434c
    a8c0:	5f444d43 	svcpl	0x00444d43
    a8c4:	50534944 	subspl	r4, r3, r4, asr #18
    a8c8:	5f4e4f5f 	svcpl	0x004e4f5f
    a8cc:	53525543 	cmppl	r2, #281018368	; 0x10c00000
    a8d0:	425f524f 	subsmi	r5, pc, #-268435452	; 0xf0000004
    a8d4:	4b4e494c 	blmi	139ce0c <_Min_Stack_Size+0x139ca0c>
    a8d8:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    a8dc:	00294630 	eoreq	r4, r9, r0, lsr r6
    a8e0:	5059454b 	subspl	r4, r9, fp, asr #10
    a8e4:	525f4441 	subspl	r4, pc, #1090519040	; 0x41000000
    a8e8:	49505f32 	ldmdbmi	r0, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    a8ec:	5047204e 	subpl	r2, r7, lr, asr #32
    a8f0:	505f4f49 	subspl	r4, pc, r9, asr #30
    a8f4:	325f4e49 	subscc	r4, pc, #1168	; 0x490
    a8f8:	59454b00 	stmdbpl	r5, {r8, r9, fp, lr}^
    a8fc:	5f444150 	svcpl	0x00444150
    a900:	505f3152 	subspl	r3, pc, r2, asr r1	; <UNPREDICTABLE>
    a904:	2054524f 	subscs	r5, r4, pc, asr #4
    a908:	4f495047 	svcmi	0x00495047
    a90c:	434c0041 	movtmi	r0, #49217	; 0xc041
    a910:	34445f44 	strbcc	r5, [r4], #-3908	; 0xfffff0bc
    a914:	524f505f 	subpl	r5, pc, #95	; 0x5f
    a918:	50472054 	subpl	r2, r7, r4, asr r0
    a91c:	00414f49 	subeq	r4, r1, r9, asr #30
    a920:	535f375f 	cmppl	pc, #24903680	; 0x17c0000
    a924:	454d4745 	strbmi	r4, [sp, #-1861]	; 0xfffff8bb
    a928:	535f544e 	cmppl	pc, #1308622848	; 0x4e000000
    a92c:	28205849 	stmdacs	r0!, {r0, r3, r6, fp, ip, lr}
    a930:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    a934:	29745f38 	ldmdbcs	r4!, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    a938:	32307830 	eorscc	r7, r0, #48, 16	; 0x300000
    a93c:	44434c00 	strbmi	r4, [r3], #-3072	; 0xfffff400
    a940:	444d435f 	strbmi	r4, [sp], #-863	; 0xfffffca1
    a944:	5349445f 	movtpl	r4, #37983	; 0x945f
    a948:	4e4f5f50 	mcrmi	15, 2, r5, cr15, cr0, {2}
    a94c:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    a950:	00294330 	eoreq	r4, r9, r0, lsr r3
    a954:	5059454b 	subspl	r4, r9, fp, asr #10
    a958:	525f4441 	subspl	r4, pc, #1090519040	; 0x41000000
    a95c:	4f505f32 	svcmi	0x00505f32
    a960:	47205452 			; <UNDEFINED> instruction: 0x47205452
    a964:	414f4950 	cmpmi	pc, r0, asr r9	; <UNPREDICTABLE>
    a968:	5f375f00 	svcpl	0x00375f00
    a96c:	4d474553 	cfstr64mi	mvdx4, [r7, #-332]	; 0xfffffeb4
    a970:	5f544e45 	svcpl	0x00544e45
    a974:	454e494e 	strbmi	r4, [lr, #-2382]	; 0xfffff6b2
    a978:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
    a97c:	5f38746e 	svcpl	0x0038746e
    a980:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    a984:	5f003031 	svcpl	0x00003031
    a988:	45535f37 	ldrbmi	r5, [r3, #-3895]	; 0xfffff0c9
    a98c:	4e454d47 	cdpmi	13, 4, cr4, cr5, cr7, {2}
    a990:	455a5f54 	ldrbmi	r5, [sl, #-3924]	; 0xfffff0ac
    a994:	28204f52 	stmdacs	r0!, {r1, r4, r6, r8, r9, sl, fp, lr}
    a998:	746e6975 	strbtvc	r6, [lr], #-2421	; 0xfffff68b
    a99c:	29745f38 	ldmdbcs	r4!, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    a9a0:	30347830 	eorscc	r7, r4, r0, lsr r8
    a9a4:	44434c00 	strbmi	r4, [r3], #-3072	; 0xfffff400
    a9a8:	444d435f 	strbmi	r4, [sp], #-863	; 0xfffffca1
    a9ac:	4745425f 	smlsldmi	r4, r5, pc, r2	; <UNPREDICTABLE>
    a9b0:	415f4e49 	cmpmi	pc, r9, asr #28
    a9b4:	49465f54 	stmdbmi	r6, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    a9b8:	5f545352 	svcpl	0x00545352
    a9bc:	20574f52 	subscs	r4, r7, r2, asr pc
    a9c0:	38783028 	ldmdacc	r8!, {r3, r5, ip, sp}^
    a9c4:	2e002930 			; <UNDEFINED> instruction: 0x2e002930
    a9c8:	74532f2e 	ldrbvc	r2, [r3], #-3886	; 0xfffff0d2
    a9cc:	75747261 	ldrbvc	r7, [r4, #-609]!	; 0xfffffd9f
    a9d0:	74732f70 	ldrbtvc	r2, [r3], #-3952	; 0xfffff090
    a9d4:	75747261 	ldrbvc	r7, [r4, #-609]!	; 0xfffffd9f
    a9d8:	74735f70 	ldrbtvc	r5, [r3], #-3952	; 0xfffff090
    a9dc:	6632336d 	ldrtvs	r3, [r2], -sp, ror #6
    a9e0:	63333031 	teqvs	r3, #49	; 0x31
    a9e4:	2e787438 	mrccs	4, 3, r7, cr8, cr8, {1}
    a9e8:	4e470073 	mcrmi	0, 2, r0, cr7, cr3, {3}
    a9ec:	53412055 	movtpl	r2, #4181	; 0x1055
    a9f0:	332e3220 			; <UNDEFINED> instruction: 0x332e3220
    a9f4:	00302e30 	eorseq	r2, r0, r0, lsr lr

Disassembly of section .comment:

00000000 <.comment>:
   0:	3a434347 	bcc	10d0d24 <_Min_Stack_Size+0x10d0924>
   4:	4e472820 	cdpmi	8, 4, cr2, cr7, cr0, {1}
   8:	6f542055 	svcvs	0x00542055
   c:	20736c6f 	rsbscs	r6, r3, pc, ror #24
  10:	20726f66 	rsbscs	r6, r2, r6, ror #30
  14:	334d5453 	movtcc	r5, #54355	; 0xd453
  18:	2d372032 	ldccs	0, cr2, [r7, #-200]!	; 0xffffff38
  1c:	38313032 	ldmdacc	r1!, {r1, r4, r5, ip, sp}
  20:	2d32712d 	ldfcss	f7, [r2, #-180]!	; 0xffffff4c
  24:	61647075 	smcvs	18181	; 0x4705
  28:	322e6574 	eorcc	r6, lr, #116, 10	; 0x1d000000
  2c:	30393130 	eorscc	r3, r9, r0, lsr r1
  30:	2d383233 	lfmcs	f3, 4, [r8, #-204]!	; 0xffffff34
  34:	30303831 	eorscc	r3, r0, r1, lsr r8
  38:	2e372029 	cdpcs	0, 3, cr2, cr7, cr9, {1}
  3c:	20312e33 	eorscs	r2, r1, r3, lsr lr
  40:	38313032 	ldmdacc	r1!, {r1, r4, r5, ip, sp}
  44:	32323630 	eorscc	r3, r2, #48, 12	; 0x3000000
  48:	65722820 	ldrbvs	r2, [r2, #-2080]!	; 0xfffff7e0
  4c:	7361656c 	cmnvc	r1, #108, 10	; 0x1b000000
  50:	5b202965 	blpl	80a5ec <_Min_Stack_Size+0x80a1ec>
  54:	2f4d5241 	svccs	0x004d5241
  58:	65626d65 	strbvs	r6, [r2, #-3429]!	; 0xfffff29b
  5c:	64656464 	strbtvs	r6, [r5], #-1124	; 0xfffffb9c
  60:	622d372d 	eorvs	r3, sp, #11796480	; 0xb40000
  64:	636e6172 	cmnvs	lr, #-2147483620	; 0x8000001c
  68:	65722068 	ldrbvs	r2, [r2, #-104]!	; 0xffffff98
  6c:	69736976 	ldmdbvs	r3!, {r1, r2, r4, r5, r6, r8, fp, sp, lr}^
  70:	32206e6f 	eorcc	r6, r0, #1776	; 0x6f0
  74:	30393136 	eorscc	r3, r9, r6, lsr r1
  78:	Address 0x0000000000000078 is out of bounds.


Disassembly of section .debug_frame:

