mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
00000000 <.debug_frame>:
   0:	0000000c 	andeq	r0, r0, ip
   4:	ffffffff 			; <UNDEFINED> instruction: 0xffffffff
   8:	7c020001 	stcvc	0, cr0, [r2], {1}
   c:	000d0c0e 	andeq	r0, sp, lr, lsl #24
  10:	00000024 	andeq	r0, r0, r4, lsr #32
  14:	00000000 	andeq	r0, r0, r0
  18:	08000170 	stmdaeq	r0, {r4, r5, r6, r8}
  1c:	000000cc 	andeq	r0, r0, ip, asr #1
  20:	87040e41 	strhi	r0, [r4, -r1, asr #28]
  24:	100e4101 	andne	r4, lr, r1, lsl #2
  28:	02070d41 	andeq	r0, r7, #4160	; 0x1040
  2c:	41040e5c 	tstmi	r4, ip, asr lr
  30:	c7410d0d 	strbgt	r0, [r1, -sp, lsl #26]
  34:	0000000e 	andeq	r0, r0, lr
  38:	00000024 	andeq	r0, r0, r4, lsr #32
  3c:	00000000 	andeq	r0, r0, r0
  40:	0800023c 	stmdaeq	r0, {r2, r3, r4, r5, r9}
  44:	000000cc 	andeq	r0, r0, ip, asr #1
  48:	87040e41 	strhi	r0, [r4, -r1, asr #28]
  4c:	100e4101 	andne	r4, lr, r1, lsl #2
  50:	02070d41 	andeq	r0, r7, #4160	; 0x1040
  54:	41040e5c 	tstmi	r4, ip, asr lr
  58:	c7410d0d 	strbgt	r0, [r1, -sp, lsl #26]
  5c:	0000000e 	andeq	r0, r0, lr
  60:	00000024 	andeq	r0, r0, r4, lsr #32
  64:	00000000 	andeq	r0, r0, r0
  68:	08000308 	stmdaeq	r0, {r3, r8, r9}
  6c:	0000007c 	andeq	r0, r0, ip, ror r0
  70:	87040e41 	strhi	r0, [r4, -r1, asr #28]
  74:	180e4101 	stmdane	lr, {r0, r8, lr}
  78:	78070d41 	stmdavc	r7, {r0, r6, r8, sl, fp}
  7c:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
  80:	0ec7410d 	poleqs	f4, f7, #5.0
  84:	00000000 	andeq	r0, r0, r0
  88:	00000020 	andeq	r0, r0, r0, lsr #32
  8c:	00000000 	andeq	r0, r0, r0
  90:	08000384 	stmdaeq	r0, {r2, r7, r8, r9}
  94:	000001d0 	ldrdeq	r0, [r0], -r0	; <UNPREDICTABLE>
  98:	87080e41 	strhi	r0, [r8, -r1, asr #28]
  9c:	41018e02 	tstmi	r1, r2, lsl #28
  a0:	0d41180e 	stcleq	8, cr1, [r1, #-56]	; 0xffffffc8
  a4:	0ed30207 	cdpeq	2, 13, cr0, cr3, cr7, {0}
  a8:	0d0d4108 	stfeqs	f4, [sp, #-32]	; 0xffffffe0
  ac:	0000001c 	andeq	r0, r0, ip, lsl r0
	...
  b8:	00000094 	muleq	r0, r4, r0
  bc:	87040e41 	strhi	r0, [r4, -r1, asr #28]
  c0:	070d4101 	streq	r4, [sp, -r1, lsl #2]
  c4:	410d0d7f 	tstmi	sp, pc, ror sp
  c8:	00000ec7 	andeq	r0, r0, r7, asr #29
  cc:	00000018 	andeq	r0, r0, r8, lsl r0
  d0:	00000000 	andeq	r0, r0, r0
  d4:	08000554 	stmdaeq	r0, {r2, r4, r6, r8, sl}
  d8:	00000024 	andeq	r0, r0, r4, lsr #32
  dc:	87080e41 	strhi	r0, [r8, -r1, asr #28]
  e0:	41018e02 	tstmi	r1, r2, lsl #28
  e4:	0000070d 	andeq	r0, r0, sp, lsl #14
  e8:	00000018 	andeq	r0, r0, r8, lsl r0
  ec:	00000000 	andeq	r0, r0, r0
  f0:	08000578 	stmdaeq	r0, {r3, r4, r5, r6, r8, sl}
  f4:	00000024 	andeq	r0, r0, r4, lsr #32
  f8:	87080e41 	strhi	r0, [r8, -r1, asr #28]
  fc:	41018e02 	tstmi	r1, r2, lsl #28
 100:	0000070d 	andeq	r0, r0, sp, lsl #14
 104:	00000018 	andeq	r0, r0, r8, lsl r0
 108:	00000000 	andeq	r0, r0, r0
 10c:	0800059c 	stmdaeq	r0, {r2, r3, r4, r7, r8, sl}
 110:	00000024 	andeq	r0, r0, r4, lsr #32
 114:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 118:	41018e02 	tstmi	r1, r2, lsl #28
 11c:	0000070d 	andeq	r0, r0, sp, lsl #14
 120:	00000018 	andeq	r0, r0, r8, lsl r0
 124:	00000000 	andeq	r0, r0, r0
 128:	080005c0 	stmdaeq	r0, {r6, r7, r8, sl}
 12c:	00000024 	andeq	r0, r0, r4, lsr #32
 130:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 134:	41018e02 	tstmi	r1, r2, lsl #28
 138:	0000070d 	andeq	r0, r0, sp, lsl #14
 13c:	00000018 	andeq	r0, r0, r8, lsl r0
 140:	00000000 	andeq	r0, r0, r0
 144:	080005e4 	stmdaeq	r0, {r2, r5, r6, r7, r8, sl}
 148:	00000024 	andeq	r0, r0, r4, lsr #32
 14c:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 150:	41018e02 	tstmi	r1, r2, lsl #28
 154:	0000070d 	andeq	r0, r0, sp, lsl #14
 158:	00000018 	andeq	r0, r0, r8, lsl r0
 15c:	00000000 	andeq	r0, r0, r0
 160:	08000608 	stmdaeq	r0, {r3, r9, sl}
 164:	000000a8 	andeq	r0, r0, r8, lsr #1
 168:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 16c:	41018e02 	tstmi	r1, r2, lsl #28
 170:	0000070d 	andeq	r0, r0, sp, lsl #14
 174:	00000018 	andeq	r0, r0, r8, lsl r0
 178:	00000000 	andeq	r0, r0, r0
 17c:	080006b0 	stmdaeq	r0, {r4, r5, r7, r9, sl}
 180:	000000a8 	andeq	r0, r0, r8, lsr #1
 184:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 188:	41018e02 	tstmi	r1, r2, lsl #28
 18c:	0000070d 	andeq	r0, r0, sp, lsl #14
 190:	0000000c 	andeq	r0, r0, ip
 194:	ffffffff 			; <UNDEFINED> instruction: 0xffffffff
 198:	7c020001 	stcvc	0, cr0, [r2], {1}
 19c:	000d0c0e 	andeq	r0, sp, lr, lsl #24
 1a0:	00000024 	andeq	r0, r0, r4, lsr #32
 1a4:	00000190 	muleq	r0, r0, r1
 1a8:	08000758 	stmdaeq	r0, {r3, r4, r6, r8, r9, sl}
 1ac:	000000c6 	andeq	r0, r0, r6, asr #1
 1b0:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 1b4:	100e4101 	andne	r4, lr, r1, lsl #2
 1b8:	02070d41 	andeq	r0, r7, #4160	; 0x1040
 1bc:	41040e5d 	tstmi	r4, sp, asr lr
 1c0:	c7410d0d 	strbgt	r0, [r1, -sp, lsl #26]
 1c4:	0000000e 	andeq	r0, r0, lr
 1c8:	00000024 	andeq	r0, r0, r4, lsr #32
 1cc:	00000190 	muleq	r0, r0, r1
 1d0:	08000820 	stmdaeq	r0, {r5, fp}
 1d4:	0000021c 	andeq	r0, r0, ip, lsl r2
 1d8:	840c0e41 	strhi	r0, [ip], #-3649	; 0xfffff1bf
 1dc:	8e028703 	cdphi	7, 0, cr8, cr2, cr3, {0}
 1e0:	200e4101 	andcs	r4, lr, r1, lsl #2
 1e4:	02070d41 	andeq	r0, r7, #4160	; 0x1040
 1e8:	410c0efa 	strdmi	r0, [ip, -sl]
 1ec:	00000d0d 	andeq	r0, r0, sp, lsl #26
 1f0:	00000024 	andeq	r0, r0, r4, lsr #32
 1f4:	00000190 	muleq	r0, r0, r1
 1f8:	00000000 	andeq	r0, r0, r0
 1fc:	000000c8 	andeq	r0, r0, r8, asr #1
 200:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 204:	100e4101 	andne	r4, lr, r1, lsl #2
 208:	02070d41 	andeq	r0, r7, #4160	; 0x1040
 20c:	41040e53 	tstmi	r4, r3, asr lr
 210:	c7410d0d 	strbgt	r0, [r1, -sp, lsl #26]
 214:	0000000e 	andeq	r0, r0, lr
 218:	00000024 	andeq	r0, r0, r4, lsr #32
 21c:	00000190 	muleq	r0, r0, r1
 220:	00000000 	andeq	r0, r0, r0
 224:	00000028 	andeq	r0, r0, r8, lsr #32
 228:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 22c:	100e4101 	andne	r4, lr, r1, lsl #2
 230:	4e070d41 	cdpmi	13, 0, cr0, cr7, cr1, {2}
 234:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 238:	0ec7410d 	poleqs	f4, f7, #5.0
 23c:	00000000 	andeq	r0, r0, r0
 240:	00000024 	andeq	r0, r0, r4, lsr #32
 244:	00000190 	muleq	r0, r0, r1
 248:	00000000 	andeq	r0, r0, r0
 24c:	00000018 	andeq	r0, r0, r8, lsl r0
 250:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 254:	100e4101 	andne	r4, lr, r1, lsl #2
 258:	46070d41 	strmi	r0, [r7], -r1, asr #26
 25c:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 260:	0ec7410d 	poleqs	f4, f7, #5.0
 264:	00000000 	andeq	r0, r0, r0
 268:	00000024 	andeq	r0, r0, r4, lsr #32
 26c:	00000190 	muleq	r0, r0, r1
 270:	00000000 	andeq	r0, r0, r0
 274:	00000032 	andeq	r0, r0, r2, lsr r0
 278:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 27c:	100e4101 	andne	r4, lr, r1, lsl #2
 280:	53070d41 	movwpl	r0, #32065	; 0x7d41
 284:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 288:	0ec7410d 	poleqs	f4, f7, #5.0
 28c:	00000000 	andeq	r0, r0, r0
 290:	00000024 	andeq	r0, r0, r4, lsr #32
 294:	00000190 	muleq	r0, r0, r1
 298:	00000000 	andeq	r0, r0, r0
 29c:	0000001c 	andeq	r0, r0, ip, lsl r0
 2a0:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 2a4:	100e4101 	andne	r4, lr, r1, lsl #2
 2a8:	48070d41 	stmdami	r7, {r0, r6, r8, sl, fp}
 2ac:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 2b0:	0ec7410d 	poleqs	f4, f7, #5.0
 2b4:	00000000 	andeq	r0, r0, r0
 2b8:	00000024 	andeq	r0, r0, r4, lsr #32
 2bc:	00000190 	muleq	r0, r0, r1
 2c0:	00000000 	andeq	r0, r0, r0
 2c4:	00000026 	andeq	r0, r0, r6, lsr #32
 2c8:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 2cc:	100e4101 	andne	r4, lr, r1, lsl #2
 2d0:	4d070d41 	stcmi	13, cr0, [r7, #-260]	; 0xfffffefc
 2d4:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 2d8:	0ec7410d 	poleqs	f4, f7, #5.0
 2dc:	00000000 	andeq	r0, r0, r0
 2e0:	00000024 	andeq	r0, r0, r4, lsr #32
 2e4:	00000190 	muleq	r0, r0, r1
 2e8:	00000000 	andeq	r0, r0, r0
 2ec:	00000070 	andeq	r0, r0, r0, ror r0
 2f0:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 2f4:	100e4101 	andne	r4, lr, r1, lsl #2
 2f8:	72070d41 	andvc	r0, r7, #4160	; 0x1040
 2fc:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 300:	0ec7410d 	poleqs	f4, f7, #5.0
 304:	00000000 	andeq	r0, r0, r0
 308:	0000000c 	andeq	r0, r0, ip
 30c:	ffffffff 			; <UNDEFINED> instruction: 0xffffffff
 310:	7c020001 	stcvc	0, cr0, [r2], {1}
 314:	000d0c0e 	andeq	r0, sp, lr, lsl #24
 318:	00000028 	andeq	r0, r0, r8, lsr #32
 31c:	00000308 	andeq	r0, r0, r8, lsl #6
 320:	00000000 	andeq	r0, r0, r0
 324:	000004a4 	andeq	r0, r0, r4, lsr #9
 328:	84080e41 	strhi	r0, [r8], #-3649	; 0xfffff1bf
 32c:	41018702 	tstmi	r1, r2, lsl #14
 330:	0d41280e 	stcleq	8, cr2, [r1, #-56]	; 0xffffffc8
 334:	02440307 	subeq	r0, r4, #469762048	; 0x1c000000
 338:	0d41080e 	stcleq	8, cr0, [r1, #-56]	; 0xffffffc8
 33c:	c4c7410d 	strbgt	r4, [r7], #269	; 0x10d
 340:	0000000e 	andeq	r0, r0, lr
 344:	00000024 	andeq	r0, r0, r4, lsr #32
 348:	00000308 	andeq	r0, r0, r8, lsl #6
 34c:	00000000 	andeq	r0, r0, r0
 350:	00000088 	andeq	r0, r0, r8, lsl #1
 354:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 358:	100e4101 	andne	r4, lr, r1, lsl #2
 35c:	78070d41 	stmdavc	r7, {r0, r6, r8, sl, fp}
 360:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 364:	0ec7410d 	poleqs	f4, f7, #5.0
 368:	00000000 	andeq	r0, r0, r0
 36c:	00000024 	andeq	r0, r0, r4, lsr #32
 370:	00000308 	andeq	r0, r0, r8, lsl #6
 374:	00000000 	andeq	r0, r0, r0
 378:	00000348 	andeq	r0, r0, r8, asr #6
 37c:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 380:	41018e02 	tstmi	r1, r2, lsl #28
 384:	4101a80e 	tstmi	r1, lr, lsl #16
 388:	7803070d 	stmdavc	r3, {r0, r2, r3, r8, r9, sl}
 38c:	41080e01 	tstmi	r8, r1, lsl #28
 390:	00000d0d 	andeq	r0, r0, sp, lsl #26
 394:	00000024 	andeq	r0, r0, r4, lsr #32
 398:	00000308 	andeq	r0, r0, r8, lsl #6
 39c:	00000000 	andeq	r0, r0, r0
 3a0:	0000001e 	andeq	r0, r0, lr, lsl r0
 3a4:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 3a8:	100e4101 	andne	r4, lr, r1, lsl #2
 3ac:	49070d41 	stmdbmi	r7, {r0, r6, r8, sl, fp}
 3b0:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 3b4:	0ec7410d 	poleqs	f4, f7, #5.0
 3b8:	00000000 	andeq	r0, r0, r0
 3bc:	00000024 	andeq	r0, r0, r4, lsr #32
 3c0:	00000308 	andeq	r0, r0, r8, lsl #6
 3c4:	00000000 	andeq	r0, r0, r0
 3c8:	0000001e 	andeq	r0, r0, lr, lsl r0
 3cc:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 3d0:	100e4101 	andne	r4, lr, r1, lsl #2
 3d4:	49070d41 	stmdbmi	r7, {r0, r6, r8, sl, fp}
 3d8:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 3dc:	0ec7410d 	poleqs	f4, f7, #5.0
 3e0:	00000000 	andeq	r0, r0, r0
 3e4:	00000024 	andeq	r0, r0, r4, lsr #32
 3e8:	00000308 	andeq	r0, r0, r8, lsl #6
 3ec:	00000000 	andeq	r0, r0, r0
 3f0:	0000001c 	andeq	r0, r0, ip, lsl r0
 3f4:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 3f8:	100e4101 	andne	r4, lr, r1, lsl #2
 3fc:	48070d41 	stmdami	r7, {r0, r6, r8, sl, fp}
 400:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 404:	0ec7410d 	poleqs	f4, f7, #5.0
 408:	00000000 	andeq	r0, r0, r0
 40c:	00000024 	andeq	r0, r0, r4, lsr #32
 410:	00000308 	andeq	r0, r0, r8, lsl #6
 414:	00000000 	andeq	r0, r0, r0
 418:	0000001c 	andeq	r0, r0, ip, lsl r0
 41c:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 420:	180e4101 	stmdane	lr, {r0, r8, lr}
 424:	48070d41 	stmdami	r7, {r0, r6, r8, sl, fp}
 428:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 42c:	0ec7410d 	poleqs	f4, f7, #5.0
 430:	00000000 	andeq	r0, r0, r0
 434:	00000024 	andeq	r0, r0, r4, lsr #32
 438:	00000308 	andeq	r0, r0, r8, lsl #6
 43c:	00000000 	andeq	r0, r0, r0
 440:	00000020 	andeq	r0, r0, r0, lsr #32
 444:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 448:	100e4101 	andne	r4, lr, r1, lsl #2
 44c:	4a070d41 	bmi	1c3958 <_Min_Stack_Size+0x1c3558>
 450:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 454:	0ec7410d 	poleqs	f4, f7, #5.0
 458:	00000000 	andeq	r0, r0, r0
 45c:	00000024 	andeq	r0, r0, r4, lsr #32
 460:	00000308 	andeq	r0, r0, r8, lsl #6
 464:	00000000 	andeq	r0, r0, r0
 468:	00000020 	andeq	r0, r0, r0, lsr #32
 46c:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 470:	180e4101 	stmdane	lr, {r0, r8, lr}
 474:	4a070d41 	bmi	1c3980 <_Min_Stack_Size+0x1c3580>
 478:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 47c:	0ec7410d 	poleqs	f4, f7, #5.0
 480:	00000000 	andeq	r0, r0, r0
 484:	00000024 	andeq	r0, r0, r4, lsr #32
 488:	00000308 	andeq	r0, r0, r8, lsl #6
 48c:	00000000 	andeq	r0, r0, r0
 490:	00000028 	andeq	r0, r0, r8, lsr #32
 494:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 498:	100e4101 	andne	r4, lr, r1, lsl #2
 49c:	4e070d41 	cdpmi	13, 0, cr0, cr7, cr1, {2}
 4a0:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 4a4:	0ec7410d 	poleqs	f4, f7, #5.0
 4a8:	00000000 	andeq	r0, r0, r0
 4ac:	00000024 	andeq	r0, r0, r4, lsr #32
 4b0:	00000308 	andeq	r0, r0, r8, lsl #6
 4b4:	00000000 	andeq	r0, r0, r0
 4b8:	00000024 	andeq	r0, r0, r4, lsr #32
 4bc:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 4c0:	100e4101 	andne	r4, lr, r1, lsl #2
 4c4:	4c070d41 	stcmi	13, cr0, [r7], {65}	; 0x41
 4c8:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 4cc:	0ec7410d 	poleqs	f4, f7, #5.0
 4d0:	00000000 	andeq	r0, r0, r0
 4d4:	00000018 	andeq	r0, r0, r8, lsl r0
 4d8:	00000308 	andeq	r0, r0, r8, lsl #6
 4dc:	08000a3c 	stmdaeq	r0, {r2, r3, r4, r5, r9, fp}
 4e0:	00000064 	andeq	r0, r0, r4, rrx
 4e4:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 4e8:	41018e02 	tstmi	r1, r2, lsl #28
 4ec:	0000070d 	andeq	r0, r0, sp, lsl #14
 4f0:	00000018 	andeq	r0, r0, r8, lsl r0
 4f4:	00000308 	andeq	r0, r0, r8, lsl #6
 4f8:	08000aa0 	stmdaeq	r0, {r5, r7, r9, fp}
 4fc:	00000058 	andeq	r0, r0, r8, asr r0
 500:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 504:	41018e02 	tstmi	r1, r2, lsl #28
 508:	0000070d 	andeq	r0, r0, sp, lsl #14
 50c:	00000018 	andeq	r0, r0, r8, lsl r0
 510:	00000308 	andeq	r0, r0, r8, lsl #6
 514:	08000af8 	stmdaeq	r0, {r3, r4, r5, r6, r7, r9, fp}
 518:	00000058 	andeq	r0, r0, r8, asr r0
 51c:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 520:	41018e02 	tstmi	r1, r2, lsl #28
 524:	0000070d 	andeq	r0, r0, sp, lsl #14
 528:	0000000c 	andeq	r0, r0, ip
 52c:	ffffffff 			; <UNDEFINED> instruction: 0xffffffff
 530:	7c020001 	stcvc	0, cr0, [r2], {1}
 534:	000d0c0e 	andeq	r0, sp, lr, lsl #24
 538:	00000020 	andeq	r0, r0, r0, lsr #32
 53c:	00000528 	andeq	r0, r0, r8, lsr #10
 540:	00000000 	andeq	r0, r0, r0
 544:	0000006c 	andeq	r0, r0, ip, rrx
 548:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 54c:	41018e02 	tstmi	r1, r2, lsl #28
 550:	0d41200e 	stcleq	0, cr2, [r1, #-56]	; 0xffffffc8
 554:	080e6d07 	stmdaeq	lr, {r0, r1, r2, r8, sl, fp, sp, lr}
 558:	000d0d41 	andeq	r0, sp, r1, asr #26
 55c:	00000024 	andeq	r0, r0, r4, lsr #32
 560:	00000528 	andeq	r0, r0, r8, lsr #10
 564:	00000000 	andeq	r0, r0, r0
 568:	0000007c 	andeq	r0, r0, ip, ror r0
 56c:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 570:	180e4101 	stmdane	lr, {r0, r8, lr}
 574:	73070d41 	movwvc	r0, #32065	; 0x7d41
 578:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 57c:	0ec7410d 	poleqs	f4, f7, #5.0
 580:	00000000 	andeq	r0, r0, r0
 584:	00000020 	andeq	r0, r0, r0, lsr #32
 588:	00000528 	andeq	r0, r0, r8, lsr #10
 58c:	00000000 	andeq	r0, r0, r0
 590:	00000178 	andeq	r0, r0, r8, ror r1
 594:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 598:	41018e02 	tstmi	r1, r2, lsl #28
 59c:	0d41280e 	stcleq	8, cr2, [r1, #-56]	; 0xffffffc8
 5a0:	0eac0207 	cdpeq	2, 10, cr0, cr12, cr7, {0}
 5a4:	0d0d4108 	stfeqs	f4, [sp, #-32]	; 0xffffffe0
 5a8:	00000024 	andeq	r0, r0, r4, lsr #32
 5ac:	00000528 	andeq	r0, r0, r8, lsr #10
 5b0:	00000000 	andeq	r0, r0, r0
 5b4:	00000090 	muleq	r0, r0, r0
 5b8:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 5bc:	100e4101 	andne	r4, lr, r1, lsl #2
 5c0:	79070d41 	stmdbvc	r7, {r0, r6, r8, sl, fp}
 5c4:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 5c8:	0ec7410d 	poleqs	f4, f7, #5.0
 5cc:	00000000 	andeq	r0, r0, r0
 5d0:	00000020 	andeq	r0, r0, r0, lsr #32
 5d4:	00000528 	andeq	r0, r0, r8, lsr #10
 5d8:	00000000 	andeq	r0, r0, r0
 5dc:	00000218 	andeq	r0, r0, r8, lsl r2
 5e0:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 5e4:	41018e02 	tstmi	r1, r2, lsl #28
 5e8:	0d41100e 	stcleq	0, cr1, [r1, #-56]	; 0xffffffc8
 5ec:	0ef20207 	cdpeq	2, 15, cr0, cr2, cr7, {0}
 5f0:	0d0d4108 	stfeqs	f4, [sp, #-32]	; 0xffffffe0
 5f4:	00000024 	andeq	r0, r0, r4, lsr #32
 5f8:	00000528 	andeq	r0, r0, r8, lsr #10
 5fc:	00000000 	andeq	r0, r0, r0
 600:	00000064 	andeq	r0, r0, r4, rrx
 604:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 608:	180e4101 	stmdane	lr, {r0, r8, lr}
 60c:	6c070d41 	stcvs	13, cr0, [r7], {65}	; 0x41
 610:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 614:	0ec7410d 	poleqs	f4, f7, #5.0
 618:	00000000 	andeq	r0, r0, r0
 61c:	00000020 	andeq	r0, r0, r0, lsr #32
 620:	00000528 	andeq	r0, r0, r8, lsr #10
 624:	00000000 	andeq	r0, r0, r0
 628:	00000056 	andeq	r0, r0, r6, asr r0
 62c:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 630:	41018e02 	tstmi	r1, r2, lsl #28
 634:	0d41100e 	stcleq	0, cr1, [r1, #-56]	; 0xffffffc8
 638:	080e6607 	stmdaeq	lr, {r0, r1, r2, r9, sl, sp, lr}
 63c:	000d0d41 	andeq	r0, sp, r1, asr #26
 640:	00000024 	andeq	r0, r0, r4, lsr #32
 644:	00000528 	andeq	r0, r0, r8, lsr #10
 648:	00000000 	andeq	r0, r0, r0
 64c:	0000003e 	andeq	r0, r0, lr, lsr r0
 650:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 654:	100e4101 	andne	r4, lr, r1, lsl #2
 658:	59070d41 	stmdbpl	r7, {r0, r6, r8, sl, fp}
 65c:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 660:	0ec7410d 	poleqs	f4, f7, #5.0
 664:	00000000 	andeq	r0, r0, r0
 668:	00000024 	andeq	r0, r0, r4, lsr #32
 66c:	00000528 	andeq	r0, r0, r8, lsr #10
 670:	00000000 	andeq	r0, r0, r0
 674:	00000032 	andeq	r0, r0, r2, lsr r0
 678:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 67c:	100e4101 	andne	r4, lr, r1, lsl #2
 680:	53070d41 	movwpl	r0, #32065	; 0x7d41
 684:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 688:	0ec7410d 	poleqs	f4, f7, #5.0
 68c:	00000000 	andeq	r0, r0, r0
 690:	00000020 	andeq	r0, r0, r0, lsr #32
 694:	00000528 	andeq	r0, r0, r8, lsr #10
 698:	00000000 	andeq	r0, r0, r0
 69c:	00000046 	andeq	r0, r0, r6, asr #32
 6a0:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 6a4:	41018e02 	tstmi	r1, r2, lsl #28
 6a8:	0d41200e 	stcleq	0, cr2, [r1, #-56]	; 0xffffffc8
 6ac:	080e5e07 	stmdaeq	lr, {r0, r1, r2, r9, sl, fp, ip, lr}
 6b0:	000d0d41 	andeq	r0, sp, r1, asr #26
 6b4:	00000020 	andeq	r0, r0, r0, lsr #32
 6b8:	00000528 	andeq	r0, r0, r8, lsr #10
 6bc:	00000000 	andeq	r0, r0, r0
 6c0:	000000e0 	andeq	r0, r0, r0, ror #1
 6c4:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 6c8:	41018e02 	tstmi	r1, r2, lsl #28
 6cc:	0d41200e 	stcleq	0, cr2, [r1, #-56]	; 0xffffffc8
 6d0:	0e6b0207 	cdpeq	2, 6, cr0, cr11, cr7, {0}
 6d4:	0d0d4108 	stfeqs	f4, [sp, #-32]	; 0xffffffe0
 6d8:	00000020 	andeq	r0, r0, r0, lsr #32
 6dc:	00000528 	andeq	r0, r0, r8, lsr #10
 6e0:	00000000 	andeq	r0, r0, r0
 6e4:	000000ea 	andeq	r0, r0, sl, ror #1
 6e8:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 6ec:	41018e02 	tstmi	r1, r2, lsl #28
 6f0:	0d41200e 	stcleq	0, cr2, [r1, #-56]	; 0xffffffc8
 6f4:	0e700207 	cdpeq	2, 7, cr0, cr0, cr7, {0}
 6f8:	0d0d4108 	stfeqs	f4, [sp, #-32]	; 0xffffffe0
 6fc:	00000020 	andeq	r0, r0, r0, lsr #32
 700:	00000528 	andeq	r0, r0, r8, lsr #10
 704:	00000000 	andeq	r0, r0, r0
 708:	0000007e 	andeq	r0, r0, lr, ror r0
 70c:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 710:	41018e02 	tstmi	r1, r2, lsl #28
 714:	0d41200e 	stcleq	0, cr2, [r1, #-56]	; 0xffffffc8
 718:	080e7a07 	stmdaeq	lr, {r0, r1, r2, r9, fp, ip, sp, lr}
 71c:	000d0d41 	andeq	r0, sp, r1, asr #26
 720:	00000024 	andeq	r0, r0, r4, lsr #32
 724:	00000528 	andeq	r0, r0, r8, lsr #10
 728:	00000000 	andeq	r0, r0, r0
 72c:	0000001e 	andeq	r0, r0, lr, lsl r0
 730:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 734:	100e4101 	andne	r4, lr, r1, lsl #2
 738:	49070d41 	stmdbmi	r7, {r0, r6, r8, sl, fp}
 73c:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 740:	0ec7410d 	poleqs	f4, f7, #5.0
 744:	00000000 	andeq	r0, r0, r0
 748:	00000024 	andeq	r0, r0, r4, lsr #32
 74c:	00000528 	andeq	r0, r0, r8, lsr #10
 750:	00000000 	andeq	r0, r0, r0
 754:	0000001a 	andeq	r0, r0, sl, lsl r0
 758:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 75c:	100e4101 	andne	r4, lr, r1, lsl #2
 760:	47070d41 	strmi	r0, [r7, -r1, asr #26]
 764:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 768:	0ec7410d 	poleqs	f4, f7, #5.0
 76c:	00000000 	andeq	r0, r0, r0
 770:	00000024 	andeq	r0, r0, r4, lsr #32
 774:	00000528 	andeq	r0, r0, r8, lsr #10
 778:	00000000 	andeq	r0, r0, r0
 77c:	0000003e 	andeq	r0, r0, lr, lsr r0
 780:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 784:	100e4101 	andne	r4, lr, r1, lsl #2
 788:	59070d41 	stmdbpl	r7, {r0, r6, r8, sl, fp}
 78c:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 790:	0ec7410d 	poleqs	f4, f7, #5.0
 794:	00000000 	andeq	r0, r0, r0
 798:	00000020 	andeq	r0, r0, r0, lsr #32
 79c:	00000528 	andeq	r0, r0, r8, lsr #10
 7a0:	08000b50 	stmdaeq	r0, {r4, r6, r8, r9, fp}
 7a4:	000000f8 	strdeq	r0, [r0], -r8
 7a8:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 7ac:	41018e02 	tstmi	r1, r2, lsl #28
 7b0:	0d41180e 	stcleq	8, cr1, [r1, #-56]	; 0xffffffc8
 7b4:	0e730207 	cdpeq	2, 7, cr0, cr3, cr7, {0}
 7b8:	0d0d4108 	stfeqs	f4, [sp, #-32]	; 0xffffffe0
 7bc:	00000020 	andeq	r0, r0, r0, lsr #32
 7c0:	00000528 	andeq	r0, r0, r8, lsr #10
 7c4:	08000c48 	stmdaeq	r0, {r3, r6, sl, fp}
 7c8:	000000f4 	strdeq	r0, [r0], -r4
 7cc:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 7d0:	41018e02 	tstmi	r1, r2, lsl #28
 7d4:	0d41100e 	stcleq	0, cr1, [r1, #-56]	; 0xffffffc8
 7d8:	0e700207 	cdpeq	2, 7, cr0, cr0, cr7, {0}
 7dc:	0d0d4108 	stfeqs	f4, [sp, #-32]	; 0xffffffe0
 7e0:	00000020 	andeq	r0, r0, r0, lsr #32
 7e4:	00000528 	andeq	r0, r0, r8, lsr #10
 7e8:	08000d3c 	stmdaeq	r0, {r2, r3, r4, r5, r8, sl, fp}
 7ec:	000000fc 	strdeq	r0, [r0], -ip
 7f0:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 7f4:	41018e02 	tstmi	r1, r2, lsl #28
 7f8:	0d41180e 	stcleq	8, cr1, [r1, #-56]	; 0xffffffc8
 7fc:	0e730207 	cdpeq	2, 7, cr0, cr3, cr7, {0}
 800:	0d0d4108 	stfeqs	f4, [sp, #-32]	; 0xffffffe0
 804:	00000020 	andeq	r0, r0, r0, lsr #32
 808:	00000528 	andeq	r0, r0, r8, lsr #10
 80c:	08000e38 	stmdaeq	r0, {r3, r4, r5, r9, sl, fp}
 810:	000000f8 	strdeq	r0, [r0], -r8
 814:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 818:	41018e02 	tstmi	r1, r2, lsl #28
 81c:	0d41100e 	stcleq	0, cr1, [r1, #-56]	; 0xffffffc8
 820:	0e700207 	cdpeq	2, 7, cr0, cr0, cr7, {0}
 824:	0d0d4108 	stfeqs	f4, [sp, #-32]	; 0xffffffe0
 828:	0000000c 	andeq	r0, r0, ip
 82c:	ffffffff 			; <UNDEFINED> instruction: 0xffffffff
 830:	7c020001 	stcvc	0, cr0, [r2], {1}
 834:	000d0c0e 	andeq	r0, sp, lr, lsl #24
 838:	00000024 	andeq	r0, r0, r4, lsr #32
 83c:	00000828 	andeq	r0, r0, r8, lsr #16
 840:	00000000 	andeq	r0, r0, r0
 844:	00000120 	andeq	r0, r0, r0, lsr #2
 848:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 84c:	180e4101 	stmdane	lr, {r0, r8, lr}
 850:	02070d41 	andeq	r0, r7, #4160	; 0x1040
 854:	41040e81 	smlabbmi	r4, r1, lr, r0
 858:	c7410d0d 	strbgt	r0, [r1, -sp, lsl #26]
 85c:	0000000e 	andeq	r0, r0, lr
 860:	00000024 	andeq	r0, r0, r4, lsr #32
 864:	00000828 	andeq	r0, r0, r8, lsr #16
 868:	00000000 	andeq	r0, r0, r0
 86c:	00000084 	andeq	r0, r0, r4, lsl #1
 870:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 874:	100e4101 	andne	r4, lr, r1, lsl #2
 878:	73070d41 	movwvc	r0, #32065	; 0x7d41
 87c:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 880:	0ec7410d 	poleqs	f4, f7, #5.0
 884:	00000000 	andeq	r0, r0, r0
 888:	00000020 	andeq	r0, r0, r0, lsr #32
 88c:	00000828 	andeq	r0, r0, r8, lsr #16
 890:	00000000 	andeq	r0, r0, r0
 894:	000001a8 	andeq	r0, r0, r8, lsr #3
 898:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 89c:	41018e02 	tstmi	r1, r2, lsl #28
 8a0:	0d41300e 	stcleq	0, cr3, [r1, #-56]	; 0xffffffc8
 8a4:	0ec80207 	cdpeq	2, 12, cr0, cr8, cr7, {0}
 8a8:	0d0d4108 	stfeqs	f4, [sp, #-32]	; 0xffffffe0
 8ac:	00000024 	andeq	r0, r0, r4, lsr #32
 8b0:	00000828 	andeq	r0, r0, r8, lsr #16
 8b4:	00000000 	andeq	r0, r0, r0
 8b8:	00000048 	andeq	r0, r0, r8, asr #32
 8bc:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 8c0:	180e4101 	stmdane	lr, {r0, r8, lr}
 8c4:	5e070d41 	cdppl	13, 0, cr0, cr7, cr1, {2}
 8c8:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 8cc:	0ec7410d 	poleqs	f4, f7, #5.0
 8d0:	00000000 	andeq	r0, r0, r0
 8d4:	00000024 	andeq	r0, r0, r4, lsr #32
 8d8:	00000828 	andeq	r0, r0, r8, lsr #16
 8dc:	00000000 	andeq	r0, r0, r0
 8e0:	0000003a 	andeq	r0, r0, sl, lsr r0
 8e4:	87040e41 	strhi	r0, [r4, -r1, asr #28]
