mohammedhassan9748/Embedded-Diploma/ARM_CORTEX_M3_4/Section 3/Inline Assembly/Lab 6/Debug/stm32f103x8.s
 8e8:	180e4101 	stmdane	lr, {r0, r8, lr}
 8ec:	57070d41 	strpl	r0, [r7, -r1, asr #26]
 8f0:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 8f4:	0ec7410d 	poleqs	f4, f7, #5.0
 8f8:	00000000 	andeq	r0, r0, r0
 8fc:	00000020 	andeq	r0, r0, r0, lsr #32
 900:	00000828 	andeq	r0, r0, r8, lsr #16
 904:	00000000 	andeq	r0, r0, r0
 908:	0000002e 	andeq	r0, r0, lr, lsr #32
 90c:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 910:	41018e02 	tstmi	r1, r2, lsl #28
 914:	0d41180e 	stcleq	8, cr1, [r1, #-56]	; 0xffffffc8
 918:	080e5207 	stmdaeq	lr, {r0, r1, r2, r9, ip, lr}
 91c:	000d0d41 	andeq	r0, sp, r1, asr #26
 920:	00000020 	andeq	r0, r0, r0, lsr #32
 924:	00000828 	andeq	r0, r0, r8, lsr #16
 928:	00000000 	andeq	r0, r0, r0
 92c:	00000044 	andeq	r0, r0, r4, asr #32
 930:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 934:	41018e02 	tstmi	r1, r2, lsl #28
 938:	0d41180e 	stcleq	8, cr1, [r1, #-56]	; 0xffffffc8
 93c:	080e5d07 	stmdaeq	lr, {r0, r1, r2, r8, sl, fp, ip, lr}
 940:	000d0d41 	andeq	r0, sp, r1, asr #26
 944:	00000020 	andeq	r0, r0, r0, lsr #32
 948:	00000828 	andeq	r0, r0, r8, lsr #16
 94c:	00000000 	andeq	r0, r0, r0
 950:	00000056 	andeq	r0, r0, r6, asr r0
 954:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 958:	41018e02 	tstmi	r1, r2, lsl #28
 95c:	0d41180e 	stcleq	8, cr1, [r1, #-56]	; 0xffffffc8
 960:	080e6607 	stmdaeq	lr, {r0, r1, r2, r9, sl, sp, lr}
 964:	000d0d41 	andeq	r0, sp, r1, asr #26
 968:	00000018 	andeq	r0, r0, r8, lsl r0
 96c:	00000828 	andeq	r0, r0, r8, lsr #16
 970:	08000f30 	stmdaeq	r0, {r4, r5, r8, r9, sl, fp}
 974:	00000014 	andeq	r0, r0, r4, lsl r0
 978:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 97c:	41018e02 	tstmi	r1, r2, lsl #28
 980:	0000070d 	andeq	r0, r0, sp, lsl #14
 984:	00000018 	andeq	r0, r0, r8, lsl r0
 988:	00000828 	andeq	r0, r0, r8, lsr #16
 98c:	08000f44 	stmdaeq	r0, {r2, r6, r8, r9, sl, fp}
 990:	00000014 	andeq	r0, r0, r4, lsl r0
 994:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 998:	41018e02 	tstmi	r1, r2, lsl #28
 99c:	0000070d 	andeq	r0, r0, sp, lsl #14
 9a0:	0000000c 	andeq	r0, r0, ip
 9a4:	ffffffff 			; <UNDEFINED> instruction: 0xffffffff
 9a8:	7c020001 	stcvc	0, cr0, [r2], {1}
 9ac:	000d0c0e 	andeq	r0, sp, lr, lsl #24
 9b0:	00000020 	andeq	r0, r0, r0, lsr #32
 9b4:	000009a0 	andeq	r0, r0, r0, lsr #19
 9b8:	00000000 	andeq	r0, r0, r0
 9bc:	000001b8 			; <UNDEFINED> instruction: 0x000001b8
 9c0:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 9c4:	41018e02 	tstmi	r1, r2, lsl #28
 9c8:	0d41280e 	stcleq	8, cr2, [r1, #-56]	; 0xffffffc8
 9cc:	0ecb0207 	cdpeq	2, 12, cr0, cr11, cr7, {0}
 9d0:	0d0d4108 	stfeqs	f4, [sp, #-32]	; 0xffffffe0
 9d4:	00000024 	andeq	r0, r0, r4, lsr #32
 9d8:	000009a0 	andeq	r0, r0, r0, lsr #19
 9dc:	00000000 	andeq	r0, r0, r0
 9e0:	000000bc 	strheq	r0, [r0], -ip
 9e4:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 9e8:	100e4101 	andne	r4, lr, r1, lsl #2
 9ec:	02070d41 	andeq	r0, r7, #4160	; 0x1040
 9f0:	41040e4e 	tstmi	r4, lr, asr #28
 9f4:	c7410d0d 	strbgt	r0, [r1, -sp, lsl #26]
 9f8:	0000000e 	andeq	r0, r0, lr
 9fc:	00000020 	andeq	r0, r0, r0, lsr #32
 a00:	000009a0 	andeq	r0, r0, r0, lsr #19
 a04:	00000000 	andeq	r0, r0, r0
 a08:	00000214 	andeq	r0, r0, r4, lsl r2
 a0c:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 a10:	41018e02 	tstmi	r1, r2, lsl #28
 a14:	0d41700e 	stcleq	0, cr7, [r1, #-56]	; 0xffffffc8
 a18:	0ee80207 	cdpeq	2, 14, cr0, cr8, cr7, {0}
 a1c:	0d0d4108 	stfeqs	f4, [sp, #-32]	; 0xffffffe0
 a20:	00000024 	andeq	r0, r0, r4, lsr #32
 a24:	000009a0 	andeq	r0, r0, r0, lsr #19
 a28:	00000000 	andeq	r0, r0, r0
 a2c:	00000058 	andeq	r0, r0, r8, asr r0
 a30:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 a34:	180e4101 	stmdane	lr, {r0, r8, lr}
 a38:	66070d41 	strvs	r0, [r7], -r1, asr #26
 a3c:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 a40:	0ec7410d 	poleqs	f4, f7, #5.0
 a44:	00000000 	andeq	r0, r0, r0
 a48:	00000024 	andeq	r0, r0, r4, lsr #32
 a4c:	000009a0 	andeq	r0, r0, r0, lsr #19
 a50:	00000000 	andeq	r0, r0, r0
 a54:	00000092 	muleq	r0, r2, r0
 a58:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 a5c:	180e4101 	stmdane	lr, {r0, r8, lr}
 a60:	02070d41 	andeq	r0, r7, #4160	; 0x1040
 a64:	41040e43 	tstmi	r4, r3, asr #28
 a68:	c7410d0d 	strbgt	r0, [r1, -sp, lsl #26]
 a6c:	0000000e 	andeq	r0, r0, lr
 a70:	00000024 	andeq	r0, r0, r4, lsr #32
 a74:	000009a0 	andeq	r0, r0, r0, lsr #19
 a78:	00000000 	andeq	r0, r0, r0
 a7c:	00000022 	andeq	r0, r0, r2, lsr #32
 a80:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 a84:	100e4101 	andne	r4, lr, r1, lsl #2
 a88:	4b070d41 	blmi	1c3f94 <_Min_Stack_Size+0x1c3b94>
 a8c:	0d41040e 	cfstrdeq	mvd0, [r1, #-56]	; 0xffffffc8
 a90:	0ec7410d 	poleqs	f4, f7, #5.0
 a94:	00000000 	andeq	r0, r0, r0
 a98:	00000018 	andeq	r0, r0, r8, lsl r0
 a9c:	000009a0 	andeq	r0, r0, r0, lsr #19
 aa0:	08000f58 	stmdaeq	r0, {r3, r4, r6, r8, r9, sl, fp}
 aa4:	00000014 	andeq	r0, r0, r4, lsl r0
 aa8:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 aac:	41018e02 	tstmi	r1, r2, lsl #28
 ab0:	0000070d 	andeq	r0, r0, sp, lsl #14
 ab4:	00000018 	andeq	r0, r0, r8, lsl r0
 ab8:	000009a0 	andeq	r0, r0, r0, lsr #19
 abc:	08000f6c 	stmdaeq	r0, {r2, r3, r5, r6, r8, r9, sl, fp}
 ac0:	00000014 	andeq	r0, r0, r4, lsl r0
 ac4:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 ac8:	41018e02 	tstmi	r1, r2, lsl #28
 acc:	0000070d 	andeq	r0, r0, sp, lsl #14
 ad0:	00000018 	andeq	r0, r0, r8, lsl r0
 ad4:	000009a0 	andeq	r0, r0, r0, lsr #19
 ad8:	08000f80 	stmdaeq	r0, {r7, r8, r9, sl, fp}
 adc:	00000014 	andeq	r0, r0, r4, lsl r0
 ae0:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 ae4:	41018e02 	tstmi	r1, r2, lsl #28
 ae8:	0000070d 	andeq	r0, r0, sp, lsl #14
 aec:	0000000c 	andeq	r0, r0, ip
 af0:	ffffffff 			; <UNDEFINED> instruction: 0xffffffff
 af4:	7c020001 	stcvc	0, cr0, [r2], {1}
 af8:	000d0c0e 	andeq	r0, sp, lr, lsl #24
 afc:	0000001c 	andeq	r0, r0, ip, lsl r0
 b00:	00000aec 	andeq	r0, r0, ip, ror #21
 b04:	08000f94 	stmdaeq	r0, {r2, r4, r7, r8, r9, sl, fp}
 b08:	00000030 	andeq	r0, r0, r0, lsr r0
 b0c:	87040e41 	strhi	r0, [r4, -r1, asr #28]
 b10:	070d4101 	streq	r4, [sp, -r1, lsl #2]
 b14:	410d0d4f 	tstmi	sp, pc, asr #26
 b18:	00000ec7 	andeq	r0, r0, r7, asr #29
 b1c:	0000001c 	andeq	r0, r0, ip, lsl r0
 b20:	00000aec 	andeq	r0, r0, ip, ror #21
 b24:	08000fc4 	stmdaeq	r0, {r2, r6, r7, r8, r9, sl, fp}
 b28:	00000064 	andeq	r0, r0, r4, rrx
 b2c:	87080e41 	strhi	r0, [r8, -r1, asr #28]
 b30:	41018e02 	tstmi	r1, r2, lsl #28
 b34:	0d41200e 	stcleq	0, cr2, [r1, #-56]	; 0xffffffc8
 b38:	00000007 	andeq	r0, r0, r7
 b3c:	0000000c 	andeq	r0, r0, ip
 b40:	ffffffff 			; <UNDEFINED> instruction: 0xffffffff
 b44:	7c020001 	stcvc	0, cr0, [r2], {1}
 b48:	000d0c0e 	andeq	r0, sp, lr, lsl #24
 b4c:	00000018 	andeq	r0, r0, r8, lsl r0
 b50:	00000b3c 	andeq	r0, r0, ip, lsr fp
 b54:	0800107c 	stmdaeq	r0, {r2, r3, r4, r5, r6, ip}
 b58:	00000048 	andeq	r0, r0, r8, asr #32
 b5c:	84100e41 	ldrhi	r0, [r0], #-3649	; 0xfffff1bf
 b60:	86038504 	strhi	r8, [r3], -r4, lsl #10
 b64:	00018e02 	andeq	r8, r1, r2, lsl #28
